{"url": "www.yahoo.com/news/politics/", "text": "The Daily Beast\n\nMIAMI—At the epicenter of the coronavirus outbreak in the United States and the world, physicians and nurses in Florida’s besieged health-care system are struggling to keep up with a tidal wave of new cases.Despite what their Republican governor keeps saying, nothing about what Floridians are experiencing seems run-of-the-mill or likely to improve any time soon. If anything, experts and medical workers in the state say, the worst is yet to come.“The past two weeks [have] been crazier than at the beginning of the pandemic,” a nurse at Memorial Hospital West in Pembroke Pines outside Miami, who requested anonymity because she had not received authorization from her hospital to speak to the press, told The Daily Beast. “Everybody is exhausted. I have never seen it like that before.”One of the earliest states to loosen coronavirus restrictions, Florida has been shattering virus records daily for the past few weeks. The Florida Department of Health on Monday reported at least 12,624 new cases, taking total infections to 282,435.While the numbers marked a decrease from Sunday, when the Sunshine State recorded 15,300 new cases—more than all of Europe—they still indicate the infection rate is dire, as dozens of the state’s intensive-care units are at capacity. On Saturday, the state’s positivity rate, or the percentage of COVID-19 tests coming back positive, was at 11.25 percent—a 56 percent increase from just one month ago.But while the medical community has raised alarm bells that Florida’s hospitals are overwhelmed, understaffed, and short on supplies, some state officials are doing their best to downplay the problem. During a Friday press briefing, Gov. Ron DeSantis tried to assuage fears over the record-breaking infection and hospitalization rates by claiming busy hospitals are common in the Sunshine State. Disney World Reopens with Short Lines and Scared Staff, as Florida COVID-19 Cases Spike“We’ve got the census today. I think between 10 and 12 or 13,000—somewhere like that—beds are available,” DeSantis said, referring to the state belatedly releasing county-by-county hospitalization numbers. “There’ll be articles saying, ‘Oh, my gosh. They’re at 90 percent.’ Well, that’s how hospitals normally run.”Characterizing the surge of COVID-19 new cases as a “blip,” the Republican also noted that Florida has had “a lot of different blips.” “We’re now at a higher blip than where we were in May and the beginning of June,” he added.Front-line medical workers and experts in the state paint a much darker picture.On Friday, Memorial Hospital West hospital CEO Leah Carpenter told a local television station that her facility had experienced a massive increase in emergency room visits over the previous three days. “Our hospital capacity is at about 89 percent,” Carpenter told WSVN. “Our ICU capacity is beyond 100 percent.”By Monday, Carpenter was not available to do media interviews because she had to pitch in and help with the patient overload, according to Memorial Hospital West spokesman Stu Oppenheimer. “While Leah is the CEO at Memorial Hospital West, she is also a nurse and currently taking shifts in the hospital during the surge, so she is also unavailable to us for the time being,” Oppenheimer said. “Our frontline workers are all incredibly busy with the current COVID-19 surge.”The state Agency for Health Care Administration’s latest update on hospitalizations showed the number of available beds shrinking drastically: As of Friday, the day statewide hospitalization numbers went public, at least 52 Florida hospitals had no ICU capacity left at all.In Broward, the county with the second-highest number of positive cases and where Memorial Hospital West is located, over 81 percent of beds had been used as of Monday. The hospital only had 50 beds left available, while two other Broward hospitals had none. Intensive care unit beds were even more scarce. Memorial Hospital West had two adult ICU beds left out of 34 and two sister hospitals had no adult ICU beds available. Seven other Broward hospitals also had no adult ICU beds left. The entire state only had 1,151 available adult ICU beds, or 18.7 percent of the total 6,150 adult ICU beds in Florida, according to the Agency for Health Care Administration. Rebekah Jones, the former Florida health department geographer who created the state’s COVID-19 dashboard and who claims she was fired for refusing to manipulate data, told The Daily Beast she was not surprised to see the recent surges because of DeSantis’ “premature push to reopen the state in May.”“Hospital staff have the hardest job in the world right now, more so than any of us scientists,\" she said. “That most hospitals in Florida are at or near capacity frightens me. It should frighten everyone.”To combat the massive increase and lack of space in the emergency room, the Memorial West nurse told The Daily Beast, the hospital staff started to treat patients in the hallways. Or at least they did the last time she was in: The nurse has not been at work since testing positive for the virus and being sent home to quarantine. But she’s been getting regular updates about the chaos inside the hospital near Hollywood, Florida, from a group chat thread with colleagues. “I know it is still crazy because of what they are saying in the chat,” the nurse said, stating that colleagues have indicated the surge doesn’t show any signs of abating. “The hospital is paying for overtime shifts and they are hiring a lot of agency nurses and traveling nurses. I am scared about going back.”The nurse, who said at least four other nurses at that hospital were in quarantine after contracting COVID-19, added, “You discharge one patient and the next one comes right in. If more nurses have to go into quarantine, we will be understaffed.” (Oppenheimer did not immediately respond to follow-up questions for this story.)Florida is one of several U.S. states at a tipping point months after re-opening their economies. It also stands out for not issuing aggressive face-mask mandates at the state level, in contrast even to conservative bastions like Texas.Last week, the Harvard Global Health Institute recommended a number of states, including Florida, Georgia, Arizona, Louisiana, and South Carolina, institute a mandatory stay-at-home order to curtail severe outbreaks. And while those five states have been hit the hardest, Harvard suggested that 15 other states should weigh the possibility of a second shutdown. A New York Times study of the number of daily infections between June 28 and July 5 showed how dire the United States’ uptick was compared to the rest of the world. Arizona and Florida were the two most affected areas on the planet—followed by South Carolina, the country of Bahrain, and Louisiana. Cleveland Clinic Florida, a hospital in Weston, a city neighboring Pembroke Pines, is also feeling the massive impact of the COVID-19 surge. The number of people visiting the ER with virus symptoms has contributed to a dramatic increase in daily patient loads, according to a Cleveland Clinic nurse who also spoke on condition of anonymity because he did not have permission to speak to the media. “Counting [COVID and] non-COVID patients, we went from seeing 100 people to 200 people a day,” the nurse said. “That is how many come in to get checked.”According to the Agency for Health Care Administration, as of Monday, Cleveland Clinic had 25 available beds, of which nine were for adult ICU patients. The nurse said he worked on a 72-year-old patient over the weekend who had to be placed on a ventilator. “We had to do CPR on him,” the nurse said. “The 911 call came in as shortness of breath. But by the time he got to the hospital, he wasn’t breathing at all.”Like Memorial West, Cleveland Clinic is offering overtime shifts to ER nurses, who typically work three 12-hour shifts a week, the nurse said. “Some nurses are now working five days a week picking up two extra shifts,” he said. “We are constantly getting text messages asking if we want extra hours.” A Cleveland Clinic spokesperson acknowledged the hospital had experienced an increase in the number of patients coming to the ER with COVID-19 symptoms. “Most patients do not require admission and are discharged and asked to quarantine at home,” the spokesperson said. “We continue to monitor the fluctuation of COVID-19 cases on a day-to-day basis… We evaluate our staffing needs on a daily basis and have the ability to supplement staffing as needed, which has included the use of contracted nurses.” Likewise, a paramedic who works in Aventura Hospital about 20 minutes outside of Fort Lauderdale—who also requested anonymity for fear of professional retaliation—said his workplace had 70 confirmed COVID-19 patients admitted as of Friday, the day of his most recent shift. “That doesn’t include the confirmed cases that were discharged or the ones still waiting for positive results,” the paramedic said. “The ICU was definitely pretty packed when I was there.”Will Florida’s COVID Gamble Drag Down DeSantis and the GOP?In addition, the paramedic said, there were two days last week when Aventura wasn’t receiving new patients and instructed paramedics to send them to the next nearest hospital. A spokesperson for Aventura did not respond to a request for comment on Monday. According to the Agency for Health Care Administration, Aventura Hospital has 33 available beds left, of which seven are for adult ICU patients. Overall, Miami-Dade hospitals have reached 80 percent bed capacity. “I’ve been there for six years and there’s never been a diversion of patients,” the paramedic said. “That’s how crazy busy we are. That shows you how big of an impact COVID is having.” DeSantis’ office did not respond to The Daily Beast’s request for comment on Monday. But during an evening press conference, the Republican stressed that despite increased positivity rates, Florida was not comparable to other hotspots, like New York. “That’s just generating cases that are not clinically consequential but important to know,” DeSantis said Monday, suggesting the increased testing numbers amounted to little more than a backlog of information. Still, earlier on Monday, one of the same officials who appeared with DeSantis warned South Florida was entering a catastrophic phase of the pandemic. Carlos Migoya, president and CEO of Jackson Health System in Miami-Dade, said the peak was still another two to three weeks away. “You have people who are aggressively saying they don't have to wear a mask and don’t have to do social distancing,” he explained. “Those are the kind of people spreading this disease. If we don’t get this under control and have too many more infections, we are going to have problems.”“Every health-care worker is working nonstop,” added Lilian Abbo, a University of Miami Health System infectious disease physician. “Our workforce is also falling sick and they are getting infected in the community.”Abbo said too many residents were simply ignoring safety measures—such as wearing masks, social distancing and staying at home—that are now more important than ever. “Miami is now the epicenter of the pandemic,” Abbo said. “What we were seeing in Wuhan months ago, we are there now.” Read more at The Daily Beast.Got a tip? Send it to The Daily Beast hereGet our top stories in your inbox every day. Sign up now!Daily Beast Membership: Beast Inside goes deeper on the stories that matter to you. Learn more.", "images": ["https://s.yimg.com/uu/api/res/1.2/9iMfP0ECBsFh_nAfOb4sTg--~B/Zmk9c3RyaW07aD0xNjA7cT04MDt3PTM0MDthcHBpZD15dGFjaHlvbg--/https://s.yimg.com/os/creatr-images/2020-07/7cf19380-c5e9-11ea-bb6d-23d59d2ca439.cf.jpg", "https://s.yimg.com/uu/api/res/1.2/9K20ND5rAb37q5.c7Bl8eQ--~B/Zmk9c3RyaW07aD0xMjM7cT04MDt3PTIyMDthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/thedailybeast.com/7d12d07e69ab53762996cc24a20aad58.cf.jpg", "https://s.yimg.com/uu/api/res/1.2/DpKUzP2vz8U_Lpqo1pY6qg--~B/Zmk9c3RyaW07aD0xMjM7cT04MDt3PTIyMDthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/the_new_york_times_articles_158/6b812c8a03583491dcc77877fc2e577b.cf.jpg", "https://s.yimg.com/uu/api/res/1.2/_rSMEubhiPuXucagNSACvw--~B/Zmk9c3RyaW07aD0xMjM7cT04MDt3PTIyMDthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/thedailybeast.com/7a2ca3eac29e1ba4ebf370cd37cc66ec.cf.jpg", "https://s.yimg.com/uu/api/res/1.2/PakmpnWzaiP_34_XHP5imw--~B/Zmk9c3RyaW07aD0xNjA7cT04MDt3PTM0MDthcHBpZD15dGFjaHlvbg--/https://s.yimg.com/os/creatr-uploaded-images/2020-07/80707ce0-c5f0-11ea-bf7f-e6fe919504ff.cf.jpg", "https://s.yimg.com/uu/api/res/1.2/Ebi.a64PtMPTcVch6LSuMw--~B/Zmk9c3RyaW07aD0xMjM7cT04MDt3PTIyMDthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/the_new_york_times_articles_158/8e731c3050bd06cca755085c853d27a7.cf.jpg", "https://s.yimg.com/uu/api/res/1.2/m70TG2o1aa54roEQZyuHvw--~B/Zmk9c3RyaW07aD0xMjM7cT04MDt3PTIyMDthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/76f3e8050f88859b6023e372c4398cee.cf.jpg", "https://s.yimg.com/g/images/spaceball.gif", "https://s.yimg.com/ny/api/res/1.2/mnh7bX1kkGZEX9WT2.ErPQ--~A/YXBwaWQ9aGlnaGxhbmRlcjtjb250ZXh0PVtvYmplY3QgT2JqZWN0XTtpMTNuPVtvYmplY3QgT2JqZWN0XTttcnNPcHRpb25zPVtvYmplY3QgT2JqZWN0XTtyaWdodFJhaWw9dHJ1ZTt0eXBlPW5ld3M-/https://s.yimg.com/ep/cx/blendr/v2/image-538-jpg_1586102621728.jpeg", "https://s.yimg.com/uu/api/res/1.2/e.sbRJrY0Ew0PZ7esx65kw--~B/Zmk9c3RyaW07aD0xMjM7cT04MDt3PTIyMDthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/744da9f7ddab0f51a7a1351add7278e5.cf.jpg", "https://s.yimg.com/ny/api/res/1.2/FhlgvS3nfUjqRkBet39g7w--~A/YXBwaWQ9aGlnaGxhbmRlcjtjb250ZXh0PVtvYmplY3QgT2JqZWN0XTtpMTNuPVtvYmplY3QgT2JqZWN0XTttcnNPcHRpb25zPVtvYmplY3QgT2JqZWN0XTtyaWdodFJhaWw9dHJ1ZTt0eXBlPW5ld3M-/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2018-11/cbb99720-e714-11e8-bff7-c51a6f11474e", "https://s.yimg.com/ny/api/res/1.2/b8ODmQKwmTLAhGZ6hGIsGw--~A/YXBwaWQ9aGlnaGxhbmRlcjtjb250ZXh0PVtvYmplY3QgT2JqZWN0XTtpMTNuPVtvYmplY3QgT2JqZWN0XTttcnNPcHRpb25zPVtvYmplY3QgT2JqZWN0XTtyaWdodFJhaWw9dHJ1ZTt0eXBlPW5ld3M-/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2018-12/c112e3d0-fd03-11e8-8ffd-92b5ae137a5a", "https://s.yimg.com/uu/api/res/1.2/Lhkhg2Dq2vdQvfmUIIdnYA--~B/Zmk9c3RyaW07aD0xNjA7cT04MDt3PTM0MDthcHBpZD15dGFjaHlvbg--/https://s.yimg.com/os/creatr-uploaded-images/2020-07/33ef09f0-c5a9-11ea-bffd-29e02c992992.cf.jpg", "https://s.yimg.com/uu/api/res/1.2/DNgaWLc.wzxT9DXZarN4lw--~B/Zmk9c3RyaW07aD0xMjM7cT04MDt3PTIyMDthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/e79caa1490e0f36e55836bd6fdf76829.cf.jpg", "https://s.yimg.com/uu/api/res/1.2/3IxmVC.hLRiIzCVSVgZtUw--~B/Zmk9c3RyaW07aD0xMjM7cT04MDt3PTIyMDthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/ap.org/06c51e00c5dc11513f02ebecdb833a64.cf.jpg", "https://s.yimg.com/uu/api/res/1.2/WoffJwLUQaHv0ZO1kjbJNw--~B/Zmk9c3RyaW07aD0xMjM7cT04MDt3PTIyMDthcHBpZD15dGFjaHlvbg--/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2020-07/28c634e0-c5cc-11ea-bfff-687d6715fe25.cf.jpg", "https://s.yimg.com/uu/api/res/1.2/RzQZvAZ_FzFVWC2uh2OHZA--~B/Zmk9c3RyaW07aD0xMjM7cT04MDt3PTIyMDthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/nbc_news_122/715da3dd441c24427404710c49dcd41b.cf.jpg", "https://s.yimg.com/uu/api/res/1.2/eIgSHFIvf.0bhUQyMDItQQ--~B/Zmk9c3RyaW07aD0xMjM7cT04MDt3PTIyMDthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-us/usa_today_news_641/03aaedb084db595dc18eb2d9dd1dc548.cf.jpg", "https://s.yimg.com/uu/api/res/1.2/DffoVduRN1T315QXwKOe3A--~B/Zmk9c3RyaW07aD0xNjA7cT04MDt3PTM0MDthcHBpZD15dGFjaHlvbg--/https://s.yimg.com/os/creatr-uploaded-images/2020-07/1edbc780-c5d4-11ea-aef7-0eb560dd4209.cf.jpg", "https://s.yimg.com/uu/api/res/1.2/QAtQwGaj9lydP6fGwOiEFQ--~B/Zmk9c3RyaW07aD0xMjM7cT04MDt3PTIyMDthcHBpZD15dGFjaHlvbg--/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2020-07/d6172c50-c5ca-11ea-bde2-46b30ab31167.cf.jpg", "https://s.yimg.com/uu/api/res/1.2/KhgxFFOGnJDc4g7DUd3xqg--~B/Zmk9c3RyaW07aD0xMjM7cT04MDt3PTIyMDthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/e5ce90f69e66ad8c01f069ca7069f59a.cf.jpg", "https://s.yimg.com/uu/api/res/1.2/3RG29QSaYHHi0uyUjA_OyA--~B/Zmk9c3RyaW07aD0xMjM7cT04MDt3PTIyMDthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/the_new_york_times_articles_158/b25ba96e6a5e3b7816728fef47e52189.cf.jpg", "https://s.yimg.com/ny/api/res/1.2/ipzp89_4yJ6wNU5C.XXVsw--~A/YXBwaWQ9aGlnaGxhbmRlcjtjb250ZXh0PVtvYmplY3QgT2JqZWN0XTtpMTNuPVtvYmplY3QgT2JqZWN0XTttcnNPcHRpb25zPVtvYmplY3QgT2JqZWN0XTtyaWdodFJhaWw9dHJ1ZTt0eXBlPW5ld3M-/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-01/ab14e3e0-1d46-11e9-afff-06631950a33c", "https://s.yimg.com/uu/api/res/1.2/ak6137yit80FLla_q.UEog--~B/Zmk9c3RyaW07aD0xMjM7cT04MDt3PTIyMDthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-GB/the_guardian_765/7a94698412e3501986d4354ca18df84f.cf.jpg", "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "https://s.yimg.com/uu/api/res/1.2/JSzxBnNmACiRfSRmGz2u2Q--~B/Zmk9c3RyaW07aD0xNjA7cT04MDt3PTM0MDthcHBpZD15dGFjaHlvbg--/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2020-07/862637f0-c53d-11ea-bef7-3bdf37a2a3b4.cf.jpg", "https://s.yimg.com/uu/api/res/1.2/yOF_TWI_GqxHQ_f6lmCqRw--~B/Zmk9c3RyaW07aD0xMjM7cT04MDt3PTIyMDthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/thedailybeast.com/20e26b8ca23dba7d5dddb6fa272b9dd5.cf.jpg", "https://s.yimg.com/uu/api/res/1.2/c8FJi9ND8ce7vt0dpqVh2A--~B/Zmk9c3RyaW07aD0xMjM7cT04MDt3PTIyMDthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/thedailybeast.com/012c329cc4722659ae0b4151c002065b.cf.jpg", "https://s.yimg.com/ny/api/res/1.2/QQsKO9DIcPlyitXwULyl6g--~A/YXBwaWQ9aGlnaGxhbmRlcjtjb250ZXh0PVtvYmplY3QgT2JqZWN0XTtpMTNuPVtvYmplY3QgT2JqZWN0XTttcnNPcHRpb25zPVtvYmplY3QgT2JqZWN0XTtyaWdodFJhaWw9dHJ1ZTt0eXBlPW5ld3M-/https://s.yimg.com/ep/cx/blendr/v2/image-reason-jpg_1564501741347.jpeg", "https://s.yimg.com/uu/api/res/1.2/u4qQ8gAh0hk6jvr0_BWPyw--~B/Zmk9c3RyaW07aD0xMjM7cT04MDt3PTIyMDthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-us/usa_today_news_641/ed0d044d8059ccc1d9f2308342040cf8.cf.jpg", "https://s.yimg.com/uu/api/res/1.2/bOvqNZdF8lhE1XvQ3R3Gng--~B/Zmk9c3RyaW07aD0xMjM7cT04MDt3PTIyMDthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/gma/us.abcnews.gma.com/fauci-file-rt-ml-200713_hpMain_2_16x9_992.jpg.cf.jpg", "https://s.yimg.com/uu/api/res/1.2/BcOiLOaNFWZhYesZoS5mpQ--~B/Zmk9c3RyaW07aD0xMjM7cT04MDt3PTIyMDthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-us/usa_today_news_641/35abc5d2ccc948053b1c55793a376825.cf.jpg", "https://s.yimg.com/uu/api/res/1.2/bSyN35NGX6A9roANpBrSRQ--~B/Zmk9c3RyaW07aD0xMjM7cT04MDt3PTIyMDthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/the_new_york_times_articles_158/dd8cf1edb381635e5d5c34d935c4a429.cf.jpg", "https://s.yimg.com/uu/api/res/1.2/nJnd358.ybsj5OV_eDvfoQ--~B/Zmk9c3RyaW07aD00MDQ7cT05NTt3PTcyMDthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/gma/us.abcnews.gma.com/sessions-trump-01-as-ap-200713_hpMain_16x9_992.jpg.cf.jpg"], "top_img": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "keywords": [], "authors": [], "canonical_link": "https://news.yahoo.com/politics/", "title": "Yahoo News - Latest News & Headlines", "meta_data": {"msapplication-TileColor": "#6e329d", "msapplication-TileImage": "https://s.yimg.com/rz/p/yahoo_frontpage_en-US_s_f_w_bestfit_frontpage.png", "msvalidate.01": "A9862C0E6E1BE95BCE0BF3D0298FD58B", "referrer": "unsafe-url", "theme-color": "#400090", "twitter": {"dnt": "on", "site": "@YahooNews", "card": "summary", "description": "The latest news and headlines from Yahoo! News. Get breaking news stories and in-depth coverage with videos and photos.", "image": {"identifier": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "src": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png"}, "title": "Politics | Yahoo News - Latest News & Headlines"}, "application-name": "Yahoo News - Latest News & Headlines", "apple-itunes-app": "app-id=304158842", "oath": {"guce": {"consent-host": "guce.yahoo.com"}}, "description": "The latest news and headlines from Yahoo! News. Get breaking news stories and in-depth coverage with videos and photos.", "og": {"type": "website", "description": "The latest news and headlines from Yahoo! News. Get breaking news stories and in-depth coverage with videos and photos.", "image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "title": "Politics | Yahoo News - Latest News & Headlines"}, "fb": {"pages": 338028696036, "app_id": 458584288257241}}, "movies": [], "publish_date": null, "source": "http://www.yahoo.com", "summary": ""}