{"url": "http://www.nfib-sbet.org/", "text": "SMALL BUSINESS ECONOMIC TRENDS\n\nThe Small Business Optimism Index increased 3.5 points in May to 94.4, a strong improvement from April’s 90.9 reading. Eight of the 10 Index components improved in May and two declined. The NFIB Uncertainty Index increased seven points to 82. Reports of expected business conditions in the next six months increased 5 points to a net 34%, following a 24-point increase in April. Owners are optimistic about future business conditions and expect the recession to be short-lived.\n\n“As states begin to reopen, small businesses continue to navigate the economic landscape rocked by COVID-19 and new government policies,” said NFIB’s Chief Economist Bill Dunkelberg. “It’s still uncertain when consumers will feel comfortable returning to small businesses and begin spending again, but owners are taking the necessary precautions to reopen safely.”\n\nReal sales expectations in the next three months increased 18 points to a net negative 24%. Expectations about future sales are beginning to rebound after April’s lowest reading in survey history of a net negative 42%.\n\nFifty-two percent reported capital outlays in the last six months. Of those making expenditures, 35% reported spending on new equipment (down one point), 20% acquired vehicles (down one point), and 15% improved or expanded facilities (up two points). Five percent acquired new buildings or land for expansion and 10% spent money for new fixtures and furniture.\n\nTwenty percent of owners are planning capital outlays in the next few months. Any extensive damage from recent protests will produce significant expenditures that were unexpected for some small business owners.\n\nA net negative 19% of all owners (seasonally adjusted) reported higher nominal sales in the past three months, down eight points from April. Retail sales have declined significantly in the past three months. Consumer income was up significantly due to government programs assistance, but consumers, for the most part, could not get out to spend it unless they spent it online. The change in spending behavior produced a record-high savings rate of 33%. As the economy opens, this money will be spent.\n\nOther key findings from the survey include:\n\nEarnings trends declined six points to a net negative 26%. Among owners reporting weaker profits, 46% blamed weak sales, 12% blamed usual seasonal changes, 9% cited price changes, 4% cited labor costs, and 4% cited material costs. Five percent of owners reported thinking it’s a good time to expand, up two points from April. The net negative percent of owners expecting higher real sales volumes improved 18 points to a net negative 24% of owners. A net 14% (seasonally adjusted) reported raising compensation (down 2 points) and a net 10% plan to do so in the coming months (up 3 points).\n\nAs reported in last week’s monthly jobs report, the small business labor market weakened further in the February-April period, with May survey respondents reporting reducing employment by 0.17 workers per firm in the prior three months. Most of the workers that were displaced (about 80%) expect to be rehired according to the Bureau of Labor Statistics. However, generous unemployment benefits are making it harder for some firms to re-call workers and fill open positions.\n\nA seasonally adjusted net eight percent plan to create new jobs in May. The creation is driven in part by the forgiveness portion requirements of the Paycheck Protection Program and owners planning to re-hire workers as the economy is reopened.", "images": ["http://www.nfib-sbet.org/wp-content/themes/nfib/img/homespinner.gif", "http://www.nfib-sbet.org/wp-content/themes/nfib/img/spinner-page.gif"], "top_img": "http://www.nfib-sbet.org/wp-content/themes/nfib/img/spinner-page.gif", "keywords": [], "authors": [], "canonical_link": "", "title": "NFIB", "meta_data": {"viewport": "width=1024"}, "movies": [], "publish_date": null, "source": "http://www.nfib-sbet.org", "summary": ""}