{"url": "https://www.harpersbazaar.com/celebrity/red-carpet-dresses/g4064/iconic-vma-red-carpet-fashion/", "text": "10 Films to Educate Yourself on Anti-Racism\n\nHow to Support the Black Trans Community\n\nWhat Is \"Pride\" After Pride?\n\n10 Ways to Get Your Culture Fix in July\n\nThe MTV red carpet has seen everything from bikini tops to meat dresses.\n\nEvery product on this page was chosen by a Harper's BAZAAR editor. We may earn commission on some of the items you choose to buy.\n\nGetty Images Calling MTV's Video Music Award style irreverent would be a bit of an understatement. It may not be the Oscars, but in its over three decade history, the MTV carpet has seen everything from crazy cut-out dresses to bikini tops, matching looks, and even meat dresses—with a Tom Ford suit or Dolce dress thrown in for good style measure. Click through to take a look back through the most memorable and iconic VMAs red carpet looks over the years. View Gallery 61 Photos Getty Images 1 of 61 Madonna, 1984 The Like a Virgin singer debuted one of her most iconic looks of all time—a white lace bustier dress complete with matching gloves and a belt reading 'BOY TOY'—at the 1984 show. Getty Images 2 of 61 Cyndi Lauper, 1988 The singer showed off a sparkling bra in this little black mini dress look. Getty Images 3 of 61 Christina Applegate, 1989 Going for an unexpected '50s glamour moment, the actress wore this ultra-feminine floral look back in 1989. Getty Images 4 of 61 Kim Basinger, 1990 Kim Basinger brought Sandy's iconic Grease finale outfit to life on the MTV red carpet. Getty Images 5 of 61 Cindy Crawford, 1992 The supermodel stunned in a cut-out, bondage-inspired Versace look at the '92 VMAs. Getty Images 6 of 61 Courtney Love & Kurt Cobain, 1993 In one of their final red carpet appearances together, Courtney Love and Kurt Cobain brought their daughter Frances Bean to the VMAs. While Courtney opted for a glam, Marilyn Monroe-inspired look, Kurt went for a beatnik-esque outfit and red shades. Getty Images 7 of 61 Sharon Stone, 1993 Going full-on glam, Sharon Stone took the VMA red carpet up a notch with this showstopping gown. Getty Images 8 of 61 Cindy Crawford, 1993 The super took note from Madonna and went for an all-black sheer gown and two cross necklaces. Getty Images 9 of 61 Drew Barrymore, 1995 The actress famously wore daisies in her hair with this sexy bombshell look. Getty Images 10 of 61 TLC, 1995 The girl band went for a matching shipwrecked look at the 1995 awards. Getty Images 11 of 61 Sofia Coppola, 1995 The director went for a bold, risk-taking look in this sheer nightgown layered over a white tank and black panties. Getty Images 12 of 61 Gwyneth Paltrow, 1996 Bringing a suit moment to the typically more playful red carpet, Gwyneth stood out in a red velvet suit. Getty Images 13 of 61 Mariah Carey, 1997 The singer showed some serious skin in this now iconic cut-out gown. Getty Images 14 of 61 Rose McGowan, 1998 And who could forget the most naked VMA red carpet moment of all time? The actress bared it all in a black sequin look that left little to the imagination. Getty Images 15 of 61 Gwen Stefani, 1998 During her No Doubt days, Gwen Stefani wore this memorable alien-inspired look with blue hair that matched her fur bikini top. 16 of 61 Lil' Kim, 1999 In one of the most iconic VMA red carpet moments of all time, Lil Kim shut it down in this daring one-shouldered jumpsuit and matching sequin nipple pasties. Getty Images 17 of 61 Gisele Bundchen, 2000 Making her VMA debut, Gisele hit the red carpet in this chic turtleneck gown. Getty Images 18 of 61 Aaliyah, 2000 The late R&B singer stunned in an eye-catching animal print gown back in 2000. Getty Images 19 of 61 Jennifer Lopez, 2000 Wearing Sean John and a matching white bandana, JLo helped define the early 2000s style with this look. Getty Images 20 of 61 Destiny's Child, 2001 Upping the girl band style game, Destiny's Child went for it in these colorful looks designed by Beyonce's mom, Tina Knowles. Getty Images 21 of 61 Janet Jackson, 2001 The icon rocked a lacy naked dress, black lingerie, and patent over-the-knee boots in 2001. Getty Images 22 of 61 Macy Gray, 2001 Taking self-promotion to a new level, Macy Gray's gown literally spelled out her album release. Getty Images 23 of 61 Britney Spears, 2002 Who could forget Britney's sexy, dominatrix-inspired leather outfit at the 2002 VMAs? Compete with matching lace gloves, lace-up pumps, and a black leather newsboy cap, of course. Getty Images 24 of 61 Paris Hilton, 2002 The poster child of early 2000s fashion, Paris Hilton embraced the shipwrecked trend with this ultra-pink red carpet look that helped define the era's style. 25 of 61 Christina Aguilera, 2003 The singer turned it out in this hot pink feathered mini dress at the 2003 VMAs. Getty Images 26 of 61 Gwen Stefani, 2004 Debuting a new look, the singer went for a retro-inspired look adorned with a flower in her updo. Getty Images 27 of 61 Naomi Campbell, 2004 The supermodel let her accessories do the talking in this little white dress look. Getty Images 28 of 61 Christina Aguilera, 2006 Entering a new era of Xtina, the singer went full-on Old Hollywood glam in a plunging sequin gown, diamond necklace, and platinum curls. Getty Images 29 of 61 Rihanna, 2007 In one of her first VMA appearances, Riri went for a striking hot pink gown. Getty Images 30 of 61 Taylor Swift, 2009 For what turned out to be an eventful VMAs for her, the singer wore a sequined one-shoulder gown and a wavy updo. Next 40 Times Madonna Shocked Us All With Her Outfit Advertisement - Continue Reading Below\n\nThis content is created and maintained by a third party, and imported onto this page to help users provide their email addresses. You may be able to find more information about this and similar content at piano.io\n\nThis commenting section is created and maintained by a third party, and imported onto this page. You may be able to find more information on their web site.", "images": ["https://hips.hearstapps.com/hbz.h-cdn.co/assets/cm/15/11/55024bd3bcecb_-_hbz-vmas-1989-111173081-christina-applegate-7523983.jpg?crop=1.0xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-vmas-index-1565905473.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "https://hips.hearstapps.com/hbz.h-cdn.co/assets/cm/15/04/54bd3b2227255_-_hbz-vmas-1988-110440446-cyndi-lauper-8436302.jpg?crop=1.0xw:1xh;center,top&resize=480:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://hips.hearstapps.com/hbz.h-cdn.co/assets/cm/15/04/54bd3b2183d35_-_hbz-vmas-1984-91342386-madonna-8026431-xl.jpg?crop=1.0xw:1xh;center,top&resize=480:*"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-vmas-index-1565905473.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "keywords": [], "authors": ["Jennifer Algoo"], "canonical_link": "https://www.harpersbazaar.com/celebrity/red-carpet-dresses/g4064/iconic-vma-red-carpet-fashion/", "title": "VMAs Fashion Moments We'll Never Forget", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=6", "msapplication-tap-highlight": "no", "theme-color": "#606060", "og": {"type": "article", "site_name": "Harper's BAZAAR", "title": "VMAs Fashion Moments We'll Never Forget", "description": "The MTV red carpet has seen everything from bikini tops to meat dresses.", "url": "https://www.harpersbazaar.com/celebrity/red-carpet-dresses/iconic-vma-red-carpet-fashion", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-vmas-index-1565905473.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 227018747326504, "pages": 8327967561}, "article": {"publisher": "https://www.facebook.com/HarpersBazaar", "modified_time": "2019-08-16 08:03:31", "published_time": "2019-08-15 09:45:00", "section": "Red Carpet Dresses", "opinion": "false"}, "twitter": {"site": "@harpersbazaarus", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-vmas-index-1565905473.jpg?crop=1.00xw:1.00xh;0,0&resize=640:*"}, "google-site-verification": "bNUXKPTEqUVDbaxHrYA-c1kj007Ao4VsMKdoU80EyiU", "title": "Most Iconic VMAs Fashion Moments Of All Time - Best VMAs Red Carpet Fashion", "description": "Bazaar's roundup of the most unforgettable red carpet fashion from MTV's VMAs.", "keywords": "VMA,red carpet dresses,iconic fashion moments,style,celebrity style,mtv vmas,celebrity red carpet,fashion,vma 2014,MTV", "auto-publish": "evergreen", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-vmas-index-1565905473.jpg?crop=0.502xw:1.00xh;0.250xw,0&resize=320:*", "sailthru.contenttype": "gallery", "sailthru.tags": "Celebrity,celebrity,red-carpet-dresses,iconic fashion moments,celebrity red carpet,red carpet fashion,style,mtv,celebrity style,mtv video music awards,red carpet dresses,fashion", "sailthru.date": "2019-08-15T21:45:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-vmas-index-1565905473.jpg?crop=1.00xw:1.00xh;0,0", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-vmas-index-1565905473.jpg?crop=0.502xw:1.00xh;0.250xw,0", "sailthru.socialtitle": "VMAs Fashion Moments We'll Never Forget", "sailthru.excerpt": "Calling MTV's Video Music Award style irreverent would be a bit of an understatement. It may not be the Oscars, but in its over three decade history, the MTV carpet has seen everything from crazy cut-out dresses to bikini tops, matching looks, and even meat dresses—with a Tom Ford suit..."}, "movies": [], "publish_date": 1565842500.0, "source": "https://www.harpersbazaar.com", "summary": ""}