{"url": "https://www.independent.co.uk/news/uk/home-news/meghan-markle-instagram-facebook-twitter-delete-social-media-accounts-a8150641.html", "text": "Meghan Markle has closed her social media accounts, Kensington Palace confirmed.\n\nMarkle, who spent Tuesday afternoon visiting a Brixton community radio station with fiance Prince Harry, shut down her Twitter, Facebook and Instagram accounts.\n\nThe palace said she was \"grateful to everyone who has followed her social media accounts over the years\" but had closed them \"as she has not used these accounts for some time\".\n\nDownload the new Independent Premium app Sharing the full story, not just the headlines\n\nThe decision to close her social media accounts is in line with her changing status, as she will soon become a member of the royal family when she marries Harry in May.\n\nSenior members of the monarchy have official Twitter and Instagram accounts, run by the social media teams of their households, which do not normally feature personal tweets or posts.\n\nThe exception is the Duke of York who sometimes writes tweets himself but signs them \"AY\".\n\nMarkle will come under Kensington Palace after her wedding and social media postings will be made on her behalf by its communications staff.\n\nIn December 2017, the US actress had 1.9 million people following her posts on Instagram, and more than 350,000 Twitter followers.\n\nHer Facebook page had almost 800,000 likes, according to BBC Online.\n\nShape Created with Sketch. UK news in pictures Show all 50 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. UK news in pictures 1/50 8 July 2020 Players take a knee in support of the Black Lives Matter movement on the first day of the first Test cricket match between England and the West Indies at the Ageas Bowl in Southampton AFP via Getty 2/50 7 July 2020 A circus performer from the Association of Circus Proprietors in Whitehall, London. The association handed a petition to Downing Street to ask Prime Minister Boris Johnson to allow circuses to reopen EPA 3/50 6 July 2020 Bamburgh Castle in Northumberland, which re-opened to the public after being closed due to the coronavirus lockdown PA 4/50 5 July 2020 People visit Columbia Road Flower Market, London, as it reopens following the easing of coronavirus lockdown restrictions across England PA 5/50 4 July 2020 A member of bar staff wearing PPE in the form of a face mask, pours drinks inside the The Goldengrove in Stratford AFP via Getty 6/50 3 July 2020 Cardboard cutouts of fans in the stands prior to the League One play-off semi final match between Portsmouth and Oxford United at Fratton Park PA 7/50 2 July 2020 A diver cleans the inside window of the seal tank at Tynemouth Aquarium in North Shields, as it prepares to open on Saturday after further coronavirus lockdown restrictions are lifted in England PA 8/50 1 July 2020 Slackliner Sandor Nagy practices on the beach in Boscombe, on the south coast of England AFP via Getty 9/50 30 June 2020 (left to right) Sinn Fein leader Mary Lou McDonald, former Sinn Fein leader Gerry Adams, and Deputy First Minister Michelle O'Neill attending the funeral of senior Irish Republican and former leading IRA figure Bobby Storey in west Belfast PA 10/50 29 June 2020 Former Team GB Rhythmic Gymnastic dancer Hannah Martin during a training session at Ouse Valley Viaduct in Sussex Reuters 11/50 28 June 2020 People visit Bolton Abbey in Yorkshire, that recently reopened following the easing of coronavirus lockdown restriction PA 12/50 27 June 2020 A protest for Justice for Shukri Abdi on Trafalgar Square in London, following a raft of Black Lives Matter protests across the UK PA 13/50 26 June 2020 Police at the scene of an incident at the Park Inn Hotel in central Glasgow. Scottish police said armed officers shot dead a man after a suspected stabbing in the city centre left six others injured, including one of their colleagues. Several roads were closed and the surrounding area was cordoned off AFP via Getty 14/50 25 June 2020 A horse is washed down at Haydock Racecourse PA 15/50 24 June 2020 People enjoy the hot weather on Margate beach Reuters 16/50 23 June 2020 Tony Bennett the owner of The Devereux pub in Temple, London. Pub and hospitality bosses have cheered the Government's proposals to allow customers through their doors again on July 4 as \"a welcome relief\". PA Photo. Picture date: Tuesday June 23, 2020. Prime Minister Boris Johnson said on Tuesday that pubs, restaurants and cinemas will be able to reopen from July 4, with \"one metre-plus\" distancing measures in place PA 17/50 22 June 2020 Police forensics officers carry out a search near Forbury Gardens, in Reading town centre, the scene of a multiple stabbing attack which took place at around 7pm on Saturday, leaving three people dead and another three seriously injured PA 18/50 21 June 2020 Soccer Football - Premier League - Everton v Liverpool - Goodison Park, Liverpool, Britain - June 21, 2020 Children play football outside the stadium before the match, as play resumes behind closed doors following the outbreak of the coronavirus disease (COVID-19) Action Images via Reuters 19/50 20 June 2020 Arsenal's midfielder Nicolas Pepe kneels before the Premier League match against Brighton and Hove Albion at the American Express Community Stadium in southern England AFP via Getty 20/50 19 June 2020 Bianca Walkden during a training session at the National Taekwondo Centre in Manchester PA 21/50 18 June 2020 French President Emmanuel Macron gestures about social distancing alongside Prime Minister Boris Johnson as he arrives at Downing Street for a meeting. Macron also visited London to commemorate the 80th anniversary of former French president Charles de Gaulle's appeal to French people to resist the Nazi occupation during World War II AFP 22/50 17 June 2020 Players kneel, as well as, having 'Black Lives Matter' in place of names on their shirts prior to the start of the Premier League match between Aston Villa and Sheffield United at Villa Park in Birmingham. The league resumed after its three-month suspension because of coronavirus AP 23/50 16 June 2020 Motakhayyel ridden by Jim Crowley, right, wins the Buckingham Palace Handicap during day one of Royal Ascot. This year, the flat racing's biggest meeting, is behind closed doors due to the coronavirus outbreak PA 24/50 15 June 2020 Queues form at Primark at the Rushden Lakes shopping complex after the government relaxed coronavirus lockdown laws significantly, allowing zoos, safari parks and non-essential shops to open to visitors Getty 25/50 14 June 2020 A man kneels at a commemoration to mark the third anniversary of the Grenfell Tower fire in London. The fire claimed 72 lives on 14 June 2017 PA 26/50 13 June 2020 Protesters confront police in Whitehall near Parliament Square, during a protest by the Democratic Football Lads Alliance PA 27/50 12 June 2020 A Black Lives Matter supporter sings to crowds who marched with her in front of the National Gallery in Trafalgar Square in London. The death of an African American man, George Floyd, while in the custody of Minneapolis police has sparked protests across the United States, as well as demonstrations of solidarity in many countries around the world Getty 28/50 11 June 2020 Scouts show their support at the Lord Baden-Powell statue in Poole. The statue of Robert Baden-Powell on Poole Quay is to be placed in \"safe storage\" following concerns about his racial views Getty 29/50 10 June 2020 Social distancing markers around the penguin enclosure at London Zoo. Staff have been preparing and are now ready for reopening next week with new signage, one-way trails for visitors to follow, and extra handwashing and sanitiser stations in place PA 30/50 9 June 2020 Protestors hold placards and shout slogans during during a protest called by the Rhodes Must Fall campaign calling for the removal of the statue of British imperialist Cecil John Rhodes outside Oriel College, at the University of Oxford AFP via Getty 31/50 8 June 2020 Hermione Wilson helps to install a new artwork at Jupiter Artland, Edinburgh, created as a tribute to the NHS titled \"A Thousand Thank Yous\" originally devised by the late Allan Kaprow which consists of colourful painted messages on cardboard and has been directed remotely by London-based artist Peter Liversidge PA 32/50 7 June 2020 The Edward Colston statue has been pulled down by Black Lives Matter protesters in Bristol. Colston was a 17th century slave trader who has numerous landmarks named after him in Bristol SWNS 33/50 6 June 2020 Children pose for their family in front of discarded placards fixed on a wall in Piccadilly Gardens after a Black Lives Matter demonstrations in Manchester. The death of an African-American man, George Floyd, while in the custody of Minneapolis police has sparked protests across the United States, as well as demonstrations of solidarity in many countries around the world Getty 34/50 5 June 2020 Protesters kneel in Trafalgar Square during a Black Lives Matter demonstration in London, England. The death of an African-American man, George Floyd, while in the custody of Minneapolis police has sparked protests across the United States, as well as demonstrations of solidarity in many countries around the world Getty 35/50 4 June 2020 Protestors march from Windsor Castle in solidarity with the Black Lives Matter movement Getty 36/50 3 June 2020 People wearing face masks hold banners in Hyde Park during a Black Lives Matter protest following the death of George Floyd who died in police custody in Minneapolis Reuters 37/50 2 June 2020 Street artist Nath Murdoch touches up his anti-racism mural in Peterborough, Cambridgeshire PA 38/50 1 June 2020 Customers socially distance themselves as they queue to enter Ikea in Warrington. The store opening saw large queues of people and traffic on adjacent roads as it reopened after the lockdown. The furniture and housewares chain reopened its stores across England and Northern Ireland subject to several restrictions, keeping its restaurants closed and asking customers to shop alone Getty 39/50 31 May 2020 A man wearing a protective face mask kneels in front of police officers during a protest against the death in Minneapolis police custody of African-American man George Floyd near the U.S. Embassy, London, Britai Reuters 40/50 30 May 2020 Visitors at Grassholme Reservoir in Lunedale, Co Durham are able to cross an ancient packhorse bridge as work on the dam wall means water levels have dropped signifcantly to reveal this monument of the pas UK 41/50 29 May 2020 British Tennis player Maia Lumsden in action at Bridge of Allan Tennis Club. People can meet family and friends outdoors and play sports such as golf and tennis again as the country is moving into phase one of the Scottish Government's plan for gradually lifting lockdown PA 42/50 28 May 2020 A police frogman, searches for a weapon in Abington Lake in in Northampton Getty 43/50 27 May 2020 Prime Minister Boris Johnson appears before the Liaison Committee via Zoom from the cabinet room at 10 Downing Street, amid the coronavirus 10 Downing Street/Reuters 44/50 26 May 2020 Members of the public relax on the beach at Botany Bay in Margate Getty 45/50 25 May 2020 Dominic Cummings, senior aide to Prime Minister Boris Johnson, makes a statement inside 10 Downing Street, London, over allegations he breached coronavirus lockdown restrictions AP 46/50 24 May 2020 A demonstrator holds a sign reading 'Why are you above the law?' outside the house of Dominic Cummings in London, following allegations Cummings broke coronavirus lockdown rules by travelling across the country Reuters 47/50 23 May 2020 People take a walk near Durdle Door as cows graze in Lulworth Reuters 48/50 22 May 2020 Waves break onto a wall at Brighton beach Reuters 49/50 21 May 2020 Cafe owner Francini Osorio serves customers in a trial phase during the coronavirus lockdown. Osorio has installed an air purifier and 35 clear shower curtains, which will divide customers and tables, in the Francini Cafe De Colombia, Worcester, ready for the re-opening of his business as lockdown restrictions are eased PA 50/50 20 May 2020 People at Bournemouth beach in Dorset, as people flock to parks and beaches with lockdown measures eased. The Met Office has predicted the hottest day of the year PA 1/50 8 July 2020 Players take a knee in support of the Black Lives Matter movement on the first day of the first Test cricket match between England and the West Indies at the Ageas Bowl in Southampton AFP via Getty 2/50 7 July 2020 A circus performer from the Association of Circus Proprietors in Whitehall, London. The association handed a petition to Downing Street to ask Prime Minister Boris Johnson to allow circuses to reopen EPA 3/50 6 July 2020 Bamburgh Castle in Northumberland, which re-opened to the public after being closed due to the coronavirus lockdown PA 4/50 5 July 2020 People visit Columbia Road Flower Market, London, as it reopens following the easing of coronavirus lockdown restrictions across England PA 5/50 4 July 2020 A member of bar staff wearing PPE in the form of a face mask, pours drinks inside the The Goldengrove in Stratford AFP via Getty 6/50 3 July 2020 Cardboard cutouts of fans in the stands prior to the League One play-off semi final match between Portsmouth and Oxford United at Fratton Park PA 7/50 2 July 2020 A diver cleans the inside window of the seal tank at Tynemouth Aquarium in North Shields, as it prepares to open on Saturday after further coronavirus lockdown restrictions are lifted in England PA 8/50 1 July 2020 Slackliner Sandor Nagy practices on the beach in Boscombe, on the south coast of England AFP via Getty 9/50 30 June 2020 (left to right) Sinn Fein leader Mary Lou McDonald, former Sinn Fein leader Gerry Adams, and Deputy First Minister Michelle O'Neill attending the funeral of senior Irish Republican and former leading IRA figure Bobby Storey in west Belfast PA 10/50 29 June 2020 Former Team GB Rhythmic Gymnastic dancer Hannah Martin during a training session at Ouse Valley Viaduct in Sussex Reuters 11/50 28 June 2020 People visit Bolton Abbey in Yorkshire, that recently reopened following the easing of coronavirus lockdown restriction PA 12/50 27 June 2020 A protest for Justice for Shukri Abdi on Trafalgar Square in London, following a raft of Black Lives Matter protests across the UK PA 13/50 26 June 2020 Police at the scene of an incident at the Park Inn Hotel in central Glasgow. Scottish police said armed officers shot dead a man after a suspected stabbing in the city centre left six others injured, including one of their colleagues. Several roads were closed and the surrounding area was cordoned off AFP via Getty 14/50 25 June 2020 A horse is washed down at Haydock Racecourse PA 15/50 24 June 2020 People enjoy the hot weather on Margate beach Reuters 16/50 23 June 2020 Tony Bennett the owner of The Devereux pub in Temple, London. Pub and hospitality bosses have cheered the Government's proposals to allow customers through their doors again on July 4 as \"a welcome relief\". PA Photo. Picture date: Tuesday June 23, 2020. Prime Minister Boris Johnson said on Tuesday that pubs, restaurants and cinemas will be able to reopen from July 4, with \"one metre-plus\" distancing measures in place PA 17/50 22 June 2020 Police forensics officers carry out a search near Forbury Gardens, in Reading town centre, the scene of a multiple stabbing attack which took place at around 7pm on Saturday, leaving three people dead and another three seriously injured PA 18/50 21 June 2020 Soccer Football - Premier League - Everton v Liverpool - Goodison Park, Liverpool, Britain - June 21, 2020 Children play football outside the stadium before the match, as play resumes behind closed doors following the outbreak of the coronavirus disease (COVID-19) Action Images via Reuters 19/50 20 June 2020 Arsenal's midfielder Nicolas Pepe kneels before the Premier League match against Brighton and Hove Albion at the American Express Community Stadium in southern England AFP via Getty 20/50 19 June 2020 Bianca Walkden during a training session at the National Taekwondo Centre in Manchester PA 21/50 18 June 2020 French President Emmanuel Macron gestures about social distancing alongside Prime Minister Boris Johnson as he arrives at Downing Street for a meeting. Macron also visited London to commemorate the 80th anniversary of former French president Charles de Gaulle's appeal to French people to resist the Nazi occupation during World War II AFP 22/50 17 June 2020 Players kneel, as well as, having 'Black Lives Matter' in place of names on their shirts prior to the start of the Premier League match between Aston Villa and Sheffield United at Villa Park in Birmingham. The league resumed after its three-month suspension because of coronavirus AP 23/50 16 June 2020 Motakhayyel ridden by Jim Crowley, right, wins the Buckingham Palace Handicap during day one of Royal Ascot. This year, the flat racing's biggest meeting, is behind closed doors due to the coronavirus outbreak PA 24/50 15 June 2020 Queues form at Primark at the Rushden Lakes shopping complex after the government relaxed coronavirus lockdown laws significantly, allowing zoos, safari parks and non-essential shops to open to visitors Getty 25/50 14 June 2020 A man kneels at a commemoration to mark the third anniversary of the Grenfell Tower fire in London. The fire claimed 72 lives on 14 June 2017 PA 26/50 13 June 2020 Protesters confront police in Whitehall near Parliament Square, during a protest by the Democratic Football Lads Alliance PA 27/50 12 June 2020 A Black Lives Matter supporter sings to crowds who marched with her in front of the National Gallery in Trafalgar Square in London. The death of an African American man, George Floyd, while in the custody of Minneapolis police has sparked protests across the United States, as well as demonstrations of solidarity in many countries around the world Getty 28/50 11 June 2020 Scouts show their support at the Lord Baden-Powell statue in Poole. The statue of Robert Baden-Powell on Poole Quay is to be placed in \"safe storage\" following concerns about his racial views Getty 29/50 10 June 2020 Social distancing markers around the penguin enclosure at London Zoo. Staff have been preparing and are now ready for reopening next week with new signage, one-way trails for visitors to follow, and extra handwashing and sanitiser stations in place PA 30/50 9 June 2020 Protestors hold placards and shout slogans during during a protest called by the Rhodes Must Fall campaign calling for the removal of the statue of British imperialist Cecil John Rhodes outside Oriel College, at the University of Oxford AFP via Getty 31/50 8 June 2020 Hermione Wilson helps to install a new artwork at Jupiter Artland, Edinburgh, created as a tribute to the NHS titled \"A Thousand Thank Yous\" originally devised by the late Allan Kaprow which consists of colourful painted messages on cardboard and has been directed remotely by London-based artist Peter Liversidge PA 32/50 7 June 2020 The Edward Colston statue has been pulled down by Black Lives Matter protesters in Bristol. Colston was a 17th century slave trader who has numerous landmarks named after him in Bristol SWNS 33/50 6 June 2020 Children pose for their family in front of discarded placards fixed on a wall in Piccadilly Gardens after a Black Lives Matter demonstrations in Manchester. The death of an African-American man, George Floyd, while in the custody of Minneapolis police has sparked protests across the United States, as well as demonstrations of solidarity in many countries around the world Getty 34/50 5 June 2020 Protesters kneel in Trafalgar Square during a Black Lives Matter demonstration in London, England. The death of an African-American man, George Floyd, while in the custody of Minneapolis police has sparked protests across the United States, as well as demonstrations of solidarity in many countries around the world Getty 35/50 4 June 2020 Protestors march from Windsor Castle in solidarity with the Black Lives Matter movement Getty 36/50 3 June 2020 People wearing face masks hold banners in Hyde Park during a Black Lives Matter protest following the death of George Floyd who died in police custody in Minneapolis Reuters 37/50 2 June 2020 Street artist Nath Murdoch touches up his anti-racism mural in Peterborough, Cambridgeshire PA 38/50 1 June 2020 Customers socially distance themselves as they queue to enter Ikea in Warrington. The store opening saw large queues of people and traffic on adjacent roads as it reopened after the lockdown. The furniture and housewares chain reopened its stores across England and Northern Ireland subject to several restrictions, keeping its restaurants closed and asking customers to shop alone Getty 39/50 31 May 2020 A man wearing a protective face mask kneels in front of police officers during a protest against the death in Minneapolis police custody of African-American man George Floyd near the U.S. Embassy, London, Britai Reuters 40/50 30 May 2020 Visitors at Grassholme Reservoir in Lunedale, Co Durham are able to cross an ancient packhorse bridge as work on the dam wall means water levels have dropped signifcantly to reveal this monument of the pas UK 41/50 29 May 2020 British Tennis player Maia Lumsden in action at Bridge of Allan Tennis Club. People can meet family and friends outdoors and play sports such as golf and tennis again as the country is moving into phase one of the Scottish Government's plan for gradually lifting lockdown PA 42/50 28 May 2020 A police frogman, searches for a weapon in Abington Lake in in Northampton Getty 43/50 27 May 2020 Prime Minister Boris Johnson appears before the Liaison Committee via Zoom from the cabinet room at 10 Downing Street, amid the coronavirus 10 Downing Street/Reuters 44/50 26 May 2020 Members of the public relax on the beach at Botany Bay in Margate Getty 45/50 25 May 2020 Dominic Cummings, senior aide to Prime Minister Boris Johnson, makes a statement inside 10 Downing Street, London, over allegations he breached coronavirus lockdown restrictions AP 46/50 24 May 2020 A demonstrator holds a sign reading 'Why are you above the law?' outside the house of Dominic Cummings in London, following allegations Cummings broke coronavirus lockdown rules by travelling across the country Reuters 47/50 23 May 2020 People take a walk near Durdle Door as cows graze in Lulworth Reuters 48/50 22 May 2020 Waves break onto a wall at Brighton beach Reuters 49/50 21 May 2020 Cafe owner Francini Osorio serves customers in a trial phase during the coronavirus lockdown. Osorio has installed an air purifier and 35 clear shower curtains, which will divide customers and tables, in the Francini Cafe De Colombia, Worcester, ready for the re-opening of his business as lockdown restrictions are eased PA 50/50 20 May 2020 People at Bournemouth beach in Dorset, as people flock to parks and beaches with lockdown measures eased. The Met Office has predicted the hottest day of the year PA\n\nRoyal watchers were alerted to the growing importance of her relationship with Harry when Markle's social media postings began to trail off during 2017.\n\nIn April last year she shut down her lifestyle website The Tig.", "images": ["https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/01/09/22/meghan-markle-brixton.jpg", "https://trc.taboola.com/1036135/log/3/unip?en=page_view"], "top_img": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/01/09/22/meghan-markle-brixton.jpg", "keywords": [], "authors": ["Staff"], "canonical_link": "https://www.independent.co.uk/news/uk/home-news/meghan-markle-instagram-facebook-twitter-delete-social-media-accounts-a8150641.html", "title": "Meghan Markle deletes her Facebook, Instagram, and Twitter accounts", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#db3739", "og": {"url": "http://www.independent.co.uk/news/uk/home-news/meghan-markle-instagram-facebook-twitter-delete-social-media-accounts-a8150641.html", "title": "Meghan Markle has suddenly deleted all her social media accounts", "description": "Palace statement says the actress is 'grateful to everyone who has followed her'", "updated_time": "2018-01-10T09:58:29+00:00", "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/01/09/22/meghan-markle-brixton.jpg", "site_name": "The Independent", "type": "article", "locale": "en_GB"}, "ia": {"markup_url": "https://www.independent.co.uk/pwamp/fbi/8150641"}, "description": "Meghan Markle has closed her social media accounts, Kensington Palace confirmed. Markle, who spent Tuesday afternoon visiting a Brixton community radio station with fiance Prince Harry, shut down her Twitter, Facebook and Instagram accounts. The palace said she was \"grateful to everyone who has followed her social media accounts over the years\" but had closed them \"as she has", "keywords": "Meghan Markle, Prince Harry, Home News, UK, News", "fb": {"pages": 13312631635, "admins": 729735830, "app_id": 235586169789578}, "article": {"tag": "Meghan Markle", "published_time": "2018-01-09T23:05:00+00:00", "modified_time": "2018-01-10T09:58:29+00:00", "section": "Home News", "author_name": "Staff and agencies", "content_type": "story", "word_count": 260, "image_count": 2, "video_count": 0, "embed_count": 0, "internal_link_count": 3, "external_link_count": 0}, "twitter": {"title": "Meghan Markle has suddenly deleted all her social media accounts", "description": "Meghan Markle has closed her social media accounts, Kensington Palace confirmed. Markle, who spent Tuesday afternoon visiting a Brixton community radio station with fiance Prince Harry, shut down her", "card": "summary_large_image", "site": "@independent"}, "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "Independent"}, "movies": [], "publish_date": 1515539100.0, "source": "https://www.independent.co.uk", "summary": ""}