{"url": "garner315.rssing.com/chan-9362901/all_p13.html", "text": "Did Jennifer Garner really say she’s “not ready to divorce” Ben Affleck? That’s the untruthful claim coming from one of this week’s tabloids. Gossip Cop can debunk the allegation with video proof.\n\nThe new cover of OK! Australia features the teaser, “Jen’s Heartbreaking Interview: ‘I’m Not Ready To Divorce Ben.'” Inside the issue, the same alleged quote appears in the headline, with the magazine claiming Garner “reveal[ed] why she hasn’t finalized their split.” The outlet is referring to Garner’s recent interview with the CBS show “Sunday Morning,” which broadcast a nine-minute profile of the actress this past Sunday.\n\nDuring the segment, she spoke candidly about the difficulty of living under tabloid scrutiny during her relationship with Affleck, and in the wake of their 2015 breakup. “There was a solid decade where there was five or six cars minimum, and easily up to 15 or 20 on the weekends, outside of my house at all times. And looking back on that, I really feel the stress of it. I could cry talking about it,” Garner said.\n\nShe went on, “What I think I learned is that scrutiny on your private life puts a pressure to make something happen. You feel a pressure to hurry up and get married because you think that will end the, ‘Are they engaged or are they not?’ And that’s true in the reverse as well. If there is any inkling of trouble, or if the tabloid decides there’s trouble, it can create trouble. But to be honest, public scrutiny — everyone says, ‘Oh, you’ve had to go through this in public.’ The public isn’t what’s hard. What’s hard is going through it.”\n\nThe outlet features some of these quotes in its article, but adds in the line, “I’m not ready to divorce Ben.” As the full CBS video of Garner’s interview shows, she never uttered such a quote, nor did she ever say anything remotely similar. This is an indisputable fabrication.\n\nThe publication also claims that, though the actress and Affleck split three years ago, she “admits that even now, it’s hard to let go.” Again, the footage shows Garner said nothing like that. The “stress” to which she referred was entirely about the paparazzi staking out her home throughout the marriage, and “looking back on that,” as she said, can make her emotional. The tabloid maintains Garner “opened up about struggling to cope with the breakdown” of the relationship when that’s clearly not the case. She also never “revealed” why they haven’t finalized the divorce.\n\nOn top of those blatant falsehoods, the magazine also quotes an “inside source,” who accuses Garner of “stalling” the divorce, and claims she’s “terrified” of losing Affleck to his girlfriend, Lindsay Shookus, amid “rumors” that the “SNL” producer “could be pregnant.” These “source” quotes, however, are plagiarized from the National Enquirer and RadarOnline, which Gossip Cop busted more than a week ago for wrongly contending Garner was “blocking” Affleck and Shookus from having a wedding. Even though those outlets were inaccurate in their allegations, OK! doesn’t bother to provide attribution and instead passes off the quotes as their own.\n\nSimilarly, the article ends this way: “It’s clear that Ben will be a tough act to follow. ‘He’s the love of my life,’ she sadly admits. ‘What am I going to do about that?'” Again the tabloid doesn’t credit the original publication, likely because these quotes are two years old and from Garner’s first post-split interview with Vanity Fair in 2016. But they’re presented here as current statements, as if they may be from Garner’s CBS profile, when they are unequivocally not.\n\nConclusion: The cover of OK! and the headline of its article feature the quote, “I’m Not Ready To Divorce Ben.” But the full video of Garner’s interview with CBS News, which is what the story is about, shows she never said that. The tabloid also doesn’t provide any context for additional quotes from Garner, presenting them as recent comments when they’re actually from an interview that was conducted a few years ago with a separate publication. In addition, the magazine plagiarizes from two fellow gossip outlets. This transparent fact-check makes it evident that the story is full of lies and misinformation.", "images": ["http://www.cardcow.com/values/images/352378184276.jpg", "http://2.bp.blogspot.com/-Mhze4oLHuco/Wu71VLLlWgI/AAAAAAAAFv8/Qvq1-o1-qGoCBY7KGuQoo1er5zLrcGyvgCLcBGAs/s640/Vanviz%2BFt%2BTommy%2BVocal%2BX%2BMirah%2B-%2BSIRI%2BRmx.jpg", "http://s3.amazonaws.com/storage5.magcloud.com/image/bdf4c380c6e35d47bca0c82a4859ddd5.jpg", "http://4.bp.blogspot.com/-ZgPw_pWfZ_A/UK6v5O8_63I/AAAAAAAAPL4/okJJn0_HP3M/s200/poster.jpg", "http://4.bp.blogspot.com/-o3EKVx-l0yY/Vo-WOnFn4XI/AAAAAAAAGws/BiM-EbscGYw/s400/beautiful%2BBabie.jpg", "http://shareae.com/uploads/posts/2013-11/1384985022_00000.jpg", "http://garner315.rssing.com/favicon.ico", "http://www.zeckhausen.com/images/wheels/bbs_18inch.jpg", "http://images.allsingaporestuff.com/styles/big_within_article/s3/field/image/jump_off_hdb_crush_damage_mercedes_benz_singapore_suicide_1.jpg?itok=HkH4iuA9", "http://1.bp.blogspot.com/-ZPTCx1qdnQY/W2E6yeDYgDI/AAAAAAAAJYE/GBAuRJ7TCmIT58KE289sfozqnKOZA97kACLcBGAs/s200/IMG_20180731_155842.jpg", "http://1.bp.blogspot.com/-XqF_0flLgpY/XVuX1hbUvbI/AAAAAAAAasQ/torDemb8n3UTqMzKARpvaM59V19aI2p5wCLcBGAs/s1600/14-15.PNG", "http://1.bp.blogspot.com/-F7Npfcm-7k8/W1F2vbHA0wI/AAAAAAAAjqU/JWDBNn5TJiwNKfPNkG7T2gHb-EniEMXmACLcBGAs/s400/IJB%2BHeli%2BMaint.25-03-04.JPG", "http://1.bp.blogspot.com/-6EfmS74DIyE/UwPeZpoxemI/AAAAAAABVf4/SZhXjpvIGrI/s1600/IMG_9644.jpg", "http://assets.atlasobscura.com/article_images/800x/17521/image.jpg", "http://docs.google.com/uc?id=0B6AQcZaiKz8PUWRJZF85X2JXZ0U&export=download", "http://1.bp.blogspot.com/-n4UguIIfGdg/WwVu6glZjqI/AAAAAAAAgCo/rw4ENvjYvgg1QtVjIq0G3gzf1QIHvQ8igCLcBGAs/s1600/sandani_fernando_4.jpg", "http://1.bp.blogspot.com/-5dzPjUUuo3o/UOq1O7FhN4I/AAAAAAAAan4/FWI6U4EA7bc/s400/IMG_0167.jpg", "http://zapt2.staticworld.net/images/article/2012/10/windows_8_-100010033-gallery.jpg", "http://www.rssing.com/inc2/img/tsbtn.png", "http://4.bp.blogspot.com/-znDmd7By6cY/WN3dNXx-5nI/AAAAAAAADVU/Uey2gUZaAKMJ1ADedI2icvRZARQKRLn7gCLcB/s1600/Wazifa%2BSurah%2BFil.jpg", "http://www.rssing.com/inc2/img/matult.jpg", "http://i.imgur.com/sCTixU1.jpg", "http://pixel.quantserve.com/pixel/p-KygWsHah2_7Qa.gif", "http://puu.sh/nM6vt/dfc9e60379.jpg"], "top_img": "http://garner315.rssing.com/favicon.ico", "keywords": [], "authors": [], "canonical_link": "", "title": "Jennifer Garner – Gossip Cop", "meta_data": {"viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": null, "source": "http://garner315.rssing.com", "summary": ""}