{"url": "www.businessinsider.com/prince-harry-meghan-markle-prince-william-kate-and-11-other-royals-all-live-in-the-same-palace-2018-5", "text": "Kensington Palace, next to London's Hyde Park, is home to a total of 15 high-ranking royals.\n\nPrince William, Kate Middleton, and their three children share a grand 20-room apartment that spans four storeys.\n\nPrince Harry and Meghan Markle live in a cottage on the palace grounds, which is where Harry proposed.\n\nPrincess Eugenie and her fiancé Jack Brooksbank recently moved in as well.\n\nSix senior royals of the same generation of Queen Elizabeth II also have rooms there.\n\nThe Queen and Prince Philip live in Buckingham Palace, around 2 miles away.\n\n\n\nWith two royal weddings on the horizon, not to mention a newborn prince, 2018 is shaping up to be a year of massive change for Britain's royal family.\n\nAdvertisement\n\nAnd the royal property that's ringing in the changes more than any other is undoubtedly the historic Kensington Palace in London, now home to 15 members of the royal family, spanning three generations.The palace, a royal residence since the 1600s, has taken on three new arrivals in the last month, making it easily the most bustling of the royal family's many grand homes.\n\nAdvertisement\n\nWithin its grounds are a host of separate properties, ranging from (relatively) humble cottages, to a grand, 20-room apartment occupied by Prince William, Kate Middleton and their young family.\n\nAs well as royal living quarters, which tend to be relatively sedately decorated, it is also home to lavish state rooms used for grand occasions, like this one:\n\nHere's a breakdown of who's who, and where they live in Kensington Palace:\n\n\n\nPrince William, Kate Middleton, Prince George, Princess Charlotte, and Prince Louis: Apartment 1A\n\nAdvertisement\n\nWilliam, Kate, and their children are not only the largest group of royals in Kensington Palace, but the closest to the throne.\n\nPerhaps unsurprisingly, they have the best rooms going. The family of five occupies Apartment 1A, a collection of 20 stately rooms with a commanding view of Hyde Park.\n\nThey moved to Kensington Palace full-time in October 2013, not long after their first child, Prince George, was born. Princess Charlotte followed in 2015, and Prince Louis in April 2018.\n\nAdvertisement\n\nThe public rarely get to see inside, but photographers were allowed to take photos of a reception room when William and Kate hosted the Obamas in 2016:\n\nWe also saw another view (or maybe even another room) where Prince George played on a rocking horse before meeting the President.\n\nAdvertisement\n\nPrince Harry and Meghan Markle: Nottingham Cottage\n\nSignificantly less grand is the two-bed cottage inhabited by Prince Harry and Meghan Markle, which will also be their marital home after they marry on May 19.\n\nThe cottage, nicknamed \"Nott Cott\" and often described as \"snug,\" has been Harry's home since 2013.\n\nAdvertisement\n\nMeghan moved in just after their engagement was made public in November 2017. Harry proposed to Meghan when they were spending an evening together at Nottingham Cottage, surprising her while they were roasting a chicken\n\nAfter announcing their engagement, they gave an interview from the cottage, sitting on its sofa, which is one of the only times the public has seen inside:\n\nPrincess Eugenie and Jack Brooksbank: Ivy Cottage\n\nAdvertisement\n\nThe newest royals at Kensington Palace are Princess Eugenie, who is William and Harry's cousin, and her fiancé Jack Brooksbank, a London socialite.\n\nAccording to The Sun, the couple moved in to a cottage right next to Harry and Meghan's around the same time Kate was in hospital delivering Prince Louis.\n\nAdvertisement\n\nThe couple announced their engagement in January, a few weeks after getting engaged while vacationing in Nicaragua.\n\nThey are getting married at Windsor Castle in the same church as Harry and Meghan this October, but the occasion is likely to attract much less publicity.\n\nThe Duke and Duchess of Gloucester: Apartment 1\n\nThe Duke of Gloucester, one of Queen Elizabeth II's cousins, lives in Apartment 1 with the Duchess of Gloucester, his wife.\n\nAdvertisement\n\nLike William and Kate's home at 1A, the dwelling is a large complex of rooms in the main palace building. The two used to be one enormous set of rooms until they were divided in the 1950s.\n\nThe complex has 21 rooms, slightly pipping the size of William and Kate's, but few details are available other than its overall size.\n\nPrince and Princess Michael of Kent: Apartment 10\n\nAdvertisement\n\nPrince Michael of Kent, another of the Queen's cousins but from a more junior line, lives in the main palace building with his wife.\n\nShe is known as Princess Michael in the old-fashioned tradition by which the wives of princes take their husband's name.\n\nAdvertisement\n\nThis same rule means that Kate can technically be referred to as Princess William of Cambridge, but the name is not widely used.\n\nTheir apartment, number 10, consists of five bedrooms and five receptions rooms. They used to have use of the property rent-free, but since 2008 they have been paying a reported £10,000 ($13,600) per month in rent.\n\nThe Duke and Duchess of Kent: Wren House\n\nThe Duke of Kent, Prince Michael's older brother, also lives in the Kensington Palace grounds with his wife, the Duchess.\n\nAdvertisement\n\nTheir home, Wren House, is named after the famous British architect Christopher Wren, who built St Paul's Cathedral and a slew of properties for the royal household.\n\nFew details about their home have ever been made public. It is physically between Ivy and Nottingham cottages, and appears to be of a similar size.\n\nWhat about the Queen?\n\nAdvertisement\n\nElizabeth II lives at Buckingham Palace with her husband, Prince Philip. It's around 2 miles from Kensington Palace, across Hyde Park and Green Park.\n\nIt's not quite as cosy as living on the same property - but if Her Majesty ever wants to drop in on her cousins, grandchildren or great-grandchildren, they aren't far away.", "images": ["https://static-ssl.businessinsider.com/image/5aef9d9019ee8628008b494a-2000/gettyimages-539171904.jpg", "https://static-ssl.businessinsider.com/image/5aef9c8b19ee8622008b494d-2130/gettyimages-908732602master.jpg", "https://static-ssl.businessinsider.com/image/5aefa0b419ee862a008b49c2-2400/gettyimages-169899495.jpg", "https://static-ssl.businessinsider.com/image/5aefa51619ee865f008b48cb-2000/gettyimages-135830801.jpg", "https://static-ssl.businessinsider.com/image/5aef971919ee8619008b4942-1159/kensington palace to buckingham palace.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=9900186&cv=2.0&cj=1", "https://static-ssl.businessinsider.com/image/5aef9a1c19ee865a008b4938-2200/gettyimages-523272590.jpg", "http://www.businessinsider.com/thumb/msid-60085318,width-65,height-47/default-thumb.jpg", "https://www.businessinsider.in/photo/64062642/prince-harry-meghan-markle-prince-william-kate-and-11-other-royals-all-live-in-the-same-palace-heres-a-breakdown-of-their-lavish-quarters.jpg", "https://static-ssl.businessinsider.com/image/5aef9c4619ee86000c8b4f73-1920/harry meghan bbc interview nottingham cottage.jpg", "https://static-ssl.businessinsider.com/image/5aefa4de19ee8627008b496b-2000/gettyimages-880124544.jpg", "https://static-ssl.businessinsider.com/image/5aeb7e8f19ee8624008b4815-2400/royal-family-kensington-palace-map.png", "https://static-ssl.businessinsider.com/image/5aef9fa019ee861c008b4ecf-2000/gettyimages-539172974.jpg", "http://www.businessinsider.com/photo/50740876/downarrow.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=13194393&cv=2.0&cj=1", "http://www.businessinsider.com/thumb/msid-60085318,width-100,height-70/default-thumb.jpg", "https://static-ssl.businessinsider.com/image/5aef9a1c19ee8622008b48f3-2200/gettyimages-523284574.jpg"], "top_img": "https://www.businessinsider.in/photo/64062642/prince-harry-meghan-markle-prince-william-kate-and-11-other-royals-all-live-in-the-same-palace-heres-a-breakdown-of-their-lavish-quarters.jpg", "keywords": [], "authors": [], "canonical_link": "http://www.businessinsider.com/prince-harry-meghan-markle-prince-william-kate-and-11-other-royals-all-live-in-the-same-palace-2018-5", "title": "Prince Harry, Meghan Markle, Prince William, Kate, and 11 other royals all live in the same palace - here's a breakdown of their lavish quarters", "meta_data": {"description": "Samantha Lee/Business InsiderThe many royals of Kensington Palace, and where they live. The arrows points towards Buckingham Palace, where Queen Elizabeth", "keywords": "thewire,thelife", "twitter": {"card": "summary_large_image", "site": "@BiIndia", "url": "https://www.businessinsider.in/prince-harry-meghan-markle-prince-william-kate-and-11-other-royals-all-live-in-the-same-palace-heres-a-breakdown-of-their-lavish-quarters/articleshow/64062642.cms", "title": "Prince Harry, Meghan Markle, Prince William, Kate, and 11 other royals all live in the same palace - here's a breakdown of their lavish quarters", "description": "Samantha Lee/Business InsiderThe many royals of Kensington Palace, and where they live. The arrows points towards Buckingham Palace, where Queen Elizabeth", "image": "https://www.businessinsider.in/photo/64062642/prince-harry-meghan-markle-prince-william-kate-and-11-other-royals-all-live-in-the-same-palace-heres-a-breakdown-of-their-lavish-quarters.jpg"}, "news_keywords": "thewire,thelife", "og": {"site_name": "Business Insider", "type": "article", "title": "Prince Harry, Meghan Markle, Prince William, Kate, and 11 other royals all live in the same palace - here's a breakdown of their lavish quarters", "url": "https://www.businessinsider.in/prince-harry-meghan-markle-prince-william-kate-and-11-other-royals-all-live-in-the-same-palace-heres-a-breakdown-of-their-lavish-quarters/articleshow/64062642.cms", "image": "https://www.businessinsider.in/photo/64062642/prince-harry-meghan-markle-prince-william-kate-and-11-other-royals-all-live-in-the-same-palace-heres-a-breakdown-of-their-lavish-quarters.jpg"}, "fb": {"app_id": 645465345465774, "admins": 556964827}, "website": "https://www.businessinsider.in", "robots": "NOODP", "google-site-verification": "NpZv5Qfl0TuFiebbwMualP_h2a3QtmQGFjE9hhw9um8", "HandheldFriendly": "True", "MobileOptimized": 320, "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0, maximum-scale=1.0, user-scalable=no"}, "movies": [], "publish_date": null, "source": "http://www.businessinsider.com", "summary": ""}