{"url": "dlisted.com/tag/justin_theroux/page/2/", "text": "I’m still getting over the PTSD of scanning through Instagram yesterday and see how half of Hollywood was at Jennifer Aniston ’s 50 th birthday celebration. Not since Taylor Swift ’s squad era has there been such a case of “How da FUQ are these people all friends?” Jen even made me shed a tear of petty pride after she went from “ debating ” inviting her ex-husband, Brad Pitt , to her birthday to actually having him there – all while he is in the middle of a nasty-ass divorce from Angelina Jolie ! Don’t fret, Angelina, maybe y’all can ex-boo thang swap because Justin Theroux wasn’t at Jen’s party…even though he wished her a happy birthday yesterday.\n\nEven though the media loves a good ol’ Poor, Sad Jen narrative, Jennifer Aniston is saying not to cry for her again . Jennifer Aniston doesn’t care if you think she’s struck out 0-2 on her marriages, because that’s not the way she sees it.\n\nJustin Theroux has been linked to so many people since his split from Jennifer Aniston. If there was an unofficial Justin Theroux Rebound Bingo game, someone would have at least four corners and a line by now. Most recently though, he declined to comment on whether he was with Emma Stone or Selena Gomez or Petra Collins by telling the New York Times: “Is this the part where I coyly raise an eyebrow and not answer the question?”\n\nHe might not be saying who he’s coyly raising any of his body parts around, but we can once again look at the clues and wildly speculate. People points out that 47-year-old Justin was spotted yesterday in Paris, France with Spider-Man: Homecoming actress, 28-year-old Laura Harrier.\n\nJustin Theroux Steps Out with Spider-Man Actress Laura Harrier in Paris https://t.co/EjUMA9idvc — People (@people) October 2, 2018\n\nBefore you go thinking: “Come on, plenty of guys in their late-40s wander aimlessly around the romantic streets of Paris in Autumn with their late-20s female friends,” this isn’t new. Justin and Laura were rumored to be casually hanging out in France earlier this summer. At the time, Laura denied anything was going on by telling Elle: “We all work together for [Louis Vuitton] and have become friends.” Reps for Justin and Laura declined People’s request for a comment, so we don’t know for sure.\n\nBut if they are dating, then I wish them the best, especially Laura. Normally an almost 20-year age difference would cause the older person to struggle to relate to the younger person. But Justin prides himself on being that hipster that knows everything before everyone else, so this might be the first time the younger person feels out of touch. “Oh my god, you don’t know what reverse-pecan water is?? That’s so cute.”\n\nPic: Wenn.com", "images": ["https://26uepavkh8yx35d834o3oay1-wpengine.netdna-ssl.com/wp-content/themes/dlisted_44/img/dlisted.png", "https://26uepavkh8yx35d834o3oay1-wpengine.netdna-ssl.com/wp-content/uploads/2018/06/wenn33864561.jpg", "https://26uepavkh8yx35d834o3oay1-wpengine.netdna-ssl.com/wp-content/uploads/2018/09/wenn32046586.jpg", "http://pixel.quantserve.com/pixel/p-ejSXfyZMwcbnr.gif", "https://26uepavkh8yx35d834o3oay1-wpengine.netdna-ssl.com/wp-content/uploads/2018/08/anistoninstyle2018.jpg", "https://26uepavkh8yx35d834o3oay1-wpengine.netdna-ssl.com/wp-content/themes/dlisted_44/img/dlistedbw.png", "http://dlisted.com/favicon.ico?v=1", "https://26uepavkh8yx35d834o3oay1-wpengine.netdna-ssl.com/wp-content/uploads/2018/10/wenn35344415.jpg", "https://26uepavkh8yx35d834o3oay1-wpengine.netdna-ssl.com/wp-content/uploads/2019/02/wenn32046578.jpg", "https://26uepavkh8yx35d834o3oay1-wpengine.netdna-ssl.com/wp-content/uploads/2018/12/ElleCoverAniston-1.jpg"], "top_img": "http://dlisted.com/favicon.ico?v=1", "keywords": [], "authors": ["J Harvey", "Michael K"], "canonical_link": "https://dlisted.com/tag/justin_theroux/", "title": "Be Very Afraid", "meta_data": {"google-site-verification": "wtgaXQuvduR_ynbFXYU1BBBEM-yaIh4zid2J5aq9r5Q", "og": {"locale": "en_US", "site_name": "Dlisted", "title": "Justin Theroux", "url": "https://dlisted.com/tag/justin_theroux/", "type": "article", "description": "Justin Theroux"}, "fb": {"app_id": 662132140485214}, "description": "Dlisted | Be Very Afraid | Page 2", "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": null, "source": "http://dlisted.com", "summary": ""}