{"url": "www.yahoo.com/lifestyle/vanka-trump-slammed-fishing-royal-wedding-invite-194556343.html", "text": "Refinery29\n\nIn the last week alone, more than 1.3 million people filed first-time claims for unemployment insurance, according to the Labor Department. Since the pandemic started and created an overwhelming job crisis in the U.S., more than 50 million people total are reportedly unemployed. The numbers are staggering, and many have demanded further intervention from the government to help support people who are out of work and struggling to support themselves. In response, The White House recently launched a campaign to motivate people to find jobs — ones that currently don’t even exist during the beginning of one of the worst depressions this country may ever see. The Find Something New campaign was launched today by the White House’s American Workforce Policy Advisory Board, which is co-chaired by President Donald Trump’s daughter and White House adviser, Ivanka Trump, along with Commerce Secretary Wilbur Ross. With Ivanka at the helm of the Trump Administration’s reaction, the ad campaign seeks to encourage people who are unemployed or unhappy with their careers to go out into the world and just “find something new.” In several short ads presented by the White House, Americans facing career hardships are depicted sharing their employment woes. A fitness instructor explains how she pivoted and took an apprenticeship program and became a welder when her gym closed. A man who lost his job twice in one year explains that he took online courses and now works as a tech consultant.The campaign is in collaboration with Ad Council, IBM, Apple, and Business Roundtable. A website for the project offers links to job training, information on different kinds of educational programs, and others aim to help people figure out how to shift course in their careers to navigate a changing economy and job landscape. Those looking for new opportunities can find information from the Bureau of Labor Statistics (BLS) Occupational Outlook Handbook that shows which job fields are projected to experience growth as well. “There has never been a more critical time for Americans of all ages and backgrounds to be aware of the multiple pathways to career success and gain the vocational training and skills they need to fill jobs in a changing economy,” Ivanka Trump said in a tweet announcing the campaign.While the campaign is meant to spread awareness of the multiple pathways to employment other than college, the slogan “find something new” is not resonating well with many people, who feel the campaign is largely insensitive. Ivanka, who has already come under fire in recent months for her hypocritcal response to the pandemic, is once again feeling the ire. On Twitter, FindSomethingNew has started trending, mostly full of jokes taking aim at the First Daughter for suggesting that a response to mass unemployment and sudden career halting is to just “find something new!”Pollster Matt McDermott tweeted, “‘Find something new’ the White House says to unemployed Americans in the worst job market since the depression. Just a stunningly tone deaf campaign.” Keith Boykin, a former White House Aide, tweeted, “Ivanka Trump has a brilliant idea for the millions of Americans who are unemployed because of her father’s gross negligence and incompetence. Her solution: Find Something New!” Ultimately, many seem to think that the campaign illustrates how out of touch the Trump family is with people who don’t come from wealth and nepotism, and that telling millions of unemployed people to simply “find something new” — career or otherwise — is shifting the responsibility from the government to people. Now, without a second stimulus package in sight and many businesses shutting down once again leaving room for further mass unemployment, Americans are left to fend for themselves when it comes to rebuilding a career. It looks like this isn’t quite the solution that 50 million jobless Americans were looking for. Like what you see? How about some more R29 goodness, right here?Why Ivanka Brought Her Purse To A Tear-GassingMelania Trump Wore A Mask In Public — FinallyCan Trump Really Threaten To Defund Schools?", "images": ["https://s.yimg.com/rz/p/yahoo_life_en-US_h_p_lifev2.png", "https://s.yimg.com/rz/p/yahoo_life_en-US_h_w_lifev2.png", "https://s.yimg.com/uu/api/res/1.2/7M7fb4U9qrOSHOrtEOjrmg--~B/aD05NjI7dz05NjA7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en/homerun/feed_manager_auto_publish_494/1c444f2bb14d147e49ed6ffb1fb4fc24", "https://s.yimg.com/ny/api/res/1.2/g6NFVAggnANnqZ7scibL2w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTgwO2g9ODA-/https://s.yimg.com/uu/api/res/1.2/_ES838o1.InCqnS75eSDNg--~B/YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/creatr-images/GLB/2018-08-17/10d65350-a1ee-11e8-8d0e-b1a33737d01e_Allison-Yee.jpg", "https://s.yimg.com/cv/apiv2/default/20190501/placeholder.gif", "https://s.yimg.com/ny/api/res/1.2/B2ZDTh1uvSGpFf2R_TCWzA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTk2Mg--/https://s.yimg.com/uu/api/res/1.2/7M7fb4U9qrOSHOrtEOjrmg--~B/aD05NjI7dz05NjA7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en/homerun/feed_manager_auto_publish_494/1c444f2bb14d147e49ed6ffb1fb4fc24", "https://s.yimg.com/ny/api/res/1.2/p7mhKIwKAg.NBKGJyIB9yg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTE2NjtoPTQ4/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2020-04/aa5a87b0-7e4e-11ea-bdfd-b9950c4c15e2"], "top_img": "https://s.yimg.com/uu/api/res/1.2/7M7fb4U9qrOSHOrtEOjrmg--~B/aD05NjI7dz05NjA7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en/homerun/feed_manager_auto_publish_494/1c444f2bb14d147e49ed6ffb1fb4fc24", "keywords": [], "authors": [], "canonical_link": "https://www.yahoo.com/lifestyle/vanka-trump-slammed-fishing-royal-wedding-invite-194556343.html", "title": "Ivanka Trump slammed for ‘fishing’ for royal wedding invite", "meta_data": {"oath": {"guce": {"consent-host": "guce.yahoo.com"}}, "news_keywords": "Ivanka Trump, Prince Harry", "apple-itunes-app": "app-id=304158842,app-argument=yahoo://article/view?uuid=ac98421d-9fbd-31b0-9623-0bbd60211bfd&src=web", "twitter": {"title": "Ivanka Trump slammed for ‘fishing’ for royal wedding invite", "description": "“Wishing Meghan and Prince Harry a lifetime of love, laughter and happiness together,” Ivanka tweeted.", "site": "@Yahoo", "dnt": "on", "image": {"identifier": "https://s.yimg.com/uu/api/res/1.2/7M7fb4U9qrOSHOrtEOjrmg--~B/aD05NjI7dz05NjA7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en/homerun/feed_manager_auto_publish_494/1c444f2bb14d147e49ed6ffb1fb4fc24", "src": "https://s.yimg.com/uu/api/res/1.2/7M7fb4U9qrOSHOrtEOjrmg--~B/aD05NjI7dz05NjA7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en/homerun/feed_manager_auto_publish_494/1c444f2bb14d147e49ed6ffb1fb4fc24"}, "player": {"identifier": "https://www.yahoo.com/style-videos/ivanka-trump-slammed-fishing-royal-225033882.html?format=embed&region=us&lang=en-US&site=lifestyle&player_autoplay=1&expName=y20", "width": 500, "height": 281}, "card": "player"}, "og": {"title": "Ivanka Trump slammed for ‘fishing’ for royal wedding invite", "url": "https://www.yahoo.com/lifestyle/vanka-trump-slammed-fishing-royal-wedding-invite-194556343.html", "description": "“Wishing Meghan and Prince Harry a lifetime of love, laughter and happiness together,” Ivanka tweeted.", "type": "article", "image": {"identifier": "https://s.yimg.com/uu/api/res/1.2/7M7fb4U9qrOSHOrtEOjrmg--~B/aD05NjI7dz05NjA7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en/homerun/feed_manager_auto_publish_494/1c444f2bb14d147e49ed6ffb1fb4fc24", "width": 960, "height": 962}}, "al": {"android": {"url": "yahoo://article/view?uuid=ac98421d-9fbd-31b0-9623-0bbd60211bfd&src=web", "app_name": "Yahoo", "package": "com.yahoo.mobile.client.android.yahoo"}, "ios": {"url": "yahoo://article/view?uuid=ac98421d-9fbd-31b0-9623-0bbd60211bfd&src=web", "app_name": "Yahoo", "app_store_id": 304158842}}, "description": "“Wishing Meghan and Prince Harry a lifetime of love, laughter and happiness together,” Ivanka tweeted."}, "movies": [], "publish_date": null, "source": "http://www.yahoo.com", "summary": ""}