{"url": "http://www.wopular.com/dj-khaled-crashes-jamie-foxxs-2017-american-music-awards-interview", "text": "Weinstein Plaintiff Caitlin Dulany on Collapse of Settlement: ‘I Was Stunned’\n\nCaitlin Dulany is one of the nine named plaintiffs in the class action lawsuit against Harvey Weinstein. On Tuesday morning, she was listening to the court hearing, expecting that the judge would give his preliminary blessing to a settlement that would send $18.9 million to Weinstein’s accusers in the class action case.\n\nChina’s Aim Media Sells ‘Spring Tide’s’ North American Rights to China Lion (EXCLUSIVE)\n\nChinese production firm Aim Media has sold the North American rights of director Yang Lina’s “Spring Tide” to distributor China Lion. Smart Cinema, the new venture by former Wanda executive Jack Gao, has also bought the rights to screen the film on its platform in South Korea. Yang is an independent documentary maker turned feature […]\n\n‘Survivor’ Pulled From CBS Fall Schedule as Coronavirus Continues to Stymie Production\n\nCBS is no longer planning to air “Survivor” Season 41 this fall. Variety has learned that CBS has pulled the long-running reality competition series from its fall 2020-2021 lineup. Production on the season, which will take place in Fiji, was delayed back in March due to the coronavirus pandemic. According to an individual with knowledge […]\n\nTV Ratings: ‘Snowpiercer’ Finale Almost Matches Strong Premiere\n\nThe season 1 finale of “Snowpiercer” ploughed its way to strong numbers on Sunday night. A total of 3.2 million viewers tuned in for the two-hour finale, which almost matches the 3.3 million who watched the premiere three months ago. In the key demographic of adults aged 18-49, the finale delivered 442,000 viewers, which represents […]\n\nViola Davis Says She ‘Betrayed’ Herself With Role in ‘The Help’\n\nViola Davis has commented before on her regret for playing a part in 2011’s “The Help.” But in a new interview with Vanity Fair, and within the context of the recent Black Lives Matter protests, she took the time to further elaborate on how the film’s storyline caters primarily to its white viewers.", "images": ["http://www.wopular.com/sites/all/themes/garland/wopular/images/social_icon_gplus.gif", "http://www.wopular.com/files/wopular_favicon.ico", "http://www.wopular.com/sites/all/themes/garland/wopular/images/share_email_button.gif", "http://www.wopular.com/sites/all/themes/garland/wopular/images/social_icon_rss.gif", "http://www.wopular.com/files/header_logo.png", "http://www.wopular.com/sites/all/themes/garland/wopular/images/social_icon_twitter.gif", "http://www.wopular.com/sites/all/themes/garland/wopular/images/clear.gif", "http://www.wopular.com/sites/all/themes/garland/wopular/images/mwb_sidebar_graphic.jpg", "http://www.wopular.com/sites/all/themes/garland/wopular/images/social_icon_facebook.gif"], "top_img": "http://www.wopular.com/files/wopular_favicon.ico", "keywords": [], "authors": [], "canonical_link": "", "title": "Dj Khaled Crashes Jamie Foxx's 2017 American Music Awards Interview", "meta_data": {"description": "Major key alert! Viewers got a double dose of star power Sunday night during E!'s red carpet coverage of the 2017 American Music Awards when DJ Khaled made an unexpected...", "keywords": "news,headlines,newspapers,news site,news website,aggregated news", "robots": "index,follow", "DC.title": "DJ Khaled Crashes Jamie Foxx's 2017 American Music Awards Interview", "og": {"title": "DJ Khaled Crashes Jamie Foxx's 2017 American Music Awards Interview", "site_name": "Wopular"}, "fb": {"admins": 663016824, "app_id": 214168345322701}}, "movies": [], "publish_date": null, "source": "http://www.wopular.com", "summary": ""}