{"url": "https://www.vibe.com/2018/02/rihanna-birthday-toni-braxton-paris-hilton", "text": "In the business of music, there's no name with as much resonance as Motown. Former Uptown Entertainment president Andre Harrell—the man responsible for Jodeci, Mary J. Blige, and Heavy D—is taking over the legendary label and promising to bring the noise. But can he fight through the nostalgia and lead Motown into the 21st century? By Anthony DeCurtis. Photographs by Dana Lixenberg\n\n\"You know how Jeffrey Katzenberg became Disney? That's what I want to do. Like, how you felt Jeffrey had a passion about Disney—his Mickey Mouse watches, Disney sweatshirt, Disney tie. That's what I'm talking about. I will be at the Motown Cafe. I'll make Motown ties, watch­es, sweatshirts. I intend to make Motown the black Disney,\" Andre Harrell says with a smile. \"You might as well start calling me Walt.\"\n\nHarrell, 35, is obviously a man with a plan. Good thing, too. He's stepping into one of the most vis­ible jobs in the entertainment industry: president and CEO of Motown Records. \"It's always been a dream of mine to head up Motown,\" he says.\n\nYet the lofty position confronts Harrell with a critical challenge. Motown has fallen far from what it once was. Aside from the monumental Boyz II Men, Motown has increasingly become a sound­track for nostalgia, much more redolent of the past than the present. It's so hard to say good-bye to yesterday, indeed. Harrell, a product of the hip hop generation, knows his job is to introduce Mo­town—music, television, film, video, animation, and new media—to tomorrow.\n\nA Bronx native, he got his start in the early '8os as half of the rap duo Dr. Jekyll and Mr. Hyde. (He was Dr. Jekyll.) After moving over to the business side of the business, he hooked up with rap mogul Russell Simmons and soon landed a top spot at Simmons's company, Rush Communications, where he worked with the likes of Run-D.M.C., L.L. Cool J, and Whodini.\n\nHarrell stepped out on his own in 1986, when he launched his own label, Uptown Entertain­ment, as part of a joint venture with MCA. At Uptown, Harrell defined a contemporary R&B sound for the hip hop age, bringing the world Guy, Heavy D, Jodeci, Mary J. Blige, Al B. Sure!, Father MC, and most recently, Soul for Real (with whom he had his first No. 1 pop hit, \"Candy Rain\"). He produced the 1991 film Strictly Business, and he coproduces the hit Fox series New York Undercover.\n\nSuccessful as the artists on his label proved to be, Harrell has felt constrained in his efforts to make them pop superstars, both by his arrange­ment with Uptown's parent company, MCA, and by the troubling racial politics of the music busi­ness in general. Moving to Motown, which is now based in Los Angeles and owned by PolyGram, presents Harrell with the opportunity to put at least some of these issues behind him. At Motown, Harrell says, he'll have more people, more prerogative, more punch.\n\nSeated on a couch in the living room of his Upper West Side New York apartment, dressed simply in a black shirt and white slacks, Harrell focused squarely through his blue shades on what must be done. A framed photo of a serious-looking Harrell arm-in-arm with Mickey Mouse sat on an end table.\n\nClearly a man who enjoys control, Harrell was soft-spoken and intent. He didn't want to be mis­understood. \"Am I correct?\" he would ask. \"Do you follow me?\" He leaned forward, and his voice rose with passion as he discussed his frustrations with MCA. Otherwise, he slipped back into the pil­lows of his sofa and spoke as if he was envisioning his future life in a dream.\n\nHarrell knows he has as much on the line as Motown, if not more. All eyes will be on him. It's one thing to say you would've done something if only you'd gotten the chance. It's quite another to get the chance and have to do it.\n\n\"Every record has gotta be right,\" he said. \"I'm trying to sign stars. I'm not gonna have wack-juice on me. Never did, never will.\"\n\nWhat has Motown meant to you over the years? When was the first time you knew what it was?\n\nThe first true Motown experience I had was when the Jackson 5 were on the Ed Sullivan Show. I think it might've been, like, 1969, '70. They sang \"Stand!\" and \"I Want You Back.\" I had never seen a black teenager on television—it was incredible. After that, I realized who the Motown artists were. My parents listened to them: the Supremes, Marvin Gaye, Diana Ross, the Four Tops, the Temptations.\n\nWhat did the company represent for you?\n\nMotown has always been the epitome of black excellence and artistry. Stevie sang about love in the most sensitive way, as well as telling about the plight of his people. Marvin sang about the plight of his people and his internal fight, but he sang about love in a very sexy way. They were major influences.\n\nSpeaking of Stevie Wonder, he made a strong album last year and nothing happened with it. Can Motown sell a Stevie Wonder record in this day and age?\n\nThe Four Tops, the Temps, and, especially, Stevie Wonder and Diana Ross—these are national trea­sures. You have to treat them like events. Stevie Wonder, he's someone I would do an Unplugged with. Or a couple of years ago, it was Stevie's 3oth anniversary in show business. You could have got­ten Stevie Wonder a television special. We could have had artists pay tribute to him—pop artists, rock artists, R&B artists, rap artists, everybody could have participated. And there's probably no other female, black or white, who's as fabulous as Diana Ross, who epitomizes the glamour and excitement of a star diva.\n\nWhat about new directions? What makes Motown happen in the '9os?\n\nMotown has to become the lifestyle label for the times that the active record-buying audience—the audience who's 15 to 3o—is living in. One of the ways you do this is by putting out records that are in the groove that that audience is living in. Like if Mary J. Blige was a Motown artist, Motown would have some of her imaging on it. It's that young, hip hop—soul, Generation X energy. Same thing if Jodeci was on the label. Back in the day, Motown talked to everybody in the ghetto—and it talked to the rest of the world too.\n\n\"WHEN YOU THINK OF MOTOWN NOW, YOU'RE GONNA THINK OF ANDRE HARRELL. I'M NOT GONNA WORK FOR MOTOWN, I'M GONNA BE MOTOWN.\"\n\nThat sounds like the philosophy you espoused at Uptown.\n\nThe thing that [Motown founder] Berry Gordy led the way with is the idea that the label head becomes the image of the label. Myself, I allowed whatever celebri­ty occurred in my career to happen through the artists. I was so consistent with the kinds of artists who were on my label, after a while, it was, like, \"Who's behind all this?\" I was behind it.\n\nGoing into Motown, my plan is this: When you think of Motown now, you're gonna think of Andre Harrell. I'm not gonna work for Motown, I'm gonna be Motown—in the way I dress, the records I put out, the causes I choose to get involved in, the artists from the past, the artists who are there now, and the artists in the future. Like I lived Uptown Records, I'm gonna live Motown Records.\n\nBut you, Russell Simmons, Sean .\"Puffy\" Combs—and Berry Gordy before you—are entrepreneurs. You're identified with the companies you founded. With this, you're stepping into something—\n\n—that's already existing. I'm gonna be Motown for this generation of young-adult record buyers. Motown was the blueprint. Berry Gordy was the blueprint for what I became.\n\nWere you conflicted about leaving Uptown?\n\nI had tremendous conflict. It was like I was walking away from my works of art. There will never be another Mary J. Blige—it's rare to find a queen. There will nev­er be another Jodeci. There'll never be another Heavy D. But I have to go, because Motown gives me the power I need to go to the next level. I have to make African-American superstars. At Uptown, I was able to make black icons, but they were icons only to black people.\n\n[I was] trying to grow Uptown, to have indepen­dence, to be able to say, \"This act is getting ready to be a worldwide star, and I'm gonna take all my resources, and we're gonna march to this one beat.\" I was trying to do that for nine years. Between me and the corpora­tion, I could never get it to happen.\n\nIn terms of support from MCA?\n\nI think MCA, after a period, wanted some of these things to happen. For whatever reasons, though, the execution between the two sides never worked. The biggest record I ever had was Jodeci's [1991] Forever My Lady—3 million.\n\nWhen [Arista president] Clive Davis got in the game, I felt myself shrinking. Once he got in business with LaFace [L.A. Reid and Kenneth \"Babyface\" Edmonds] and [Dallas Austin's] Rowdy Records and Puffy [Bad Boy Entertainment], Davis's commitment and his exe­cution were taking those artists where I wanted my artists to go. I wanted Mary J. Blige to sell the 7 million that Toni Braxton did.\n\nJodeci came to me because I had Al B. Sure! So they figured, \"He knows how to do this. We wanna be down with him.\" They drove 13 hours, sat in my lobby for eight hours just to meet me. Now, I feel like, with Arista being involved with LaFace and the other labels, they sold 7 million Toni Braxtons. They sold 6 million TLCs. I'm, like, if I can't sell these kinds of records, I'm gonna slowly shrink. I was catching heat from my artists, who wanted that kind of stature. I would bring that frustra­tion to MCA, and we couldn't seem to come to terms.\n\nWas the idea, \"Well, Andre's doing fine. He's doing a cou­ple of million here, a couple of million there. He's covered. Were gonna invest somewhere else\"?\n\nI felt like a figurehead. I had all this energy around me—like, I was the Man. I was the founder and chairman of Uptown Records, a major, culturally influen­tial entertainment company for African-Americans in the '9os. But I didn't feel like the Man, because I could­n't put my finger on the button that would really make it happen. I don't want to be in that position anymore. I need to have more control. I need to be responsible for the big picture. And being at Motown positions me to create a truly black pop company. I got a film divi­sion, a television division. I got green-light power for small movies. I don't have to ask anybody.\n\nWhat are your plans with Gordy?\n\nWe're gonna do a series of commercials—print and television. He endorses me. We spoke yesterday for about an hour, and he said, \"Any advice I can give you about where we go from here, feel free to call me.\" We're gonna spend time together and talk about his history with the elder stars. I feel as if I've had a tremendous amount of experience working with stars' drama and ego, but we're talking a whole 'nother level of stars. I've never built a superstar. There're superstars at this house.\n\nHow do you build superstars?\n\nIf black stars are gonna have a shot at becoming pop stars, it's gonna be because the chairman of the company is committed to them—and because their music is his personal taste. That's what I'm bringing to black music, to black musical stars. Not just their art form but their plight as African-American men and women.\n\nWhat you're describing is a role that black executives play, but aren't they often frustrated in their attempts to rise at most record companies?\n\nI can't talk about it enough, how few black execu­tives get to control their playing field. Black music is becoming the music of the popular culture. Because of that, companies are repositioning their priorities and trying to get in the game. But as black music becomes more important, there should be more black presidents and black chairmen. As soon as the black executive's artist reaches platinum, suddenly the artist and man­ager have to deal with the president of the corporation, because he controls the priorities at pop radio. The black executive becomes obsolete. As his music gets bigger his power diminishes. He's more or less told, \"Go find the next act and establish it.\"\n\nIt's an emphasis on the creative—\n\n—as opposed to the business. That's why young black executives don't get to become the old chairmen—the wise men who've seen it and done it. They get to stay hot black executives so long as their instincts are hot. But this is a lifestyle business—only a few of us, black or white, are going to be cool enough to have great in­stincts our whole career.\n\nThe black executive is not given the opportunity to become the business and the music. Why not? Why shouldn't he be the one that everybody reports to? When you get an act that sells 5 million—at a major compa­ny—the black executive's out of the room. But when there's some sort of problem, the major label looks at the black executive: \"Why can't you handle this act?\" When the artist hires a violent manager and the violent manager is coming up to the record company, the label's, like, \"How did it get to this?\" How? Because they [the white executives] couldn't see it coming. Because they re not sensitive to his issues. By then the relation­ship between the record company and the artist is dys­functional. And then the black executive gets blamed and fired. But they created the monster.\n\nWhen I had the artist, I talked to his mother, his girl­friend, his babies' mother with the two children, dealt with his drug counselor, and whatever other dysfunc­tional Generation X problems he has. He'd call me late at night.\n\nBut he feels like they're just businesspeople. And they don't understand. And they might be racist. He's comin' with all that energy. Even if they like him as a person, he still has goo years of issues he has to get over to accept them. And they have a lot of work to do to gain his trust and respect.\n\nSo what are your immediate plans?\n\nI will be moving to Beverly Hills. I'll have a house out there for a 12-to-18-month period, and I'll be bicoastal between the New York and L.A. offices. Then I'm moving the company to New York. I'm going to have a satellite office in Atlanta—A&R-oriented. I'm going to build a recording studio in New York, Motown Studios.\n\nAny new musical directions?\n\nThe sound I'm going for now is soul. I'm looking for voices that sound like 400 years of slavery and then some. I'm looking for that inspirational, take-us-out­-of-our-plight, Aretha Franklin, Bill Withers, Al Green voice. I'm looking to build those kinds of stars now.\n\nWhat about the younger acts on Motown? Have you met with Boyz II Men?\n\nNo. Those meetings will come after I execute the deal. Boyz II Men are the biggest group I've ever seen. I don't know what I'm bringing to the party except to keep them from goin' crazy from the level of success they've had. They probably need a break, a little time out to lead their personal lives. Outside of that, that for­mula is working. Queen Latifah, I'd like to bring her record sales up to match her celebrity. Zhané I'd like to give a little bit more image. I'm gonna bring Johnny Gill back—he had a fabulous first album. And I'm excit­ed about working with Michael Bivins. He's tremen­dously talented, and if he and I get together, we can real­ly do some important things.\n\nAre you apprehensive?\n\nI got a lot of work to do. But no problems. Making hits is not a problem. I'll be making some noise real quick. And I ain't gonna stop makin' noise until I'm done.\n\n-\n\nThis article originally appeared in the Dec. 1995 - Jan. 1996 issue of VIBE Magazine | Written by Anthony DeCurtis | Header Photography by Dana Lixenberg", "images": ["https://static.vibe.com/files/2020/07/GettyImages-166190372-1594675872-300x169.jpg", "https://static.vibe.com/files/2020/05/Andre-Harrell-vibe-magazine-feature-dec-jan-1996-1-1590098193-650x366.jpg", "https://static.vibe.com/files/2020/05/dj-khaled-instagram-live-twerker-remix-1588606755-e1588607726962-650x366.jpg", "https://static.vibe.com/files/2020/07/Screen-Shot-2020-07-11-at-5.10.15-PM-1594501876-e1594502081599-240x135.png", "https://static.vibe.com/files/2020/07/rodney-jerkins-the-high-note-interview-1594597481-e1594597749361-240x135.jpg", "https://static.vibe.com/files/2020/07/the-old-guard-netflix-film-3-1594653983-240x135.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://static.vibe.com/files/2018/02/rihanna-birthday-1519331475-1073x1500.jpg", "https://www.vibe.com/assets/images/logo/white.svg?c9882160987783148cf8", "https://static.vibe.com/files/2018/02/rihanna-birthday-1519331475-compressed.jpg", "https://static.vibe.com/files/2020/04/GettyImages-1132362794-1588217488-650x366.jpg", "https://static.vibe.com/files/2018/02/rihanna-birthday-1519331475-431x602.jpg"], "top_img": "https://static.vibe.com/files/2018/02/rihanna-birthday-1519331475-1073x1500.jpg", "keywords": [], "authors": ["Sierra Brown"], "canonical_link": "https://www.vibe.com/2018/02/rihanna-birthday-toni-braxton-paris-hilton", "title": "Rihanna Brings In Her Dirty 30s With Toni Braxton And Paris Hilton", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=no", "article": {"modified_time": "2018-02-22T18:41:36-05:00", "published_time": "2018-02-22T16:23:32-05:00"}, "description": "Rihanna ushers in her Dirty 30s with her Day Ones, Toni Braxton and Paris Hilton.", "og": {"description": "Rihanna ushers in her Dirty 30s with her Day Ones, Toni Braxton and Paris Hilton.", "image": {"identifier": "https://static.vibe.com/files/2018/02/rihanna-birthday-1519331475-1073x1500.jpg", "height": 1500, "width": 1073}, "title": "Rihanna Rings In Her 30th Birthday With Toni Braxton And Paris Hilton", "type": "article", "url": "https://www.vibe.com/2018/02/rihanna-birthday-toni-braxton-paris-hilton", "site_name": "Vibe"}, "twitter": {"card": "summary_large_image", "description": "Rihanna ushers in her Dirty 30s with her Day Ones, Toni Braxton and Paris Hilton.", "image": "https://static.vibe.com/files/2018/02/rihanna-birthday-1519331475-1073x1500.jpg", "title": "Rihanna Brings In Her Dirty 30s With Toni Braxton And Paris Hilton", "site": "@vibemagazine"}}, "movies": [], "publish_date": 1519334612.0, "source": "https://www.vibe.com", "summary": ""}