{"url": "discussion.femalefirst.co.uk/viewtopic.php?t=751738", "text": "Postby Guest » Wed May 02, 2018 1:05 pm\n\nBy Andrew Shuster | 3:29 pm, May 1, 2018\n\n\n\nA tabloid report claiming Brad Pitt is seeking advice from George Clooney on his supposed romance with Neri Oxman is completely made-up. As Gossip Cop has repeatedly stressed, the movie star isn’t dating the MIT professor, so this entire story is based on a lie.\n\n\n\nAccording to Woman’s Day, Pitt is inspired by Clooney’s marriage to wife Amal, a human rights lawyer who works completely outside of Hollywood. Oxman is an architecture professor who also has no ties to the movie industry, so Pitt supposedly asked his friend how to keep her interested once his star power wears off.\n\n\n\nAs the story goes, Clooney would rather tease his friend than offer him guidance. A so-called “source” tells the magazine, “George loves that Brad has been thrown off his game and makes fun of him endlessly. It’s sweet payback for all the jokes Brad tossed his way after George started dating Amal.”\n\n\n\nThe outlet’s questionable insider goes on to say that although Clooney has been messing with Pitt, Amal has actually been “advising Neri on ways to keep calm and grounded amid the media circus.” The seemingly nonexistent tipster further contends that Pitt “is very grateful” for Amal because “he’s not used to having a non-famous girlfriend and Neri never expected to be in the limelight.”\n\n\n\nThe tabloid’s article, however, is nothing more than fan fiction. Pitt’s rep has told us on the record several times that the actor isn’t dating Oxman. This has been backed up by trusted publications such as People, which recently noted Pitt and Oxman have a “professional friendship,” as while as E! News, which similarly reported that Pitt and Oxman are “strictly friends.”\n\n\n\nThis article only seems to exist because Woman’s Day came up with a way to drag Clooney into his pal’s imaginary romance. In addition to the fact that Pitt and Oxman aren’t a couple, a mutual pal of ours and Clooney tells us on background that the actor’s friend hasn’t turned to him for advice about dating the MIT professor. This is just a fabricated story based on a phony premise.\n\n\n\nIt’s worth noting, this isn’t the first time Gossip Cop has had to debunk a bogus story about Clooney supposedly playing a role in his friend’s love life. We recently busted New Idea for making up a story about Clooney getting Pitt and Jennifer Aniston back together. This latest article involving Oxman is equally untrue.", "images": ["https://www.femalefirst.co.uk/image-library/partners/bang/square/250/n/naya-rivera-b028205c8cc236bdbad87f43943736944f22d525.jpg", "http://discussion.femalefirst.co.uk/images/smilies/eusa_dance.gif", "https://www.femalefirst.co.uk/image-library/partners/bang/square/250/m/marmageddon-new-zealand-in-marmite-crisis-a69955440fb813105b2256cdc77e8d80fb0c9b8d", "https://www.femalefirst.co.uk/image-library/partners/bang/square/250/d/dying-man-installs-coffin-at-his-home-f1f790cd90c5f7ed02ade3.jpg", "https://www.femalefirst.co.uk/image-library/square/250/p/past-tools-kit-and-bowls.jpg", "http://discussion.femalefirst.co.uk/images/smilies/icon_lol.gif", "https://a.collective-media.net/seg/etu/1b", "http://www.femalefirst.co.uk/assets/gfx/ff/logos/femalefirst.png", "https://www.femalefirst.co.uk/image-library/partners/bang/square/250/f/ferrari-2e9f6b5d8ae121612e1a361e359163ffb7b5a500.jpg", "https://www.femalefirst.co.uk/image-library/square/250/f/ffagony-auntarticle.jpg", "https://www.femalefirst.co.uk/image-library/partners/bang/square/250/3/3m-long-great-white-eaten-3d3a3589edd92ff9a8ad43941775747df9.jpg", "http://discussion.femalefirst.co.uk/images/smilies/icon_biggrin.gif", "https://www.femalefirst.co.uk/image-library/square/250/l/leapfrog-shapes-and-sharing-picnic-basket.jpg", "https://www.femalefirst.co.uk/image-library/partners/bang/square/250/o/olivia-culpo-for-sports-illustrated-a7b9502e2488c79a1411b45e.jpg", "https://www.femalefirst.co.uk/image-library/partners/bang/square/250/m/miriam-margolyes-6a71c5cb2aaf6573bed61eeb46bb822136fc294e.jpg"], "top_img": "https://www.femalefirst.co.uk/image-library/partners/bang/square/250/n/naya-rivera-b028205c8cc236bdbad87f43943736944f22d525.jpg", "keywords": [], "authors": [], "canonical_link": "https://discussion.femalefirst.co.uk/viewtopic.php?t=751738", "title": "Female First Forum", "meta_data": {"viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": null, "source": "http://discussion.femalefirst.co.uk", "summary": ""}