{"url": "discussion.femalefirst.co.uk/viewtopic.php?t=752229", "text": "Postby Guest » Sat Jun 02, 2018 11:27 pm\n\nAre Brad Pitt and Angelina Jolie “calling off” their divorce? A new report claims the estranged spouses have reconciled and are “rebuilding” their family. Gossip Cop, however, can debunk the inaccurate story.\n\n\n\nA headline in the latest edition of Globe exclaims, “Brad & Angie Hot Again!” According to this “world exclusive,” Pitt and Jolie have “mended fences in a sizzling reunion between the sheets.” The supermarket tabloid alleges the real reason their divorce hasn’t been finalized is because the stars “couldn’t bring themselves to sign the papers.” Instead, contends the magazine, “the warring exes had a steamy, clothes-ripping reconciliation.”\n\n\n\nNotably, it’s not said just when this alleged reunion occurred. But a so-called “insider” is quoted as saying, “It was exciting and explosive, and it settled old scores and made them realize they weren’t done with each other.” What, was this supposed source in the room with them? Perhaps hiding under the bed? Or in the closet? In any case, the purported tipster goes on to assert, “They care for each other and they want to work things out.”\n\n\n\nIt’s even alleged Pitt dropped a “bombshell admission” to an unnamed pal, in which he declared, “I love my wife!” The outlet and its “insider” further claim Jolie has given him a key to her home so he can “come and go as he pleases,” and that they’ve had “several hookups in the last few weeks.” Maintains the questionable snitch, “It’s safe to say the divorce is off!”\n\n\n\nThe story is filled out with claims about a future “second commitment ceremony.” It’s also said Pitt will have “the kids over the summer,” and he’s “making plans for visits to London,” where Jolie will be shooting Maleficent 2.” But this tale about how they’ve “decided to give [their] love another try” is entirely wrong and filled with falsehoods.\n\n\n\nAll six kids will actually be spending the summer with Jolie as she films the Maleficent sequel in the UK, as first reported by People. Meanwhile, Pitt is committed to being in Los Angeles so he can shoot Quentin Tarantino’s Once Upon A Time In Hollywood. It’s also impossible for them to have had “hookups” over the last few weeks. Pitt was seen in LA last week, but Jolie has been with the children in England. In fact, she’s been in London since at least May 17, so she certainly hasn’t been having rendezvous with Pitt in California.\n\n\n\nAnd opposed to “calling off” their divorce, the exes are still moving forward with a permanent split. Their plans to dissolve the marriage, however, have been held up because Pitt and Jolie are still at odds over a custody agreement. In fact, E! _ recently described her as “furious” over the situation. That’s a far cry from getting back together.\n\n\n\nConclusion: The Globe claims Jolie and Pitt are “calling off” their divorce, but they’re actually still negotiating custody arrangements. While the tabloid alleges the former couple has recently been engaging in “hookups,” they’ve really been on separate continents. Plus, the magazine also wrongly asserts the kids are spending the summer in Los Angeles when the reputable People has already reported they’ll be in London. As a result, Gossip Cop has determined this report is completely false.", "images": ["https://www.femalefirst.co.uk/image-library/partners/bang/square/250/s/scientists-re-awake-41000-year-old-worms-frozen-in-arctic-ic.jpg", "https://www.femalefirst.co.uk/image-library/partners/bang/square/250/n/naya-rivera-b028205c8cc236bdbad87f43943736944f22d525.jpg", "http://discussion.femalefirst.co.uk/images/avatars/gallery/newimages/eye7.gif", "https://www.femalefirst.co.uk/image-library/square/250/f/ffagony-auntarticle.jpg", "https://www.femalefirst.co.uk/image-library/partners/bang/square/250/m/miriam-margolyes-6a71c5cb2aaf6573bed61eeb46bb822136fc294e.jpg", "http://discussion.femalefirst.co.uk/images/smilies/laughingup.gif", "http://discussion.femalefirst.co.uk/images/smilies/icon_mrgreen.gif", "http://discussion.femalefirst.co.uk/images/smilies/bustingup.gif", "https://www.femalefirst.co.uk/image-library/partners/bang/square/250/m/marmageddon-new-zealand-in-marmite-crisis-a69955440fb813105b2256cdc77e8d80fb0c9b8d", "https://www.femalefirst.co.uk/image-library/partners/bang/square/250/f/ferrari-2e9f6b5d8ae121612e1a361e359163ffb7b5a500.jpg", "http://discussion.femalefirst.co.uk/images/smilies/icon_rolleyes.gif", "https://www.femalefirst.co.uk/image-library/partners/bang/square/250/d/dying-man-installs-coffin-at-his-home-f1f790cd90c5f7ed02ade3.jpg", "http://discussion.femalefirst.co.uk/images/smilies/roflmao.gif", "http://discussion.femalefirst.co.uk/images/avatars/gallery/newimages/eye6.gif", "http://discussion.femalefirst.co.uk/images/smilies/icon_eek.gif", "https://www.femalefirst.co.uk/image-library/partners/bang/square/250/o/olivia-culpo-for-sports-illustrated-a7b9502e2488c79a1411b45e.jpg", "https://www.femalefirst.co.uk/image-library/square/250/p/past-tools-kit-and-bowls.jpg", "https://a.collective-media.net/seg/etu/1b", "http://www.femalefirst.co.uk/assets/gfx/ff/logos/femalefirst.png", "http://discussion.femalefirst.co.uk/images/smilies/icon_lol.gif", "https://media.giphy.com/media/10uG4cPTeBehXi/giphy.gif", "https://www.femalefirst.co.uk/image-library/square/250/l/leapfrog-shapes-and-sharing-picnic-basket.jpg"], "top_img": "https://www.femalefirst.co.uk/image-library/partners/bang/square/250/s/scientists-re-awake-41000-year-old-worms-frozen-in-arctic-ic.jpg", "keywords": [], "authors": [], "canonical_link": "https://discussion.femalefirst.co.uk/viewtopic.php?t=752229", "title": "Female First Forum", "meta_data": {"viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": null, "source": "http://discussion.femalefirst.co.uk", "summary": ""}