{"url": "en.wikipedia.org/wiki/Donald_Trump", "text": "45th president of the United States\n\nDonald John Trump (born June 14, 1946) is the 45th and current president of the United States. Before entering politics, he was a businessman and television personality.\n\nTrump was born and raised in Queens, a borough of New York City, and received a bachelor's degree in economics from the Wharton School. He took charge of his family's real-estate business in 1971, renamed it The Trump Organization, and expanded its operations from Queens and Brooklyn into Manhattan. The company built or renovated skyscrapers, hotels, casinos, and golf courses. Trump later started various side ventures, mostly by licensing his name. He bought the Miss Universe brand of beauty pageants in 1996, and sold it in 2015. He produced and hosted The Apprentice, a reality television series, from 2003 to 2015. As of 2020 , Forbes estimated his net worth to be $2.1 billion.[a]\n\nTrump's political positions have been described as populist, protectionist, and nationalist. He entered the 2016 presidential race as a Republican and was elected in a surprise victory over Democratic nominee Hillary Clinton, although he lost the popular vote.[b] He became the oldest first-term U.S. president,[c] and the first without prior military or government service. His election and policies have sparked numerous protests. Trump has made many false or misleading statements during his campaign and presidency. The statements have been documented by fact-checkers, and the media have widely described the phenomenon as unprecedented in American politics. Many of his comments and actions have been characterized as racially charged or racist.\n\nDuring his presidency, Trump ordered a travel ban on citizens from several Muslim-majority countries, citing security concerns; after legal challenges, the Supreme Court upheld the policy's third revision. He enacted a tax-cut package for individuals and businesses, rescinding the individual health insurance mandate penalty. He appointed Neil Gorsuch and Brett Kavanaugh to the Supreme Court. In foreign policy, Trump has pursued an America First agenda, withdrawing the U.S. from the Trans-Pacific Partnership trade negotiations, the Paris Agreement on climate change, the Iran nuclear deal, and the World Health Organization (WHO). He imposed import tariffs which triggered a trade war with China, recognized Jerusalem as the capital of Israel, and withdrew U.S. troops from northern Syria. Trump met three times with North Korea's leader Kim Jong-un, but talks on denuclearization broke down in 2019. Trump began running for a second term shortly after becoming president.\n\nA special counsel investigation led by Robert Mueller found that Trump and his campaign welcomed and encouraged Russian interference in the 2016 presidential election under the belief that it would be politically advantageous, but did not find sufficient evidence to press charges of criminal conspiracy or coordination with Russia.[d] Mueller also investigated Trump for obstruction of justice, and his report neither indicted nor exonerated Trump on that offense. After Trump solicited the investigation of a political rival by Ukraine, the House of Representatives impeached him in December 2019 for abuse of power and obstruction of Congress. The Senate acquitted him of both charges in February 2020.\n\nPersonal life\n\nEarly life\n\n1964 New York Military Academy yearbook photo\n\nDonald John Trump was born on June 14, 1946, at the Jamaica Hospital in the borough of Queens, New York City.[1] His father was Frederick Christ Trump, a Bronx-born real estate developer whose parents were German immigrants. His mother was Scottish-born housewife Mary Anne MacLeod Trump. Trump grew up in the Jamaica Estates neighborhood of Queens and attended the Kew-Forest School from kindergarten through seventh grade.[3] At age 13, he was enrolled in the New York Military Academy, a private boarding school. In 1964, Trump enrolled at Fordham University. Two years later he transferred to the Wharton School of the University of Pennsylvania.[5] While at Wharton, he worked at the family business, Elizabeth Trump & Son.[6] He graduated in May 1968 with a B.S. in economics.[5][7] Profiles of Trump published in The New York Times in 1973 and 1976 erroneously reported that he had graduated first in his class at Wharton, but he had never made the school's honor roll.[8] In 2015, Trump's lawyer Michael Cohen threatened Fordham University and the New York Military Academy with legal action if they released Trump's academic records.[9]\n\nMilitary deferment\n\nWhile in college, Trump obtained four student draft deferments.[10] In 1966, he was deemed fit for military service based upon a medical examination, and in July 1968 a local draft board classified him as eligible to serve.[11] In October 1968, he was medically deferred and classified 1-Y (unqualified for duty except in the case of a national emergency).[12] In 1972, he was reclassified 4-F due to bone spurs, which permanently disqualified him from service.[13][14] Trump said in 2015 the deferment was for a bone spur in his foot, though he could not remember which foot had been afflicted.[12]\n\nFamily\n\nParents and siblings\n\nFred Trump started working in real estate with his mother Elizabeth when he was 15, after his father Friedrich had died in the 1918 flu pandemic.[15] Their company, \"E. Trump & Son\", founded in 1923,[16] was active in the New York boroughs of Queens and Brooklyn, building and selling thousands of houses, barracks, and apartments.[17] Fred claimed to be Swedish amid the anti-German sentiment sparked by World War II;[18] Donald Trump also claimed Swedish heritage until 1990.[19] Trump's mother Mary Anne MacLeod was born in Scotland.[20] Fred and Mary were married in 1936 and raised their family in Queens.[21] Trump grew up with three elder siblings – Maryanne, Fred Jr., and Elizabeth – and younger brother Robert.[22]\n\nWives and children\n\nIn 1977, Trump married Czech model Ivana Zelníčková. They have three children, Donald Jr. (born 1977), Ivanka (born 1981), and Eric (born 1984), and ten grandchildren.[24] Ivana became a naturalized United States citizen in 1988.[25] The couple divorced in 1992, following Trump's affair with actress Marla Maples.[26] Maples and Trump married in 1993[27] and had one daughter, Tiffany (born 1993).[28] They were divorced in 1999,[29] and Tiffany was raised by Marla in California.[30] In 2005, Trump married Slovenian model Melania Knauss.[31] They have one son, Barron (born 2006).[32] Melania gained U.S. citizenship in 2006.[33]\n\nReligion\n\nTrump identifies as Presbyterian. He went to Sunday school and was confirmed in 1959 at the First Presbyterian Church in Jamaica, Queens.[34][35] In the 1970s, his parents joined the Marble Collegiate Church in Manhattan, which belongs to the Reformed Church.[34][36] The pastor at Marble, Norman Vincent Peale,[34] ministered to Trump's family until Peale's death in 1993.[36] Trump has described Peale as a mentor. In 2015, after Trump said he attends Marble, the church publicly stated he \"is not an active member\" of the church.[35]\n\nWhile campaigning, Trump said, \"Nothing beats the Bible.\"[38] In November 2019, Trump appointed his personal pastor, televangelist Paula White, to the White House Office of Public Liaison.[39]\n\nHealth and lifestyle\n\nTrump abstains from alcohol.[40] He claims he has never smoked cigarettes or cannabis.[41] He likes fast food and French cuisine.[42][43] He has said he prefers three to four hours of sleep per night.[44] He has called golfing his \"primary form of exercise\", although he usually does not walk the course.[45] He considers exercise a waste of energy, because he believes the body is \"like a battery, with a finite amount of energy\" which is depleted by exercise.[46]\n\nIn December 2015, Harold Bornstein, who had been Trump's personal physician since 1980, wrote in a letter that he would \"be the healthiest individual ever elected to the presidency\".[47] In May 2018, Bornstein said Trump had dictated the contents of the letter,[48] and that three agents of Trump had removed his medical records in February 2017 without due authorization.[49]\n\nIn January 2018, White House physician Ronny Jackson said Trump was in excellent health and that his cardiac assessment revealed no issues.[50] Several outside cardiologists commented that Trump's 2018 LDL cholesterol level of 143 did not indicate excellent health.[51] In February 2019, after a new examination, White House physician Sean Conley said Trump was in \"very good health overall\", although he was clinically obese.[52] His 2019 coronary CT calcium scan score indicates he suffers from a form of coronary artery disease common for white men of his age.[53]\n\nIn June 2020, Conley released a memorandum saying \"the data indicates that the President remains healthy.\"[54][55] The memorandum was not the usual report issued after the annual physical exam. It summarized medical appointments that had taken place between November 2019 and 2020. It also said Trump had completed two-weeks of taking hydroxychloroquine with zinc and vitamin D \"safely and without side effects\" as a preventive measure against contracting COVID-19.[54]\n\nWealth\n\nIn 1982, Trump was listed on the initial Forbes list of wealthy individuals as having a share of his family's estimated $200 million net worth. His financial losses in the 1980s caused him to be dropped from the list between 1990 and 1995.[57] In its 2020 billionaires ranking, Forbes estimated Trump's net worth at $2.1 billion[a] (1,001st in the world, 275th in the U.S.)[60] making him one of the richest politicians in American history and the first billionaire American president.[60] During the three years since Trump announced his presidential run in 2015, Forbes estimated his net worth declined 31% and his ranking fell 138 spots.[61] When he filed mandatory financial disclosure forms with the Federal Elections Commission (FEC) in July 2015, Trump claimed a net worth of about $10 billion;[62] however, FEC figures cannot corroborate this estimate because they only show each of his largest buildings as being worth over $50 million, yielding total assets worth more than $1.4 billion and debt over $265 million.[63] Trump said in a 2007 deposition, \"My net worth fluctuates, and it goes up and down with markets and with attitudes and with feelings, even my own feelings.\"[64]\n\nJournalist Jonathan Greenberg reported in April 2018 that Trump, using the pseudonym \"John Barron\" and claiming to be a Trump Organization official, called him in 1984 to falsely assert that he owned \"in excess of ninety percent\" of the Trump family's business, in an effort to secure a higher ranking on the Forbes 400 list of wealthy Americans. Greenberg also wrote that Forbes had vastly overestimated Trump's wealth and wrongly included him on the Forbes 400 rankings of 1982, 1983, and 1984.[65]\n\nTrump has often said he began his career with \"a small loan of one million dollars\" from his father, and that he had to pay it back with interest.[66] In October 2018, The New York Times reported that Trump \"was a millionaire by age 8\", borrowed at least $60 million from his father, largely failed to reimburse him, and had received $413 million (adjusted for inflation) from his father's business empire over his lifetime.[67][68] According to the report, Trump and his family committed tax fraud, which a lawyer for Trump denied. The tax department of New York says it is \"vigorously pursuing all appropriate avenues of investigation\" into it.[69][70] Analyses by The Economist and The Washington Post have concluded that Trump's investments underperformed the stock market.[71][72] Forbes estimated in October 2018 that the value of Trump's personal brand licensing business had declined by 88% since 2015, to $3 million.[73]\n\nTrump's tax returns from 1985 to 1994 show net losses totaling $1.17 billion over the ten-year period, in contrast to his claims about his financial health and business abilities. The New York Times reported that \"year after year, Mr. Trump appears to have lost more money than nearly any other individual American taxpayer\", and Trump's \"core business losses in 1990 and 1991 – more than $250 million each year – were more than double those of the nearest taxpayers in the I.R.S. information for those years\". In 1995 his reported losses were $915.7 million.[74][75]\n\nBusiness career\n\nReal estate\n\nTrump began his career in 1968 at his father Fred's real estate development company, E. Trump & Son, which owned middle-class rental housing in New York City's outer boroughs.[77] In 1971, he became president of the company and renamed it The Trump Organization.\n\nManhattan developments\n\nTrump attracted public attention in 1978 with the launch of his family's first Manhattan venture, the renovation of the derelict Commodore Hotel, adjacent to Grand Central Terminal. The financing was facilitated by a $400 million city property tax abatement arranged by Fred Trump,[79] who also joined Hyatt in guaranteeing $70 million in bank construction financing.[80] The hotel reopened in 1980 as the Grand Hyatt Hotel, and that same year, Trump obtained rights to develop Trump Tower, a mixed-use skyscraper in Midtown Manhattan.[83] The building houses the headquarters of the Trump Organization and was Trump's primary residence until 2019.[84][85]\n\nIn 1988, Trump acquired the Plaza Hotel in Manhattan with a loan of $425 million from a consortium of banks. Two years later, the hotel filed for bankruptcy protection, and a reorganization plan was approved in 1992.[86] In 1995, Trump lost the hotel to Citibank and investors from Singapore and Saudi Arabia, who assumed $300 million of the debt.[87][88]\n\nIn 1996, Trump acquired a vacant 71-story skyscraper at 40 Wall Street. After an extensive renovation, the high-rise was renamed the Trump Building. In the early 1990s, Trump won the right to develop a 70-acre (28 ha) tract in the Lincoln Square neighborhood near the Hudson River. Struggling with debt from other ventures in 1994, Trump sold most of his interest in the project to Asian investors who were able to finance completion of the project, Riverside South.[90]\n\nPalm Beach estate\n\nMar-a-Lago in 2009\n\nIn 1985, Trump acquired the Mar-a-Lago estate in Palm Beach, Florida.[91] Trump used a wing of the estate as a home, while converting the remainder into a private club with an initiation fee and annual dues.[92] The initiation fee was $100,000 until 2016; it was doubled to $200,000 in January 2017.[93] On September 27, 2019, Trump declared Mar-a-Lago his primary residence.[85]\n\nAtlantic City casinos\n\nIn 1984, Trump opened Harrah's at Trump Plaza hotel and casino in Atlantic City, New Jersey with financing from the Holiday Corporation, who also managed the operation. Gambling had been legalized there in 1977 in an effort to revitalize the once-popular seaside destination. Soon after it opened the casino was renamed \"Trump Plaza\", but the property's poor financial results worsened tensions between Holiday and Trump, who paid Holiday $70 million in May 1986 to take sole control of the property. Earlier, Trump had also acquired a partially completed building in Atlantic City from the Hilton Corporation for $320 million. Upon its completion in 1985, that hotel and casino was called Trump Castle. Trump's then-wife Ivana managed it until 1988.\n\nTrump acquired a third casino in Atlantic City, the Taj Mahal, in 1988 in a highly leveraged transaction.[98] It was financed with $675 million in junk bonds and completed at a cost of $1.1 billion, opening in April 1990.[99][100] The project went bankrupt the following year,[100] and the reorganization left Trump with only half his initial ownership stake and required him to pledge personal guarantees of future performance.[102] Facing \"enormous debt\", he gave up control of his money-losing airline, Trump Shuttle, and sold his 282-foot (86 m) mega yacht, the Trump Princess, which had been indefinitely docked in Atlantic City while leased to his casinos for use by wealthy gamblers.[103]\n\nIn 1995, Trump founded Trump Hotels & Casino Resorts (THCR), which assumed ownership of Trump Plaza, Trump Castle, and the Trump Casino in Gary, Indiana.[105] THCR purchased the Taj Mahal in 1996 and underwent successive bankruptcies in 2004, 2009, and 2014, leaving Trump with only ten percent ownership.[106] He remained chairman of THCR until 2009.[107]\n\nGolf courses\n\nThe Trump Organization began acquiring and constructing golf courses in 1999.[108] It owned 16 golf courses and resorts worldwide and operated another two as of December 2016 . According to Trump's FEC personal financial disclosure, his 2015 golf and resort revenue amounted to $382 million.[109]\n\nFrom his inauguration until the end of 2019, Trump spent around one out of every five days at one of his golf clubs.[110]\n\nBranding and licensing\n\nAfter the Trump Organization's financial losses in the early 1990s, it refocused its business on branding and licensing the Trump name for projects owned and operated by other people and companies.[111] In the late 2000s and early 2010s, it expanded this branding and management business to hotel towers located around the world, including Chicago; Las Vegas; Washington, D.C.; Panama City; Toronto; and Vancouver. There were also Trump-branded buildings in Dubai, Honolulu, Istanbul, Manila, Mumbai, and Indonesia.[112]\n\nThe Trump name has also been licensed for various consumer products and services, including foodstuffs, apparel, adult learning courses, and home furnishings.[113][114] According to an analysis by The Washington Post, there are more than fifty licensing or management deals involving Trump's name, which have generated at least $59 million in yearly revenue for his companies.[115] By 2018 only two consumer goods companies continued to license his name.[114]\n\nLegal affairs and bankruptcies\n\nFixer Roy Cohn served as Trump's lawyer and mentor in the 1970s and 1980s, with a 13-year relationship.[116][117] According to Trump, they were so close that Cohn sometimes waived fees due to their friendship.[77] In 1973, Cohn helped Trump counter-sue the United States government for $100 million over its charges that Trump's properties had racial discriminatory practices; in 1975 an agreement was struck for Trump's properties to change their practices.[118] It was Cohn who introduced political consultant Roger Stone to Trump, who enlisted Stone's services to deal with the federal government.[119]\n\nAs of April 2018 , Trump and his businesses had been involved in more than 4,000 state and federal legal actions, according to a running tally by USA Today.[120] As of 2016 , he or one of his companies had been the plaintiff in 1,900 cases and the defendant in 1,450.[121]\n\nWhile Trump has not filed for personal bankruptcy, his over-leveraged hotel and casino businesses in Atlantic City and New York filed for Chapter 11 bankruptcy protection six times between 1991 and 2009.[122][123] They continued to operate while the banks restructured debt and reduced Trump's shares in the properties.[122][123]\n\nDuring the 1980s, more than 70 banks had lent Trump $4 billion,[124] but in the aftermath of his corporate bankruptcies of the early 1990s, most major banks declined to lend to him, with only Deutsche Bank still willing to lend money.[125]\n\nIn April 2019, the House Oversight Committee issued subpoenas seeking financial details from Trump's banks, Deutsche Bank and Capital One, and his accounting firm, Mazars USA. In response, Trump sued the banks, Mazars, and committee chairman Elijah Cummings to prevent the disclosures.[126][127] In May, DC District Court judge Amit Mehta ruled that Mazars must comply with the subpoena,[128] and judge Edgardo Ramos of the Southern District Court of New York ruled that the banks must also comply.[129][130] Trump's attorneys appealed the rulings,[131] arguing that Congress was attempting to usurp the \"exercise of law-enforcement authority that the Constitution reserves to the executive branch\".[132][133]\n\nSide ventures\n\nAfter taking over control of the Trump Organization in 1971, Trump expanded its real estate operations and ventured into other business activities. The company eventually became the umbrella organization for several hundred individual business ventures and partnerships.[134]\n\nIn September 1983, Trump purchased the New Jersey Generals, a team in the United States Football League. After the 1985 season, the league folded largely due to Trump's strategy of moving games to a fall schedule where they competed with the NFL for audience, and trying to force a merger with the NFL by bringing an antitrust suit against the organization.[135][136]\n\nTrump's businesses have hosted several boxing matches at the Atlantic City Convention Hall adjacent to and promoted as taking place at the Trump Plaza in Atlantic City, including Mike Tyson's 1988 heavyweight championship fight against Michael Spinks.[137] In 1989 and 1990, Trump lent his name to the Tour de Trump cycling stage race, which was an attempt to create an American equivalent of European races such as the Tour de France or the Giro d'Italia.[139]\n\nIn the late 1980s, Trump mimicked the actions of Wall Street's so-called corporate raiders, whose tactics had attracted wide public attention. Trump began to purchase significant blocks of shares in various public companies, leading some observers to think he was engaged in the practice called greenmail, or feigning the intent to acquire the companies and then pressuring management to repurchase the buyer's stake at a premium. The New York Times found that Trump initially made millions of dollars in such stock transactions, but later \"lost most, if not all, of those gains after investors stopped taking his takeover talk seriously\".[140][141][142]\n\nIn 1988, Trump purchased the defunct Eastern Air Lines shuttle, with 21 planes and landing rights in New York City, Boston, and Washington, D.C. He financed the purchase with $380 million from 22 banks, rebranded the operation the Trump Shuttle, and operated it until 1992. Trump failed to earn a profit with the airline and sold it to USAir.[143]\n\nFrom 1996 to 2015, Trump owned all or part of the Miss Universe pageants, including Miss USA and Miss Teen USA.[144][145] Due to disagreements with CBS about scheduling, he took both pageants to NBC in 2002.[146][147] In 2007, Trump received a star on the Hollywood Walk of Fame for his work as producer of Miss Universe.[148] After NBC and Univision dropped the pageants from their broadcasting lineups in June 2015,[149] Trump bought NBC's share of the Miss Universe Organization and sold the entire company to the William Morris talent agency.[150]\n\nTrump University\n\nIn 2004, Trump co-founded a company called Trump University which sold real estate training courses priced from $1,500 to $35,000.[151][152] After New York State authorities notified the company that its use of the word \"university\" violated state law, its name was changed to Trump Entrepreneur Initiative in 2010.[153]\n\nIn 2013, the State of New York filed a $40 million civil suit against Trump University; the suit alleged that the company made false statements and defrauded consumers.[154][155] In addition, two class actions were filed in federal court; they named Trump personally as well as his companies. Internal documents revealed that employees were instructed to use a hard-sell approach, and former employees said in depositions that Trump University had defrauded or lied to its students.[156][157][158][159][160] Shortly after he won the presidency, Trump agreed to pay a total of $25 million to settle the three cases.[161]\n\nFoundation\n\nThe Donald J. Trump Foundation was a U.S.-based private foundation established in 1988 for the initial purpose of giving away proceeds from the book Trump: The Art of the Deal.[162][163] In the foundation's final years its funds mostly came from donors other than Trump, who did not donate any personal funds to the charity from 2009 until 2014.[164] The foundation gave to health care and sports-related charities, as well as conservative groups.[165]\n\nIn 2016, The Washington Post reported that the charity had committed several potential legal and ethical violations, including alleged self-dealing and possible tax evasion.[166] Also in 2016, the New York State Attorney General's office said the foundation appeared to be in violation of New York laws regarding charities and ordered it to immediately cease its fundraising activities in New York.[167][168] Trump's team announced in late December 2016 that the Foundation would be dissolved to remove \"even the appearance of any conflict with [his] role as President\".[169]\n\nIn June 2018 the New York attorney general's office filed a civil suit against the foundation, Trump himself, and his adult children, asking for $2.8 million in restitution and additional penalties.[170][171] In December 2018, the foundation ceased operation and disbursed all its assets to other charities.[172] The following November, a New York state judge ordered Trump to pay $2 million to a group of charities for misusing the foundation's funds, in part to finance his presidential campaign.[173][174]\n\nConflicts of interest\n\nBefore being inaugurated as president, Trump moved his businesses into a revocable trust run by his eldest sons and a business associate.[175][176] According to ethics experts, measures taken by Trump do not help avoid conflicts of interest as long as he continues to profit from his businesses.[177] Because Trump would have knowledge of how his administration's policies affect his businesses, ethics experts recommend selling the businesses.[176] Though Trump said he would eschew \"new foreign deals\", the Trump Organization has since pursued expansions of its operations in Dubai, Scotland, and the Dominican Republic.[177]\n\nMultiple lawsuits have been filed alleging that Trump is violating the Emoluments Clause of the United States Constitution, which forbids presidents from taking money from foreign governments, due to his business interests; they argue that these interests allow foreign governments to influence him.[177][178] Previous presidents in the modern era have either divested their holdings or put them in blind trusts,[175] and he is the first president to be sued over the emoluments clause.[178] According to The Guardian, \"NBC News recently calculated that representatives of at least 22 foreign governments – including some facing charges of corruption or human rights abuses such as Saudi Arabia, Malaysia, Turkey and the Philippines – seem to have spent funds at Trump properties while he has been president.\"[179] On October 21, 2019, Trump mocked the Emoluments Clause as \"phony\".[180]\n\nIn 2015, Trump said he \"makes a lot of money with\" the Saudis and that \"they pay me millions and hundreds of millions.\"[181] And at a political rally, Trump said about Saudi Arabia: \"They buy apartments from me. They spend $40 million, $50 million. Am I supposed to dislike them? I like them very much.\"[182]\n\nIn December 2015, Trump said in a radio interview that he had a \"conflict of interest\" in dealing with Turkey and Turkish president Tayyip Erdoğan because of his Trump Towers Istanbul, saying \"I have a little conflict of interest because I have a major, major building in Istanbul and it's a tremendously successful job ... It's called Trump Towers – two towers instead of one ... I've gotten to know Turkey very well\".[183][184]\n\nMedia career\n\nBooks\n\nTrump's first book, The Art of the Deal (1987), was on the New York Times Best Seller list for 48 weeks. According to The New Yorker, \"The book expanded Trump's renown far beyond New York City, promoting an image of himself as a successful dealmaker and tycoon.\" Trump was credited as the book's co-author with Tony Schwartz. Schwartz later said he had done all the writing, and this was confirmed by Howard Kaminsky, who at the time the book appeared was head of its publisher, Random House.[185] Trump has called The Art of the Deal his second favorite book, after the Bible.[186]\n\nTwo lesser memoirs were published in 1990 and 1997.\n\nWWE\n\nTrump has had a sporadic relationship with the professional wrestling promotion WWE (World Wrestling Federation/Entertainment) since the late 1980s.[187][188] He headlined the record-breaking WrestleMania 23 in 2007 and was inducted into the celebrity wing of the WWE Hall of Fame in 2013.[189] WWE co-founder and former CEO Linda McMahon later worked in his administration and election campaigns.[189]\n\nThe Apprentice\n\nIn 2003, Trump became the co-producer and host of The Apprentice, a reality show in which Trump played the role of a powerful chief executive and contestants competed for a year of employment at the Trump Organization. Trump winnowed out contestants with his famous catchphrase \"You're fired\".[190] He later co-hosted The Celebrity Apprentice, in which celebrities competed to win money for charities.[190]\n\nActing\n\nTrump has made cameo appearances in eight films and television shows[191][192] and performed a song as a Green Acres character with Megan Mullally at the 57th Primetime Emmy Awards in 2005.[193]\n\nTalk shows\n\nStarting in the 1990s, Trump was a guest about 24 times on the nationally syndicated Howard Stern Show. He also had his own short-form talk radio program called Trumped! (one to two minutes on weekdays) from 2004 to 2008.[195][196] In 2011, he was given a weekly unpaid guest commentator spot on Fox & Friends which continued until he started his presidential candidacy in 2015.[197][198]\n\nPolitical career\n\nPolitical activities up to 2015\n\nTrump's political party affiliation changed numerous times. He registered as a Republican in Manhattan in 1987, switched to the Reform Party in 1999, the Democratic Party in 2001, and back to the Republican Party in 2009.[199]\n\nIn 1987, Trump placed full-page advertisements in three major newspapers,[200] advocating peace in Central America, accelerated nuclear disarmament talks with the Soviet Union, and reduction of the federal budget deficit by making American allies pay \"their fair share\" for military defense.[201] He ruled out running for local office but not for the presidency.[200]\n\n2000 presidential campaign\n\nIn 1999, Trump filed an exploratory committee to seek the nomination of the Reform Party for the 2000 presidential election.[202][203] A July 1999 poll matching him against likely Republican nominee George W. Bush and likely Democratic nominee Al Gore showed Trump with seven percent support.[204] Trump dropped out of the race in February 2000.[205]\n\n2012 presidential speculation\n\nTrump speaking at CPAC 2011\n\nTrump speculated about running for president in the 2012 election, making his first speaking appearance at the Conservative Political Action Conference (CPAC) in February 2011 and giving speeches in early primary states.[206][207] In May 2011 he announced he would not run.[206]\n\nTrump's presidential ambitions were generally not taken seriously at the time.[208] Before the 2016 election, The New York Times speculated that Trump \"accelerated his ferocious efforts to gain stature within the political world\" after Obama lampooned him at the White House Correspondents' Association Dinner in April 2011.[209]\n\nIn 2011, the superintendent of the New York Military Academy at the time, Jeffrey Coverdale, ordered the headmaster of the school, Evan Jones, to give him Trump's academic records so he could keep them secret, according to Jones. Coverdale confirmed that he had been asked to hand the records over to members of the school's board of trustees who were Trump's friends, but he refused to and instead sealed them on campus. The incident reportedly happened days after Trump demanded the release of President Barack Obama's academic records.[210]\n\n2013–2015\n\nIn 2013, Trump spoke at CPAC again;[211] he railed against illegal immigration, bemoaned Obama's \"unprecedented media protection\", advised against harming Medicare, Medicaid, and Social Security, and suggested the government \"take\" Iraq's oil and use the proceeds to pay a million dollars each to families of dead soldiers.[212][213] He spent over $1 million that year to research a possible 2016 candidacy.[214]\n\nIn October 2013, New York Republicans circulated a memo suggesting Trump should run for governor of the state in 2014 against Andrew Cuomo. Trump responded that while New York had problems and its taxes were too high, he was not interested in the governorship.[215] A February 2014 Quinnipiac poll had shown Trump losing to the more popular Cuomo by 37 points in a hypothetical election.[216]\n\nAccording to Trump's attorney Michael Cohen, in May 2015 he sent letters to the New York Military Academy and to Fordham, threatening legal action if the schools ever released Trump's grades or SAT scores; Fordham confirmed receipt of the letter as well as a phone call from a member of the Trump team.[217]\n\n2016 presidential campaign\n\nRepublican primaries\n\nOn June 16, 2015, Trump announced his candidacy for President of the United States at Trump Tower in Manhattan. In the speech, Trump discussed illegal immigration, offshoring of American jobs, the U.S. national debt, and Islamic terrorism, which all remained large priorities during the campaign. He also announced his campaign slogan: \"Make America Great Again\".[218] Trump said his wealth would make him immune to pressure from campaign donors.[219] He declared that he was funding his own campaign,[220] but according to The Atlantic, \"Trump's claims of self-funding have always been dubious at best and actively misleading at worst.\"[221]\n\nTrump's campaign was initially not taken seriously by political analysts, but he quickly rose to the top of opinion polls.[222]\n\nOn Super Tuesday, Trump received the most votes, and he remained the front-runner throughout the primaries. By March 2016, Trump was poised to win the Republican nomination.[223] After a landslide win in Indiana on May 3, 2016 – which prompted the remaining candidates Cruz and John Kasich to suspend their presidential campaigns – RNC chairman Reince Priebus declared Trump the presumptive Republican nominee.[224]\n\nGeneral election campaign\n\nAfter becoming the presumptive Republican nominee, Trump shifted his focus to the general election. Trump began campaigning against Hillary Clinton, who became the presumptive Democratic nominee on June 6, 2016.\n\nClinton had established a significant lead over Trump in national polls throughout most of 2016. In early July, Clinton's lead narrowed in national polling averages following the FBI's re-opening the investigation into her ongoing email controversy.[225][226][227]\n\nOn July 15, 2016, Trump announced his selection of Indiana governor Mike Pence as his running mate.[228] Four days later, the two were officially nominated by the Republican Party at the Republican National Convention.[229] The list of convention speakers and attendees included former presidential nominee Bob Dole, but the other prior nominees did not attend.[230][231]\n\nOn September 26, 2016, Trump and Clinton faced off in their first presidential debate, which was held at Hofstra University in Hempstead, New York.[232] The second presidential debate was held at Washington University in St. Louis, Missouri. The final presidential debate was held on October 19 at the University of Nevada, Las Vegas. Trump's refusal to say whether he would accept the result of the election, regardless of the outcome, drew particular attention, with some saying it undermined democracy.[233][234]\n\nPolitical positions\n\nTrump's campaign platform emphasized renegotiating U.S.–China relations and free trade agreements such as NAFTA and the Trans-Pacific Partnership, strongly enforcing immigration laws, and building a new wall along the U.S.–Mexico border. His other campaign positions included pursuing energy independence while opposing climate change regulations such as the Clean Power Plan and the Paris Agreement, modernizing and expediting services for veterans, repealing and replacing the Affordable Care Act, abolishing Common Core education standards, investing in infrastructure, simplifying the tax code while reducing taxes for all economic classes, and imposing tariffs on imports by companies that offshore jobs. During the campaign, he also advocated a largely non-interventionist approach to foreign policy while increasing military spending, extreme vetting or banning immigrants from Muslim-majority countries[235] to pre-empt domestic Islamic terrorism, and aggressive military action against the Islamic State of Iraq and the Levant. During the campaign Trump repeatedly called NATO \"obsolete\".[236][237]\n\nHis political positions have been described as populist,[238][239][240] and some of his views cross party lines. For example, his economic campaign plan calls for deregulation and large reductions in income taxes, consistent with Republican Party policies,[241] along with significant infrastructure investment, usually considered a Democratic Party policy.[242] Trump has supported or leaned toward varying political positions over time.[243][244] Politico has described his positions as \"eclectic, improvisational and often contradictory\",[245] while NBC News counted \"141 distinct shifts on 23 major issues\" during his campaign.[246]\n\nCampaign rhetoric\n\nIn his campaign, Trump said he disdained political correctness; he also said the media had intentionally misinterpreted his words, and he made other claims of adverse media bias.[247][248][249] In part due to his fame, and due to his willingness to say things other candidates would not, and because a candidate who is gaining ground automatically provides a compelling news story, Trump received an unprecedented amount of free media coverage during his run for the presidency, which elevated his standing in the Republican primaries.[250]\n\nFact-checking organizations have denounced Trump for making a record number of false statements compared to other candidates.[251][252][253] At least four major publications – Politico, The Washington Post, The New York Times, and the Los Angeles Times – have pointed out lies or falsehoods in his campaign statements, with the Los Angeles Times saying, \"Never in modern presidential politics has a major candidate made false statements as routinely as Trump has\".[254] NPR said Trump's campaign statements were often opaque or suggestive.[255]\n\nTrump's penchant for hyperbole is believed to have roots in the New York real estate scene, where Trump established his wealth and where puffery abounds.[256] Trump adopted his ghostwriter's phrase \"truthful hyperbole\" to describe his public speaking style.[256][257]\n\nSupport from the far right\n\nAccording to Michael Barkun, the Trump campaign was remarkable for bringing fringe ideas, beliefs, and organizations into the mainstream.[258] During his presidential campaign, Trump was accused of pandering to white supremacists.[259][260][261] He retweeted open racists,[262][263] and repeatedly refused to condemn David Duke, the Ku Klux Klan or white supremacists, in an interview on CNN's State of the Union, saying he would first need to \"do research\" because he knew nothing about Duke or white supremacists.[264][265] Duke himself enthusiastically supported Trump throughout the 2016 primary and election, and has said he and like-minded people voted for Trump because of his promises to \"take our country back\".[266][267]\n\nAfter repeated questioning by reporters, Trump said he disavowed David Duke and the KKK.[268] Trump said on MSNBC's Morning Joe: \"I disavowed him. I disavowed the KKK. Do you want me to do it again for the 12th time? I disavowed him in the past, I disavow him now.\"[268]\n\nThe alt-right movement coalesced around Trump's candidacy,[269] due in part to its opposition to multiculturalism and immigration.[270][271][272] Members of the alt-right enthusiastically supported Trump's campaign.[273] In August 2016, he appointed Steve Bannon – the executive chairman of Breitbart News – as his campaign CEO; Bannon described Breitbart News as \"the platform for the alt-right\".[274] In an interview days after the election, Trump condemned supporters who celebrated his victory with Nazi salutes.[275][276]\n\nFinancial disclosures\n\nAs a presidential candidate, Trump disclosed details of his companies, assets, and revenue sources to the extent required by the FEC. His 2015 report listed assets above $1.4 billion and outstanding debts of at least $265 million.[63][277] The 2016 form showed little change.[109]\n\nTrump has not released his tax returns, contrary to the practice of every major candidate since 1976 and his promises in 2014 and 2015 to do so if he ran for office.[278][279] He said his tax returns were being audited (in actuality, audits do not prevent release of tax returns), and his lawyers had advised him against releasing them.[280] Trump has told the press his tax rate is none of their business, and that he tries to pay \"as little tax as possible\".[281]\n\nIn October 2016, portions of Trump's state filings for 1995 were leaked to a reporter from The New York Times. They show that Trump had declared a loss of $916 million that year, which could have let him avoid taxes for up to 18 years. During the second presidential debate, Trump acknowledged using the deduction, but declined to provide details such as the specific years it was applied.[282]\n\nOn March 14, 2017, the first two pages of Trump's 2005 federal income tax returns were leaked to MSNBC. The document states that Trump had a gross adjusted income of $150 million and paid $38 million in federal taxes. The White House confirmed the authenticity of the documents.[283][284]\n\nIn April 2019, the House Ways and Means Committee made a formal request to the Internal Revenue Service for Trump's personal and business tax returns from 2013 to 2018.[285] Two deadlines to provide the returns were missed, then Treasury secretary Steven Mnuchin in May 2019 ultimately denied the request.[286][287][288] Committee chairman Richard Neal then subpoenaed the Treasury Department and the IRS for the returns.[289] These subpoenas were also defied in May 2019.[290] A fall 2018 draft IRS legal memo asserted that tax returns must be provided to Congress upon request, unless a president invokes executive privilege. Congress need not justify the request, the memo stated, contradicting the administration's justification that a legislative purpose is needed to produce the tax returns.[291] Mnuchin asserted the memo actually addressed a different matter.[292]\n\nElection to the presidency\n\n2016 electoral vote results\n\nOn November 8, 2016, Trump received 306 pledged electoral votes versus 232 for Clinton. The official counts were 304 and 227 respectively, after defections on both sides.[293] Trump received nearly 2.9 million fewer popular votes than Clinton, which made him the fifth person to be elected president while losing the popular vote.[294][e] Clinton was ahead nationwide, with 65,853,514 votes (48.18%) compared to Trump's 62,984,828 votes (46.09%).[297]\n\nTrump's victory was considered a stunning political upset by most observers, as polls had consistently showed Hillary Clinton with a nationwide – though diminishing – lead, as well as a favorable advantage in most of the competitive states. Trump's support had been modestly underestimated throughout his campaign,[298] and many observers blamed errors in polls, partially attributed to pollsters overestimating Clinton's support among well-educated and nonwhite voters, while underestimating Trump's support among white working-class voters.[299] The polls were relatively accurate,[300] but media outlets and pundits alike showed overconfidence in a Clinton victory despite a large number of undecided voters and a favorable concentration of Trump's core constituencies in competitive states.[301]\n\nPresident Obama and president-elect Trump on November 10, 2016\n\nTrump won 30 states, including Michigan, Pennsylvania, and Wisconsin, which had been considered a blue wall of Democratic strongholds since the 1990s. Clinton won 20 states and the District of Columbia. Trump's victory marked the return of a Republican White House combined with control of both chambers of Congress.[citation needed]\n\nTrump is the wealthiest president in U.S. history, even after adjusting for inflation,[302] and the oldest person to take office as president.[303] He is also the first president who did not serve in the military or hold elective or appointed government office prior to being elected.[304][305] Of the 43[f] previous presidents, 38 had held prior elective office, two had not held elective office but had served in the Cabinet, and three had never held public office but had been commanding generals.[305]\n\nProtests\n\nSome rallies during the primary season were accompanied by protests or violence, including attacks on Trump supporters and vice versa both inside and outside the venues.[307][308][309] Trump's election victory sparked protests across the United States, in opposition to his policies and his inflammatory statements. Trump initially tweeted that these were \"professional protesters, incited by the media\" and \"unfair\", but later \"Love the fact that the small groups of protesters last night have passion for our great country.\"[310][311]\n\nIn the weeks following Trump's inauguration, massive anti-Trump demonstrations took place, such as the Women Marches, which gathered 2,600,000 people worldwide,[312] including 500,000 in Washington alone.[313] Marches against his travel ban began across the country on January 29, 2017, just nine days after his inauguration.[314]\n\n2020 presidential campaign\n\nTrump signaled his intention to run for a second term by filing with the FEC within a few hours of assuming the presidency.[315][316] This transformed his 2016 election committee into a 2020 reelection one.[317] Trump marked the official start of the campaign with a rally in Melbourne, Florida, on February 18, 2017, less than a month after taking office.[318] By January 2018, Trump's reelection committee had $22 million in hand,[319] and it had raised a total amount exceeding $67 million by December 2018.[320] Trump became the Republican presumptive nominee on March 17, 2020, after securing a majority of pledged delegates.[321] Trump's re-election campaign saw declining poll numbers by mid-2020, reflecting dissatisfaction with his handling of the COVID-19 pandemic and widespread racial justice protests following the killing of George Floyd.[322][323] His campaign messaging shifted to \"racist rhetoric\", described NBC News, as his campaign attempted to reclaim voters lost from his base of white conservative voters.[324][325]\n\nPresidency\n\nFor a chronological guide to this subject, see Timeline of the Donald Trump presidency\n\nEarly actions\n\nTrump was inaugurated as the 45th president of the United States on January 20, 2017. During his first week in office, he signed six executive orders: interim procedures in anticipation of repealing the Patient Protection and Affordable Care Act (Obamacare), withdrawal from the Trans-Pacific Partnership negotiations, reinstatement of the Mexico City Policy, unlocking the Keystone XL and Dakota Access Pipeline construction projects, reinforcing border security, and beginning the planning and design process to construct a wall along the U.S. border with Mexico.[326]\n\nUpon inauguration, Trump delegated the management of his real estate business to his sons Eric and Don Jr.[327] His daughter Ivanka resigned from the Trump Organization and moved to Washington, D.C., with her husband Jared Kushner. She serves as an assistant to the President,[328] and he is a Senior Advisor in the White House.[329]\n\nOn January 31, Trump nominated U.S. Appeals Court judge Neil Gorsuch to fill the seat on the Supreme Court previously held by Justice Antonin Scalia until his death on February 13, 2016.[330]\n\nDomestic policy\n\nEconomy and trade\n\nThe economic expansion that began in June 2009 continued through Trump's first three years in office.[331][332] This ended in February 2020, when the COVID-19 pandemic sparked a recession.[332] Throughout his presidency, Trump has repeatedly and falsely characterized the economy as the best in American history (at least four U.S. presidents have presided over better economies).[331]\n\nIn December 2017, Trump signed the Tax Cuts and Jobs Act of 2017, which permanently cut the corporate tax rate to 21 percent, temporarily lowered personal tax brackets until 2025, increased child tax credit, doubled the estate tax exemption to $11.2 million, and limited the state and local tax deduction to $10,000.[333]\n\nTrump speaks to automobile workers in Michigan, March 2017.\n\nTrump is a skeptic of multilateral trade deals, as he believes they indirectly incentivize unfair trade practices that then tend to go unpoliced. He favors bilateral trade deals, as they allow one party to pull out if the other party is believed to be behaving unfairly. Trump favors neutral or positive balances of trade over negative balances of trade, also known as a \"trade deficit\". Trump adopted his current skeptical views toward trade liberalization in the 1980s, and he sharply criticized NAFTA during the Republican primary campaign in 2015.[334][335][336] He withdrew the U.S. from the Trans-Pacific Partnership (TPP) negotiations,[337] imposed tariffs on steel and aluminum imports,[338] and launched a trade war with China by sharply increasing tariffs on 818 categories (worth $50 billion) of Chinese goods imported into the U.S.[339][340] On several occasions, Trump has said incorrectly that these import tariffs are paid by China into the U.S. Treasury.[341]\n\nDespite a campaign promise to eliminate the national debt in eight years, Trump as president has approved large increases in government spending, as well as the 2017 tax cut. As a result, the American government's budget deficit has increased by almost 50%, to nearly $1 trillion in 2019.[342] In 2016, the year before Trump took office, the U.S. national debt was around $19 trillion; by mid-2020, it had increased to $26 trillion under the Trump administration.[343]\n\nIn April 2020, the official unemployment rate shot up to 14.7% due to the COVID-19 pandemic. This was an underestimation of the actual unemployment rate, but still was the highest level of unemployment since 1939.[344]\n\nEnergy and climate\n\nTrump rejects the scientific consensus on climate change.[345][346] Since his election Trump has made large budget cuts to programs that research renewable energy and has rolled back Obama-era policies directed at curbing climate change.[347] In June 2017, Trump announced the withdrawal of the United States from the Paris Agreement, making the U.S. the only nation in the world to not ratify the agreement.[348] At the 2019 G7 summit, Trump skipped the sessions on climate change but said afterward during a press conference that he is an environmentalist.[349]\n\nTrump has rolled back federal regulations aimed at curbing greenhouse gas emissions, air pollution, water pollution, and the usage of toxic substances. One example is the Clean Power Plan. He relaxed environmental standards for federal infrastructure projects, while expanding permitted areas for drilling and resource extraction, such as allowing drilling in the Arctic Refuge. Trump also weakened protections for animals.[350] Trump's energy policies aimed to boost the production and exports of coal, oil, and natural gas.[351]\n\nGovernment size and deregulation\n\nTrump's early policies have favored rollback and dismantling of government regulations. He has signed 15 Congressional Review Act disapproval resolutions to allow Congress to repeal executive regulations, the second President to sign any such resolutions after the first CRA resolution was passed in 2001, and the first President to sign more than one such resolution.[352] During his first six weeks in office, he delayed, suspended or reversed ninety federal regulations.[353][354]\n\nOn January 30, 2017, Trump signed Executive Order 13771, which directed that for every new regulation administrative agencies issue \"at least two existing regulations be identified for elimination\".[355][356] Agency defenders expressed opposition to Trump's criticisms, saying the bureaucracy exists to protect people against well-organized, well-funded interest groups.[357]\n\nHealth care\n\nDuring his campaign, Trump repeatedly vowed to repeal and replace Patient Protection and Affordable Care Act (ACA or \"Obamacare\").[358] Shortly after taking office, he urged Congress to repeal and replace it. In May of that year, the House voted to repeal it.[359] His first action as president was Executive Order 13765, which increased flexibility \"to the maximum extent permitted by law\" for the Cabinet to issue waivers, deferrals, and exemptions for the law while attempting to give states more flexibility.[360] Executive Order 13813 was subsequently issued, designed to reduce regulations imposed under Obamacare by increasing competition.[361] Trump has expressed a desire to \"let Obamacare fail\", and the Trump administration has cut the ACA enrollment period in half and drastically reduced funding for advertising and other ways to encourage enrollment.[362][363][364] The 2017 tax bill effectively repealed the ACA's individual health insurance mandate in 2019,[365][366][367] and a budget bill Trump signed in 2019 repealed the Cadillac plan tax, medical device tax, and tanning tax.[368][369] As president, Trump has falsely claimed he saved the coverage of pre-existing conditions provided by ACA, while his administration declined to challenge a lawsuit that would eliminate it.[370] As a 2016 candidate, Trump promised to protect funding for Medicare and other social safety-net programs, but in January 2020 he suggested he was willing to consider cuts to such programs.[371]\n\nSocial issues\n\nTrump favored modifying the 2016 Republican platform opposing abortion, to allow for exceptions in cases of rape, incest, and circumstances endangering the health of the mother.[372] He has said he is committed to appointing \"pro-life\" justices.[373] He says he personally supports \"traditional marriage\"[374] but considers the nationwide legality of same-sex marriage a \"settled\" issue.[373] Despite the statement by Trump and the White House saying they would keep in place a 2014 executive order from the Obama administration which created federal workplace protections for LGBT people,[375] in March 2017, the Trump administration rolled back key components of the Obama administration's workplace protections for LGBT people.[376]\n\nTrump supports a broad interpretation of the Second Amendment and says he is opposed to gun control in general,[377][378] although his views have shifted over time.[379] Trump opposes legalizing recreational marijuana but supports legalizing medical marijuana.[380] He favors capital punishment,[381][382] as well as the use of waterboarding and \"a hell of a lot worse\" methods.[383][384]\n\nPardons and commutations\n\nIn August 2017, Trump pardoned former sheriff Joe Arpaio, who was awaiting sentencing for contempt of court in a class action that alleged racial profiling.[385][386] In March 2018, he pardoned former Navy sailor Kristian Saucier, who had been found guilty of taking classified photographs of a submarine.[387] In April 2018 he pardoned Scooter Libby, a political aide to former Vice President Dick Cheney, who had been convicted of obstruction of justice, perjury and making false statements to the FBI.[388] In May 2018 he granted a posthumous pardon to Jack Johnson, a black boxer who had been convicted in 1913 for traveling across state lines with his white girlfriend.[389][390] In June 2018 he pardoned conservative commentator Dinesh D'Souza, who had made illegal political campaign contributions.[391] That month he also commuted the life sentence of Alice Marie Johnson, a non-violent drug trafficking offender, following a request by celebrity Kim Kardashian.[392] In February 2020, Trump pardoned white-collar criminals Michael Milken, Bernard Kerik, and Edward J. DeBartolo Jr., and commuted former Illinois governor Rod Blagojevich's 14-year corruption sentence.[393][394]\n\nIn July 2020, Trump commuted the 40-month prison sentence for his friend and adviser Roger Stone, who had been soon due to report to jail for his actions during the investigation into Russian interference in the 2016 presidential elections. The sentencing judge had previously described that Stone was \"prosecuted for covering up for the president\" – Trump himself. A month before the commutation, Trump had declared that Stone \"can sleep well at night!\"[395]\n\nImmigration\n\nTrump's proposed immigration policies were a topic of bitter and contentious debate during the campaign. He promised to build a more substantial wall on the Mexico–United States border to keep out illegal immigrants and vowed Mexico would pay for it.[396] He pledged to massively deport illegal immigrants residing in the United States,[397] and criticized birthright citizenship for creating \"anchor babies\".[398] He said deportation would focus on criminals, visa overstays, and security threats.[399] As president, he frequently described illegal immigration as an \"invasion\" and conflated immigrants with the gang MS-13, though research shows undocumented immigrants have a lower crime rate than native-born Americans.[400]\n\nTrump has attempted to drastically escalate immigration enforcement.[401] Some of the results are harsher immigration enforcement policies against asylum seekers from Central America than any modern U.S. president before him, and a significantly increased usage of migrant detentions and deportations.[402][403] This was accompanied by the Trump administration's mandating in 2018 that immigration judges must complete 700 cases a year to be evaluated as performing satisfactorily.[404]\n\nIn other immigration policies, Trump has from 2018 onwards deployed nearly 6,000 troops to the U.S. Mexico border,[405] in 2019 was allowed by the Supreme Court to stop most Central American migrants from seeking U.S. asylum,[406] and from 2020 used the public charge rule to restrict immigrants using government benefits from getting permanent residency via green cards.[407][408] Trump has continually reduced the number of allowed refugees into the country; when Trump took office the annual limit was 110,000, in 2019 Trump set a limit of 18,000, a record low for the U.S. refugee program.[409] Additional restrictions implemented by the Trump administration caused (potentially long-lasting) bottlenecks in processing refugee applications, resulting in fewer refugees accepted compared to the allowed limits.[410]\n\nTravel ban\n\nFollowing the November 2015 Paris attacks, Trump made a controversial proposal to ban Muslim foreigners from entering the United States until stronger vetting systems could be implemented.[411][412][413] He later reframed the proposed ban to apply to countries with a \"proven history of terrorism\".[414][415][416]\n\nOn January 27, 2017, Trump signed Executive Order 13769, which suspended admission of refugees for 120 days and denied entry to citizens of Iraq, Iran, Libya, Somalia, Sudan, Syria, and Yemen for 90 days, citing security concerns. The order took effect immediately and without warning.[417] Confusion and protests caused chaos at airports.[418][419] Sally Yates, the acting Attorney General, directed Justice Department lawyers not to defend the executive order, which she deemed unenforceable and unconstitutional;[420] Trump immediately dismissed her.[421] Multiple legal challenges were filed against the order, and on February 5 a federal judge in Seattle blocked its implementation nationwide.[422][423] On March 6, Trump issued a revised order, which excluded Iraq, gave specific exemptions for permanent residents, and removed priorities for Christian minorities.[424][417] Again federal judges in three states blocked its implementation.[425] On June 26, 2017, the Supreme Court ruled that the ban could be enforced on visitors who lack a \"credible claim of a bona fide relationship with a person or entity in the United States\".[426]\n\nThe temporary order was replaced by Presidential Proclamation 9645 on September 24, 2017, which permanently restricts travel from the originally targeted countries except Iraq and Sudan, and further bans travelers from North Korea and Chad, along with certain Venezuelan officials.[427] After lower courts partially blocked the new restrictions, the Supreme Court allowed the September version to go into full effect on December 4, 2017,[428] and ultimately upheld the travel ban in a June 2019 ruling.[429]\n\nFamily separation at border\n\nThe Trump administration has separated more than 5,400 migrant children from their parents at the U.S.–Mexico border while the families attempted to enter the U.S.[430] The Trump administration sharply increased the number of family separations at the border starting from the summer of 2017, before an official policy was announced in 2018; this was only publicly reported later in January 2019.[431][432]\n\nIn April 2018, the Trump administration announced and enacted a \"zero tolerance\" immigration policy, whereby every adult illegally crossing the border would be criminally prosecuted.[433] This resulted in family separations, as the migrant adults were put in criminal detention for prosecution, while the migrant children were taken away as unaccompanied alien minors.[434] The children would be brought to immigration detention, immigrant shelters, tent camps, or metal cages, with the stated aim of releasing them to relatives or sponsors.[435] Administration officials described the policy as a deterrent against illegal immigration.[435] Previous administrations had no such policy of generally separating migrant families with children.[435]\n\nThe policy of family separations sparked public outrage,[436] and resulted in demands from Democrats, Republicans, Trump allies, and religious groups that the policy be rescinded.[437] Trump reacted by falsely asserting that his administration was merely following the law, blaming Democrats, when in fact this was his administration's policy.[438][439][440] More than 2,300 children were separated as a result of the \"zero tolerance policy\", the Trump administration revealed in June 2018.[435]\n\nAlthough Trump originally argued that the issue could not be solved via executive order, he proceeded to sign an executive order on June 20, 2018, mandating that migrant families be detained together, unless the administration judged that doing so would harm the child.[441][442] On June 26, 2018, a federal judge concluded that the Trump administration had \"no system in place to keep track of\" the separated children, nor any effective measures for family communication and reunification;[443] the judge ordered for the families to be reunited, and family separations stopped, except in the cases where the parent(s) are judged unfit to take care of the child, or if there is parental approval.[444]\n\n4,370 children were separated from July 2017 to June 2018, reported the Trump administration in October 2019.[430] Even after the June 2018 federal judge order, the Trump administration continued to practice family separations, with more than a thousand migrant children separated.[430]\n\nMigrant detentions\n\n[445] Overcrowded conditions for migrant families detained in Weslaco, Texas were reported by inspectors from the federal government in June 2019.\n\nThe Trump administration has taken a harsher approach than previous administrations regarding migrant detentions, by allowing no exemptions for detention unlike the George W. Bush and Obama administrations.[446] While the Obama administration already employed a high level of detentions and deportations for migrants, the Trump administration took it to a significantly higher level.[403] In April 2018, Trump ordered an end to the \"catch and release\" policy which released illegal immigrants from detention pending a court hearing.[433]\n\nGovernment inspectors from the Department of Homeland Security Office of Inspector General conducted spot-checks of migrant detention centers in June 2018, finding that U.S. Customs and Border Protection \"in many instances\" violated federal guidelines for detaining migrant children for too long before passing them to the Office of Refugee Resettlement.[447] Meanwhile, Commissioner of U.S. Customs and Border Protection Kevin McAleenan said in March 2019 there was a \"border security and a humanitarian crisis\", with the system for handling migrants already at a \"breaking point\" due to an increase in migrants.[448] The government inspectors released further reports in May 2019 and July 2019 of migrants being detained under conditions failing federal standards. They reported migrants enduring prolonged detention, \"dangerous overcrowding\", poor hygiene and food standards.[449][450] In June 2019 and July 2019, lawyers, a certified doctor, and lawmakers visited the migrant detention facilities, reporting a lack of supervision, traumatized children, and many sick migrants respectively.[451][452][453]\n\nThe treatment of the detained migrants resulted in public indignation by July 2019.[454] Also that month, Trump reacted to criticism of the migrant detentions by declaring that U.S. Border Patrol was doing a \"great job\", and if the migrants were unhappy about the conditions of the detention facilities, \"just tell them not to come\".[455] Meanwhile, Vice President Pence visited an overcrowded facility, where he reacted by saying \"this is tough stuff\" and the system is \"overwhelmed\".[456]\n\nIn August 2019, the administration attempted to change the 1997 Flores Agreement that limits detention of migrant families to 20 days; the new policy allowing indefinite detention was blocked before it would go into effect.[457]\n\n2018–2019 federal government shutdown\n\nOn December 22, 2018, the federal government was partially shut down after Trump declared that any funding extension must include $5.6 billion in federal funds for a U.S.–Mexico border wall to partly fulfill his campaign promise.[458] The shutdown was caused by a lapse in funding for nine federal departments, affecting about one-fourth of federal government activities.[459] Trump said he would not accept any bill that did not include funding for the wall, and Democrats, who control the House, said they would not support any bill that does. Senate Republicans have said they will not advance any legislation Trump would not sign.[460] In earlier negotiations with Democratic leaders, Trump commented that he would be \"proud to shut down the government for border security\".[461]\n\nThe shutdown caused an estimated 380,000 government employees to be furloughed, while an estimated 420,000 government employees worked without getting paid; most of the affected workers missed two paychecks.[462] The shutdown resulted in a permanent loss of $3 billion to the U.S. economy, estimated the Congressional Budget Office.[463] A plurality of Americans blamed Trump for the shutdown, polls showed; the percentage increased as the shutdown continued, to around 50%. Trump's approval ratings also dropped.[464]\n\nOn January 25, 2019, the Senate and the House unanimously approved a temporary funding bill that provided no funds for the wall but would provide delayed paychecks to government workers. Trump signed the bill that day, ending the shutdown at 35 days. It was the longest U.S. government shutdown in history.[465][466]\n\nSince the government funding was temporary, another shutdown loomed. On February 14, 2019, the Senate and the House approved a funding bill that included $1.375 billion for 55 miles of border fences, in lieu of Trump's intended wall.[467] Trump signed the bill on February 15, 2019, just hours before another shutdown would begin.[468]\n\nNational emergency regarding the southern border\n\nOn February 15, 2019, after Trump received from Congress only $1.375 billion for border fencing after demanding $5.7 billion for the Trump wall, Trump declared a National Emergency Concerning the Southern Border of the United States, in the hopes of getting another $6.7 billion of funds for the Trump wall without congressional approval, using funds for military construction, drug interdiction, and money from the Treasury.[468] In doing so, Trump acknowledged that he \"didn't need to\" declare a national emergency, but he \"would rather do it much faster\".[468]\n\nCongress twice passed resolutions to block Trump's national emergency declarations, but Trump twice vetoed them, and Congress did not have enough votes override Trump's veto.[469][470][471] Trump's decision to divert other government funding to fund the wall resulted in legal challenges. In July 2019, the Supreme Court allowed Trump to use $2.5 billion (originally meant for anti-drug programs) from the Department of Defense to build the Trump wall.[472][473] In December 2019, a federal judge stopped the Trump administration from using $3.6 billion of military construction funds for the Trump wall.[473]\n\nTrump wall\n\nAs a presidential candidate, Trump insisted that along the southern border he would build a wall – not a fence – saying there is a \"big difference\"[474] and mentioning \"concrete going very high\". In January 2018 he again floated the idea of solid concrete.[475]\n\nIn 2017, the Mexico-U.S. border had 654 miles of primary fencing, 37 miles of secondary fencing and 14 miles of tertiary fencing.[476] Trump's target, from 2015 to 2017, was 1,000 miles of wall.[477] The Trump administration set a target of 450 miles of new or renovated barriers by December 2020, with an ultimate goal of 509 miles of new or renovated barriers by August 2021.[478] Even into 2020, Trump has repeatedly provided false assertions that Mexico is paying for the Trump wall, although American taxpayers are footing the bill from funds being diverted from the U.S. Department of Defense.[479]\n\nIn October 2018, the administration revealed two miles of replacement fences made of steel posts, which it called the first section of Trump's 'wall', although earlier that year Border Patrol had said the project was unrelated to the Trump wall and had been long planned (dating to 2009).[480][481] In December 2018 and January 2019, Trump tweeted out a design of a steel fence, and a picture of a fence, while declaring \"the wall is coming\".[477] In February 2019, Trump said his administration had been \"restricted to renovating\" existing barriers, \"and we need new wall\".[482]\n\nBy November 2019, the Trump administration had replaced around 78 miles of the Mexico–United States barrier along the border; these replacement barriers were not walls, but fences made of bollards.[483][484] The administration in November 2019 said it had \"just started breaking ground\" to build new barriers in areas where no structure existed.[483] By May 2020, the Trump administration had replaced 172 miles of dilapidated or outdated design barriers, and constructed 15 miles of new border barriers.[485]\n\nForeign policy\n\nTrump has been described as a non-interventionist[486][487] and an American nationalist.[488] He has repeatedly said he supports an \"America First\" foreign policy.[489] He supports increasing United States military defense spending,[488] but favors decreasing United States spending on NATO and in the Pacific region.[490] He says America should look inward, stop \"nation building\", and re-orient its resources toward domestic needs.[487]\n\nHis foreign policy has been marked by repeated praise and support of neo-nationalist and authoritarian strongmen and criticism of democratically-led governments.[491] Trump has cited China's president Xi Jinping,[492] Philippines president Rodrigo Duterte,[493] Egyptian president Abdel Fattah el-Sisi,[494] Turkey's president Tayyip Erdoğan,[495] King Salman of Saudi Arabia,[496] Italy's prime minister Giuseppe Conte,[497] Brazil's president Jair Bolsonaro,[498] Indian prime minister Narendra Modi,[499] and Hungarian prime minister Viktor Orbán as examples of good leaders.[500] Trump has also praised Poland under the EU-skeptic, anti-immigrant Law and Justice party (PiS) as a defender of Western civilization.[501][502]\n\nISIS, Syria, and Afghanistan\n\nIn April 2017, Trump ordered a missile strike against a Syrian airfield in retaliation for the Khan Shaykhun chemical attack.[503] According to investigative journalist Bob Woodward, Trump had ordered his defense secretary James Mattis to assassinate Syrian president Bashar al-Assad after the chemical attack, but Mattis declined; Trump denied doing so.[504] In April 2018, he announced missile strikes against Assad's regime, following a suspected chemical attack near Damascus.[505]\n\nIn December 2018, Trump declared \"we have won against ISIS,\" and ordered the withdrawal of all troops from Syria, contradicting Department of Defense assessments.[506][507][508] Mattis resigned the next day over disagreements in foreign policy, calling this decision an abandonment of Kurd allies who had played a key role in fighting ISIS.[509] One week after his announcement, Trump said he would not approve any extension of the American deployment in Syria.[510] On January 6, 2019, national security advisor John Bolton announced America would remain in Syria until ISIS is eradicated and Turkey guarantees it will not strike America's Kurdish allies.[511]\n\nTrump actively supported the Saudi Arabian-led intervention in Yemen against the Houthis and signed a $110 billion agreement to sell arms to Saudi Arabia.[512][513][514] Trump also praised his relationship with Saudi Arabia's powerful Crown Prince Mohammad bin Salman.[512]\n\nU.S. troop numbers in Afghanistan increased from 8,500 to 14,000, as of January 2017 ,[515] reversing his pre-election position critical of further involvement in Afghanistan.[516] U.S. officials said then that they aimed to \"force the Taliban to negotiate a political settlement\"; in January 2018, however, Trump spoke against talks with the Taliban.[517] On February 29, 2020, the Trump administration signed a conditional peace agreement with the Taliban,[518] which calls for the withdrawal of foreign troops in 14 months if the Taliban uphold the terms of the agreement.[519] Trump said \"it is time\" to bring U.S. soldiers home from Afghanistan.[520]\n\nTrump with Turkish president Erdoğan in November 2019\n\nIn October 2019, after Trump spoke to Turkish president Recep Tayyip Erdoğan, the White House acknowledged Turkey would be carrying out a planned military offensive into northern Syria; as such, U.S. troops in northern Syria were withdrawn from the area to avoid interference with that operation. The statement also passed responsibility for the area's captured ISIS fighters to Turkey.[521] In the following days, Trump suggested the Kurds intentionally released ISIS prisoners in order to gain sympathy, suggested they were fighting only for their own financial interests, suggested some of them were worse than ISIS, and termed them \"no angels\".[522]\n\nCongress members of both parties denounced the move, including Republican allies of Trump such as Senator Lindsey Graham. They argued that the move betrayed the American-allied Kurds, and would benefit ISIS, Turkey, Russia, Iran, and Bashar al-Assad's Syrian regime.[523] Trump defended the move, citing the high cost of supporting the Kurds, and the lack of support from the Kurds in past U.S. wars.[524][525] After the U.S. pullout, Turkey proceeded to attack Kurdish-controlled areas in northeastern Syria.[526] On October 16, the United States House of Representatives, in a rare bipartisan vote of 354 to 60, \"condemned\" Trump's withdrawal of U.S. troops from Syria for \"abandoning U.S. allies, undermining the struggle against ISIS, and spurring a humanitarian catastrophe\".[527][528]\n\nIn November 2019, Trump ordered U.S. troops to secure the oil fields in eastern Syria, then said any remaining U.S. troops in Syria were there \"only for the oil\", and that the U.S. was \"keeping the oil\". Seizing oil without local government permission would be a war crime of pillage.[529][530]\n\nIran\n\nDemonstrations in Iran over the death of Qasem Soleimani during the U.S attack on the Baghdad airport in Iraq on January 3, 2020\n\nTrump has described the regime in Iran as \"the rogue regime\", although he has also asserted he does not seek regime change.[531][532] He has repeatedly criticized the Joint Comprehensive Plan of Action (JCPOA or \"Iran nuclear deal\") that was negotiated with the United States, Iran, and five other world powers in 2015, calling it \"terrible\" and saying the Obama administration had negotiated the agreement \"from desperation\".[533][534][535]\n\nFollowing Iran's missile tests on January 29, 2017, the Trump administration imposed sanctions on 25 Iranian individuals and entities in February 2017.[536][537][538] Trump reportedly lobbied \"dozens\" of European officials against doing business with Iran during the May 2017 Brussels summit; this likely violated the terms of the JCPOA, under which the U.S. may not pursue \"any policy specifically intended to directly and adversely affect the normalization of trade and economic relations with Iran\". The Trump administration certified in July 2017 that Iran had upheld its end of the agreement.[539] On August 2, 2017, Trump signed into law the Countering America's Adversaries Through Sanctions Act (CAATSA) that grouped together sanctions against Iran, Russia, and North Korea.[540] On May 18, 2018, Trump announced the United States' unilateral departure from the JCPOA.[534]\n\nIn May 2017, strained relations between the U.S. and Iran escalated when Trump deployed military bombers and a carrier group to the Persian Gulf. Trump hinted at war on social media, provoking a response from Iran for what Iranian foreign minister Javad Zarif called \"genocidal taunts\".[541][542][543] Trump and Saudi Crown Prince Mohammad bin Salman are allies in the conflict with Iran.[544] Trump approved the deployment of additional U.S. troops to Saudi Arabia and the United Arab Emirates following the attack on Saudi oil facilities which the United States has blamed on Iran.[545]\n\nOn January 2, 2020, Trump ordered a targeted U.S. airstrike, which killed Iranian Major General and IRGC Quds Force commander Qasem Soleimani and Iraqi Popular Mobilization Forces commander Abu Mahdi al-Muhandis, as well as eight other people.[546] Trump publicly threatened to attack Iranian cultural sites, or react \"in a disproportionate manner\" if Iran retaliated; though such attacks by the U.S. would violate international law as war crimes.[547] On January 8, Iran retaliated by launching airstrikes on Al Asad Air Base in Iraq; initially the Trump administration claimed no Americans suffered injuries, then Trump said injuries were not \"very serious\", but by February 2020, more than a hundred traumatic brain injuries were diagnosed in U.S. troops.[548] Iran issues an arrest warrant for 36 U.S. political and military officials, including President Trump, for their role in the assassination of Qasem Soleimani.[549]\n\nIsrael\n\nTrump has supported the policies of Israeli Prime Minister Benjamin Netanyahu.[550] He officially recognized Jerusalem as the capital of Israel on December 6, 2017, despite criticism and warnings from world leaders. He subsequently opened a new U.S. embassy in Jerusalem in May 2018.[551][552] The United Nations General Assembly condemned the move, adopting a resolution that \"calls upon all States to refrain from the establishment of diplomatic missions in the Holy City of Jerusalem\".[553][554] In March 2019, Trump reversed decades of U.S. policy by recognizing Israel's annexation of the Golan Heights,[555] a move condemned by the European Union and the Arab League.[556]\n\nChina\n\nBefore and during his presidency, Trump has repeatedly accused China of taking unfair advantage of the U.S.[557] During his presidency, Trump has launched a trade war against China, sanctioned Huawei for its alleged ties to Iran,[558] significantly increased visa restrictions on Chinese nationality students and scholars[559][560] and classified China as a \"currency manipulator\".[561] In the wake of the significant deterioration of relations, many political observers have warned against a new cold war between China and the U.S.[562][563][564]\n\nTrump said he resisted punishing China for its human rights abuses against ethnic minorities in the northwestern Xinjiang region for fear of jeopardizing U.S.-China trade negotiations.[565] On July 9, 2020, Trump imposed sanctions and visa restrictions against senior Chinese officials, including Chen Quanguo,[566] a member of China's powerful Politburo of the Communist Party, who expanded mass detention camps holding more than a million members of the country's Uyghur Muslim minority.[567]\n\nNorth Korea\n\nIn 2017, North Korea's nuclear weapons became increasingly seen as a serious threat to the United States.[568] In August 2017, Trump escalated his rhetoric, warning that North Korean threats would be met with \"fire and fury like the world has never seen\".[569] North Korea responded by releasing plans for missile tests that would land near Guam.[570] In September 2017, Trump addressed the United Nations General Assembly, saying the U.S. would \"totally destroy North Korea\" if \"forced\" to defend itself or its allies.[571] Also in September 2017, Trump increased sanctions on North Korea, declared that he wanted North Korea's \"complete denuclearization\", and engaged in name-calling with leader Kim Jong-un.[569][572]\n\nIn March 2018, Trump immediately agreed to Kim's proposal for a meeting.[573] On June 12, 2018, Trump and Kim met in Singapore, with Kim affirming his intention \"to work toward complete denuclearization of the Korean Peninsula\".[574]\n\nA second Trump–Kim summit in Hanoi in February 2019, was terminated abruptly without an agreement; both countries blamed each other and offered differing accounts of the negotiations.[575] On June 30, 2019, Trump, Kim, and South Korean President Moon Jae-in held brief talks in the Korean Demilitarized Zone, marking the first time a sitting U.S. president had set foot on North Korean soil. Trump and Kim agreed to resume negotiations.[576] Bilateral talks began in Stockholm in October 2019, but broke down after one day.[577] As of May 2020, North Korea has shown no indication that it is willing to unilaterally denuclearize.[578]\n\nRussia\n\nDuring his campaign and as president, Trump has repeatedly asserted that he desires better relations with Russia.[579][580] He also said Russia could help the U.S. in its fight against ISIS.[581] According to Putin and some political experts and diplomats, the U.S.–Russian relations, which were already at the lowest level since the end of the Cold War, have further deteriorated since Trump took office in January 2017.[582][583][584]\n\nAs president, Trump has criticized Russia about Syria,[585] Ukraine,[586] North Korea,[587] Venezuela,[588] and the Skripal poisoning,[589] but has sent mixed messages regarding Crimea.[590][591][592] He forbade U.S. oil companies from drilling in Russia.[593] Businesses involved in the Nord Stream 2 gas pipeline from Russia to Germany have been sanctioned by the Trump administration with the passing of the National Defense Authorization Act for Fiscal Year 2020 on December 20, 2019.[594] Trump said the Nord Stream 2 pipeline, owned by Russia's Gazprom, could turn Germany into a \"hostage of Russia\".[595]\n\nAmidst continuing growth of China's missile forces, President Trump announced on 20 October 2018 that he was withdrawing the U.S. from the Intermediate-Range Nuclear Forces Treaty due to supposed Russian non-compliance,[596] a move criticized by the former Soviet President Mikhail Gorbachev, who signed the treaty in 1987 with U.S. President Ronald Reagan.[597]\n\nTrump has repeatedly praised Russian president Vladimir Putin; criticism of Putin by Trump was uncommon.[598][585] As a presidential candidate, Trump continually reiterated that Putin is a strong leader.[599] When Putin in August 2017 expelled over half of the staff of the American embassy in Russia in retaliation for Sanctions Act (CAATSA),[600] which imposed new sanctions on Russia, President Trump responded by thanking Putin, saying \"We'll save a lot of money\", instead of criticizing him.[598] After Trump met Putin at the Helsinki Summit on July 16, 2018, Trump drew bipartisan criticism for siding with Putin's denial of Russian interference in the 2016 presidential election, rather than accepting the findings of the United States intelligence community.[601][602][603]\n\nCuba\n\nIn November 2017, the Trump administration tightened the rules on trade with Cuba and individual visits to the country, undoing the Obama administration's loosening of restrictions. According to an administration official, the new rules were intended to hinder trade with businesses with ties to the Cuban military, intelligence and security services.[604]\n\nVenezuela\n\nTrump with Venezuela 's opposition leader and interim president, Juan Guaidó , at the White House, February 2020\n\nOn August 11, 2017, Trump said he is \"not going to rule out a military option\" to confront the government of Nicolás Maduro.[605] In September 2018, Trump called for \"the restoration of democracy in Venezuela\" and said that \"socialism has bankrupted the oil-rich nation and driven its people into abject poverty.\"[606] On January 23, 2019, Maduro announced that Venezuela was breaking ties with the United States following Trump's announcement of recognizing Juan Guaidó, the Venezuelan opposition leader, as the interim president of Venezuela.[607]\n\nNATO\n\nTrump and NATO Secretary General Jens Stoltenberg , April 2017\n\nAs a candidate, Trump questioned whether he, as president, would automatically extend security guarantees to NATO members,[608] and suggested he might leave NATO unless changes are made to the alliance.[609] As president, he reaffirmed the U.S. commitment to NATO in March 2017;[610] however, he has repeatedly accused fellow NATO members of paying less than their fair share of the expenses of the alliance.[611]\n\nIn January 2019, The New York Times quoted senior administration officials as saying Trump has privately suggested on multiple occasions that the United States should withdraw from NATO.[612] The next day Trump said the United States is going to \"be with NATO one hundred percent\" but repeated that the other countries have to \"step up\" and pay more.[613]\n\nPersonnel\n\nCabinet meeting, March 2017\n\nThe Trump administration has been characterized by high turnover, particularly among White House staff. By the end of Trump's first year in office, 34 percent of his original staff had resigned, been fired, or been reassigned.[614] As of early July 2018 , 61 percent of Trump's senior aides had left[615] and 141 staffers had left in the past year.[616] Both figures set a record for recent presidents – more change in the first 13 months than his four immediate predecessors saw in their first two years.[617] Notable early departures included National Security Advisor Michael Flynn (after just 25 days in office), Chief of Staff Reince Priebus, replaced by retired Marine general John F. Kelly on July 28, 2017,[618] and Press Secretary Sean Spicer.[617] Close personal aides to Trump such as Steve Bannon, Hope Hicks, John McEntee and Keith Schiller, have quit or been forced out.[619] Some, like Hicks and McEntee, later returned to the White House in different posts.[620] Trump has disparaged several of his former top officials as incompetent, stupid, or crazy.[621]\n\nTrump's cabinet nominations included U.S. senator from Alabama Jeff Sessions as Attorney General,[622] financier Steve Mnuchin as Secretary of the Treasury,[623] retired Marine Corps general James Mattis as Secretary of Defense,[624] and ExxonMobil CEO Rex Tillerson as Secretary of State.[625] Trump also brought on board politicians who had opposed him during the presidential campaign, such as neurosurgeon Ben Carson as Secretary of Housing and Urban Development,[626] and South Carolina governor Nikki Haley as Ambassador to the United Nations.[627]\n\nTwo of Trump's 15 original cabinet members were gone within 15 months: Health and Human Services Secretary Tom Price was forced to resign in September 2017 due to excessive use of private charter jets and military aircraft, and Trump replaced Secretary of State Rex Tillerson with Mike Pompeo in March 2018 over disagreements on foreign policy.[628][619] EPA Administrator Scott Pruitt resigned in July 2018 amidst multiple investigations into his conduct,[629] while Interior Secretary Ryan Zinke resigned five months later as he also faced multiple investigations.[630]\n\nTrump has been slow to appoint second-tier officials in the executive branch, saying many of the positions are unnecessary. In October 2017, there were still hundreds of sub-cabinet positions without a nominee.[631] By January 8, 2019, of 706 key positions, 433 had been filled (61%) and Trump had no nominee for 264 (37%).[632]\n\nDismissal of James Comey\n\nOn May 9, 2017, Trump dismissed FBI director James Comey. He first attributed this action to recommendations from Attorney General Jeff Sessions and Deputy AG Rod Rosenstein,[633] which criticized Comey's conduct in the investigation about Hillary Clinton's emails.[634] On May 11, Trump said he was concerned with the ongoing \"Russia thing\"[635] and that he had intended to fire Comey earlier, regardless of DOJ advice.[636]\n\nAccording to a Comey memo of a private conversation on February 14, 2017, Trump said he \"hoped\" Comey would drop the investigation into National Security Advisor Michael Flynn.[637] In March and April, Trump had told Comey the ongoing suspicions formed a \"cloud\" impairing his presidency,[638] and asked him to publicly state that he was not personally under investigation.[639] He also asked intelligence chiefs Dan Coats and Michael Rogers to issue statements saying there was no evidence that his campaign colluded with Russia during the 2016 election.[640] Both refused, considering this an inappropriate request, although not illegal.[641] Comey eventually testified on June 8 that, while he was director, the FBI investigations had not targeted Trump himself.[638][642]\n\nCOVID-19 pandemic\n\nIn December 2019, an outbreak of coronavirus disease 2019 (COVID-19) was first identified in Wuhan, Hubei, China, spreading worldwide within weeks.[643][644] The first confirmed case in the United States was reported on January 20, 2020.[645] On January 31, Health and Human Services Secretary Alex Azar announced a partial ban on non-Americans traveling to the U.S. from China, effective February 2.[646]\n\nTrump was slow to address the pandemic, initially dismissing the imminent threat and ignoring calls for action from government health experts and Secretary Azar.[647][648] Throughout January and February, he rejected persistent public health warnings from officials within his administration, focusing instead on economic and political considerations of the outbreak.[649][648] He continued to claim that a vaccine was months away, although HHS and CDC officials had repeatedly told him it would take 12–18 months to develop a vaccine.[650][651] Trump also exaggerated the availability of testing for the virus, falsely claiming \"anybody that wants a test can get a test,\" despite the availability of tests being severely limited.[652][653]\n\nOn March 6, Trump signed the Coronavirus Preparedness and Response Supplemental Appropriations Act into law, which provided $8.3 billion in emergency funding for federal agencies.[654] On March 11, he announced partial travel restrictions for most of Europe, effective March 13.[655] That same day, he gave his first serious assessment of the virus (\"horrible\") in a nationwide Oval Office address; he also said the outbreak was \"a temporary moment\" and that there was no financial crisis.[656] On March 13, he declared a national emergency, freeing up federal resources.[657][658][659] In a March 16 press conference, Trump acknowledged for the first time the pandemic was \"not under control\", the situation was \"bad\", and that months of disruption to daily lives and a recession might occur.[660]\n\nWhite House coronavirus update briefing, May 11, 2020\n\nBeginning in mid-March, Trump held a daily press conference, joined by medical experts and other administration officials,[661] sometimes disagreeing with them by promoting unproven treatments.[662] Trump was the main speaker at the briefings, where he praised his own response to the pandemic, frequently criticized rival presidential candidate Joe Biden, and denounced members of the White House press corps.[661][663] On April 3, Trump announced that the federal government would use funds from the CARES Act to pay hospitals for treatment of uninsured patients infected with the coronavirus.[664] His repeated use of the terms \"Chinese virus\" and \"China virus\" to describe COVID-19 drew criticism from the media, health experts, the World Health Organization (WHO), and the Chinese government.[665][666][667]\n\nBy early April, as the pandemic worsened and amid criticism of his administration's response, Trump refused to admit any mistakes in his handling the outbreak, instead blaming the media, Democratic state governors, the previous administration, China, and the World Health Organization.[668] Although the allegations blaming the WHO were not substantiated, at the end of May 2020 Trump announced that the United States would terminate its relationship with that organization.[669] By mid-April 2020, some national news agencies began limiting live coverage of his daily press briefings, with The Washington Post reporting that \"propagandistic and false statements from Trump alternate with newsworthy pronouncements from members of his coronavirus task force, particularly coronavirus response coordinator Deborah Birx and National Institute of Allergy and Infectious Diseases Director Anthony S. Fauci.\"[670]\n\nOn April 22, Trump signed an executive order restricting some forms of immigration to the United States.[671] In April 2020, Republican-connected groups organized anti-lockdown protests against the measures state governments were taking to combat the pandemic;[672][673] Trump encouraged the protests on Twitter,[674] even though the targeted states did not meet the Trump administration's own guidelines for reopening.[675] He first supported, then later criticized Georgia Governor Brian Kemp's plan to reopen some nonessential businesses,[676] which was a key example of Trump often reversing his stances in his communication during the COVID-19 pandemic.[677] Throughout the spring he increasingly pushed for ending the restrictions as a way to reverse the damage to the country's economy.[678] In early July he began insisting that all states should open schools to in-person education in the fall, despite a July spike in reported cases.[679]\n\nFor months, Trump refused to wear a face mask at press conferences and most public events, contrary to his own administration's April 2020 guidance that Americans should wear masks in public.[680][681] By June, Trump had stated that masks were a \"double-edged sword\", ridiculed Biden for wearing one, continually emphasized that mask-wearing was optional, and suggested that wearing a mask is a political statement against him personally.[682] Trump first showed himself wearing a face mask in public in July 2020, at the Walter Reed National Military Medical Center, 99 days after the CDC's recommendation that Americans should do so.[681]\n\nIn September 2019, the Trump administration ended a 200-million-dollar early-warning program, PREDICT, initiated by the United States Agency for International Development in 2009;[683] dozens of epidemiologists and wildlife veterinarians working for partner organizations were laid off.[684][685][686] The program trained scientists in sixty foreign laboratories, including the Wuhan lab that first identified the SARS-CoV-2 coronavirus that causes COVID-19, to detect and respond to viruses that have the potential to cause pandemics. On April 1, 2020, USAID extended the program for six months.[687][688]\n\nThe daily coronavirus task force briefings were wound down in late April, after Trump at one of the briefings floated the idea of using bleach injections to treat COVID-19, leading to widespread condemnation by medical professionals for the idea.[689][690] In early May, President Trump proposed that the coronavirus task force should be phased out, to accommodate another group centered on reopening the economy. Amid a backlash, Trump publicly said the coronavirus task force would continue on \"indefinitely\".[691] By the end of May, the coronavirus task force's meetings were sharply reduced.[692] Despite record numbers of COVID-19 cases in the U.S. from mid-June onward and an increasing percentage of positive test results, Trump continued to mostly downplay the pandemic, including his claim in early July 2020 that 99% of COVID-19 cases are \"totally harmless\", a claim which contradicts health officials in the U.S.[693]\n\nLafayette Square protester removal and photo op\n\nExternal video on YouTube (The Washington Post) (12:12) on YouTube (NBC) (2:40) on YouTube (C-SPAN) (7:46)\n\nIn a Rose Garden speech on June 1, 2020, Trump threatened that he would deploy the U.S. military in U.S. cities and states not taking \"the actions necessary to defend the life and property of their residents\" in reaction to mass protests and civil unrest following the police killing of George Floyd.[694][695] While he was speaking, federal law enforcement officials used batons, rubber bullets, pepper spray projectiles,[696] stun grenades, and smoke to remove a largely peaceful crowd from Lafayette Square, outside the White House. The removal had been ordered by Attorney General William Barr.[696][697] Trump then walked to St. John's Episcopal Church where the night before a small fire had been set in the basement nursery of its parish house.[698] He posed for photographs holding a Bible, with Cabinet members and other officials later joining him in photos.[696][697][699] Trump, who had not attended the church since his inauguration, did not enter it or inspect the damage to the basement.[700][701]\n\nReligious leaders condemned the treatment of protesters and the photo opportunity itself.[702][701] Many retired military leaders and defense officials condemned Trump's proposal to use the U.S. military against the protesters.[701][703] The chairman of the Joint Chiefs of Staff, General Mark A. Milley, later apologized for accompanying Trump on the walk and thereby \"creat[ing] the perception of the military involved in domestic politics\".[704]\n\nPublic profile\n\nApproval ratings\n\nPolling in 2019 suggested Trump was the most unpopular president since Harry Truman.[705] At the end of his second year, his two-year average Gallup approval rating was the lowest of any president since World War II.[706] As of February 2020, his Gallup rating has ranged from a low of 35% approval to a high of 49%.[707][708] His approval and disapproval ratings have been unusually stable.[709][710]\n\nIn Gallup's end-of-year poll asking Americans to name the man they admire the most, Trump placed second to Obama in 2017 and 2018, and tied with Obama for most admired man in 2019.[711] Trump is the first elected president not to be named most admired in his first year in office.[712]\n\nSocial media\n\nTrump's presence on social media has attracted attention worldwid", "images": ["http://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Symbol_book_class2.svg/16px-Symbol_book_class2.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/a/a5/Ursula_%28detention_center%29_2.jpg/220px-Ursula_%28detention_center%29_2.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Donald_Trump_speaking_at_CPAC_2011_by_Mark_Taylor_2.jpg/220px-Donald_Trump_speaking_at_CPAC_2011_by_Mark_Taylor_2.jpg", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://upload.wikimedia.org/wikipedia/en/thumb/0/06/Wiktionary-logo-v2.svg/30px-Wiktionary-logo-v2.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/3/36/Seal_of_the_President_of_the_United_States.svg/100px-Seal_of_the_President_of_the_United_States.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/f5/Chicago_September_2016-2.jpg/170px-Chicago_September_2016-2.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/3/3a/President_Trump_Meets_with_the_President_of_Turkey_%2849060819653%29.jpg/220px-President_Trump_Meets_with_the_President_of_Turkey_%2849060819653%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/5/57/White_House_Coronavirus_Update_Briefing_%2849890718362%29.jpg/220px-White_House_Coronavirus_Update_Briefing_%2849890718362%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/0/04/2017-_Donald_Trump_veracity_-_composite_graph.png/330px-2017-_Donald_Trump_veracity_-_composite_graph.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/0/04/President_Trump%27s_First_100_Days-_45_%2833573172373%29.jpg/220px-President_Trump%27s_First_100_Days-_45_%2833573172373%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/4/46/Donald_Trump_visits_San_Diego_border_wall_prototypes.jpg/200px-Donald_Trump_visits_San_Diego_border_wall_prototypes.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/56/Donald_Trump_official_portrait.jpg/1200px-Donald_Trump_official_portrait.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/5/56/Donald_Trump_official_portrait.jpg/220px-Donald_Trump_official_portrait.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/e/e5/Donald_Trump_Laconia_Rally%2C_Laconia%2C_NH_4_by_Michael_Vadon_July_16_2015_19.jpg/220px-Donald_Trump_Laconia_Rally%2C_Laconia%2C_NH_4_by_Michael_Vadon_July_16_2015_19.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/c/c9/Women%27s_March_on_Washington_%2832593123745%29.jpg/220px-Women%27s_March_on_Washington_%2832593123745%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/88/Donald_Trump_and_Bill_Clinton.jpg/220px-Donald_Trump_and_Bill_Clinton.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/6/6d/Abdel_Fattah_el-Sisi%2C_King_Salman_of_Saudi_Arabia%2C_Melania_Trump%2C_and_Donald_Trump%2C_May_2017.jpg/220px-Abdel_Fattah_el-Sisi%2C_King_Salman_of_Saudi_Arabia%2C_Melania_Trump%2C_and_Donald_Trump%2C_May_2017.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/d/dc/President_Donald_Trump_and_Secretary_General_Jens_Stolenberg_Joint_Press_Conference%2C_April_12%2C_2017_%2801%29.jpg/220px-President_Donald_Trump_and_Secretary_General_Jens_Stolenberg_Joint_Press_Conference%2C_April_12%2C_2017_%2801%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/3/36/Seal_of_the_President_of_the_United_States.svg/70px-Seal_of_the_President_of_the_United_States.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Wikidata-logo.svg/30px-Wikidata-logo.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/e/ef/Overcrowded_Families_in_Weslaco_Station-11Jun2019-DHS_OIG.png/220px-Overcrowded_Families_in_Weslaco_Station-11Jun2019-DHS_OIG.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/5/53/Donald_Trump_official_portrait_%28cropped%29.jpg/100px-Donald_Trump_official_portrait_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/d/d8/Mar-a-lago_in_2009.jpg/220px-Mar-a-lago_in_2009.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/5/53/Donald_Trump_official_portrait_%28cropped%29.jpg/75px-Donald_Trump_official_portrait_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/2/2b/58th_Presidential_Inaugural_Ceremony_170120-D-BP749-1327.jpg/220px-58th_Presidential_Inaugural_Ceremony_170120-D-BP749-1327.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/6/64/Ursula_%28detention_center%29_1.png/220px-Ursula_%28detention_center%29_1.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/e/e9/Donald_Trump_NYMA.jpg/150px-Donald_Trump_NYMA.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/e/e4/Report_On_The_Investigation_Into_Russian_Interference_In_The_2016_Presidential_Election.pdf/page1-220px-Report_On_The_Investigation_Into_Russian_Interference_In_The_2016_Presidential_Election.pdf.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/c/ce/Demonstrations_in_Iran_over_the_death_of_Qasem_Soleimani.jpg/220px-Demonstrations_in_Iran_over_the_death_of_Qasem_Soleimani.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/7/7f/Trump_Turnberry_Hotel_-_geograph.org.uk_-_5273443.jpg/220px-Trump_Turnberry_Hotel_-_geograph.org.uk_-_5273443.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/2/24/Wikinews-logo.svg/30px-Wikinews-logo.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/25px-Wikiquote-logo.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/3/30/Ivana_Trump_shakes_hands_with_Fahd_of_Saudi_Arabia.jpg/220px-Ivana_Trump_shakes_hands_with_Fahd_of_Saudi_Arabia.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/1/14/President_Trump_Gives_a_Statement_on_the_Infrastructure_Discussion.webm/220px-seek%3D791-President_Trump_Gives_a_Statement_on_the_Infrastructure_Discussion.webm.jpg", "http://en.wikipedia.org/static/images/wikimedia-button.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/1/1d/JANUS-T%C3%AAte-%C3%A0-T%C3%AAte-_Sitting_President_%26_President-elect%2C_Barack_Obama_%26_Donald_Trump_squatting_next_to_each_other_on_arm-chairs_in_the_Oval_Office_on_November_10th_2016._%2831196987133%29.jpg/220px-thumbnail.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/7/74/Donald_Trump_and_Mike_Pence_RNC_July_2016.jpg/220px-Donald_Trump_and_Mike_Pence_RNC_July_2016.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/d/d0/President_Trump_at_the_G20_%2848144045996%29.jpg/220px-President_Trump_at_the_G20_%2848144045996%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/1/1b/Nuvola_apps_kaboodle.svg/16px-Nuvola_apps_kaboodle.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Wikisource-logo.svg/29px-Wikisource-logo.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/2/2c/Stormy_Daniels_2010.jpg/130px-Stormy_Daniels_2010.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/3/30/Trump_Tower_-_lower_part.jpg/170px-Trump_Tower_-_lower_part.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/3/33/-G7Biarritz_%2848616362963%29.jpg/220px--G7Biarritz_%2848616362963%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/a/a9/Donald_Trump_star_Hollywood_Walk_of_Fame.JPG/130px-Donald_Trump_star_Hollywood_Walk_of_Fame.JPG", "http://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/c/cd/Donald_Trump_Cabinet_meeting_2017-03-13_04.jpg/220px-Donald_Trump_Cabinet_meeting_2017-03-13_04.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/3/3f/Trump_Taj_Mahal%2C_2007.jpg/220px-Trump_Taj_Mahal%2C_2007.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/e/ec/ElectoralCollege2016.svg/330px-ElectoralCollege2016.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/fe/Donald_Trump_Signature.svg/128px-Donald_Trump_Signature.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8c/Extended-protection-shackle.svg/20px-Extended-protection-shackle.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/a/ab/Kim_and_Trump_shaking_hands_at_the_red_carpet_during_the_DPRK%E2%80%93USA_Singapore_Summit.jpg/220px-Kim_and_Trump_shaking_hands_at_the_red_carpet_during_the_DPRK%E2%80%93USA_Singapore_Summit.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/4/44/President_Trump_Signs_the_Congressional_Funding_Bill_for_Coronavirus_Response_%2849627907646%29.jpg/220px-President_Trump_Signs_the_Congressional_Funding_Bill_for_Coronavirus_Response_%2849627907646%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/7/75/Trump_Family_Hand_Up.jpg/220px-Trump_Family_Hand_Up.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/22px-Commons-logo.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/e/ec/Donald_Trump_in_Ypsilanti_%2833998674940%29_%28cropped2%29.jpg/220px-Donald_Trump_in_Ypsilanti_%2833998674940%29_%28cropped2%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/8b/President_Trump_visit_to_Israel_May_22-23%2C_2017_DSC_3982F_%2834847749905%29.jpg/220px-President_Trump_visit_to_Israel_May_22-23%2C_2017_DSC_3982F_%2834847749905%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/6/6b/Trump_AVM_opening_ceremony.jpg/220px-Trump_AVM_opening_ceremony.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/b/b8/House_of_Representatives_Votes_to_Adopt_the_Articles_of_Impeachment_Against_Donald_Trump.jpg/300px-House_of_Representatives_Votes_to_Adopt_the_Articles_of_Impeachment_Against_Donald_Trump.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/4/40/President_Trump_Visits_with_the_Interim_President_of_the_Bolivarian_Republic_of_Venezuela_to_the_White_House_%2849494079201%29.jpg/220px-President_Trump_Visits_with_the_Interim_President_of_the_Bolivarian_Republic_of_Venezuela_to_the_White_House_%2849494079201%29.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/56/Donald_Trump_official_portrait.jpg/1200px-Donald_Trump_official_portrait.jpg", "keywords": [], "authors": ["Przybyla", "Heidi", "Schecter", "Anna", "October", "Heidi M.", "Schouten", "Fredreka", "January"], "canonical_link": "https://en.wikipedia.org/wiki/Donald_Trump", "title": "Donald Trump", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.40", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/56/Donald_Trump_official_portrait.jpg/1200px-Donald_Trump_official_portrait.jpg"}}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}