{"url": "http://www.newslocker.com/en-us/news/celebrity/yikes-kyle-is-furious-after-he-loses-his-movie-to-jeremy-renner-on-the-arrangement-im-gonna-lose-my-s-t/", "text": "Justice Ruth Bader Ginsburg Hospitalized for Possible Infection Justice Ruth Bader Ginsburg has been hospitalized.\n\nThe 87-year-old Supreme Court Justice is expected to stay in the hospital for a few days to receive intravenous antibiotic treatment amid a potential infection, via a press release from the Supreme Court on Tuesday (July 14).\n\n“Justice Ginsburg was admitted to The Johns Hopkins Hospital in Baltimore, Maryland early this morning for treatment of a possible infection. She was initially evaluated at Sibley Memorial Hospital in Washington, D.C Read more\n\nPorsha Williams Arrested at Breonna Taylor Protest Porsha Williams has been arrested.\n\nThe Real Housewives of Atlanta star was arrested while protesting the killing of Breonna Taylor on Tuesday (July 14) in Louisville, Kentucky.\n\nPHOTOS: Check out the latest pics of Porsha Williams\n\nPorsha joined others outside the home of Kentucky Attorney General Daniel Cameron to protest for justice for Breonna‘s death.\n\nHer fiancé, Dennis McKinley, shared that she was arrested alongside Women’s March co-organizer Tamika D. Mallory, rapper Tra Read more\n\nJana Kramer Reveals She Auditioned for 'Real Housewives of Beverly Hills' Jana Kramer might be joining The Real Housewives of Beverly Hills!\n\nThe 36-year-old One Tree Hill actress and country singer revealed on her podcast Whine Down with Jana Kramer and Michael Caussin that she recently auditioned to join the reality show.\n\n“I was going to say something, but I wasn’t sure if I could say it,” Jana shared with guests Melissa and Joe Gorga. “We might have auditioned for a certain Housewives thing, but we haven’t heard back yet.”\n\nJana t Read more\n\nHayden Panettiere Granted Restraining Order Against Ex-Boyfriend Brian Hickerson Hayden Panettiere has obtained a restraining order against her ex-boyfriend Brian Hickerson.\n\nThe 30-year-old Nashville actress filed to register an out-of-state restraining order she recently obtained one against her ex-boyfriend, according to court documents obtained by The Blast.\n\nHayden is asking the court to enforce the terms of the protective order in Los Angeles, where she is currently living.\n\nHayden reportedly broke up with Brian last month after dating for less than two years. Back on Va Read more\n\nJim Carrey's 'Kidding' Canceled at Showtime After 2 Seasons Kidding is coming to an end.\n\nThe Jim Carrey-led comedy is ending after a two season run at Showtime, THR confirmed on Tuesday (July 14).\n\nThe second season ended in March, and left the storyline open for a third season.\n\n“After two seasons, Kidding has concluded its run on Showtime. We are very proud to have aired this imaginative, critically acclaimed and rewarding series, and we would like to thank Jim Carrey, Dave Holstein, Michael Aguilar, Michel Gondry and the entire cast and crew for Read more\n\nG-Eazy & Girlfriend Ashley Benson Grab Takeout Together in LA Ashley Benson and G-Eazy are getting food together.\n\nThe 30-year-old Pretty Little Liars actress and the 31-year-old rapper were spotted grabbing takeout together at Erewhon Market on Tuesday (July 14) in Los Angeles.\n\nPHOTOS: Check out the latest pics of Ashley Benson\n\nBoth Ashley and G-Eazy were seen wearing protective masks amid the pandemic as they made their way out together for the day.\n\nHave you listened to the new music that the couple released? Ashley is featured on a song that is part of Read more\n\nKelly Marie Tran Will Star in Hulu's 'Monsterland' Series Kelly Marie Tran is set to star in Hulu’s upcoming Monsterland anthology series.\n\nBased on the collection of stories from Nathan Ballingrud, The Hollywood Reporter states that the Star Wars actress will join Kaitlyn Dever, Taylor Schilling and Mike Colter in the show.\n\nThe series is set in a world that involves encounters with fantasy creatures like mermaids and fallen angels, and follows broken people driven to desperate acts in an attempt to repair their lives.\n\nPHOTOS: Check out the lates Read more\n\nRihanna Is Launching Her Own Skincare Line! Rihanna is continuing to take over the world.\n\nThe 32-year-old Anti superstar and Fenty Beauty entrepreneur revealed on Tuesday (July 14) that her new skincare line, Fenty Skin, will be launching on July 31.\n\nPHOTOS: Check out the latest pics of Rihanna\n\nRihanna made the exciting announcement in a short video teaser, showing herself applying several skincare products, including what appears to be serum, a foam cleanser and sunscreen. There’s also brief teases of the packaging for the collect Read more\n\nLynne Spears Files to Be Included in Decisions About Britney Spears' Finances Britney Spears‘ mother, Lynne Spears, is requesting to be included in decisions made about her finances.\n\nThe 65-year-old mother of the 38-year-old Glory pop superstar filed legal documents obtained by The Blast on Tuesday (July 14) with the Los Angeles County Courts to be included in any “special notice” of “all matters” having to do with Britney‘s trust.\n\nPHOTOS: Check out the latest pics of Britney Spears\n\nBritney filed the “SJB Revocable Trust” i Read more\n\nNaya Rivera's Family Issues a Statement Following Her Tragic Death Naya Rivera‘s family is speaking out following the horrific confirmation of the Glee alum’s drowning while out boating with her son, Josey.\n\nHer family, who was also seen gathering at Lake Piru amid the recovery efforts, issued a statement for the first time on Tuesday evening (July 14).\n\nThe statement was given to Deadline by her manager, Gladyz Gonzalez, on behalf of her family.\n\nIt reads as follows…\n\n“We are so grateful for the outpouring of love and prayers for Naya, Jo Read more\n\nJames Roday Changes His Name To James Roday Rodriguez To Honor His Latino Heritage James Roday is going back to his roots and will now be professionally known as James Roday Rodriguez.\n\nThe 44-year-old actor, who you’ve seen in Psych and A Million Little Things, is opening up about his decision to reclaim his birth name from this point on.\n\nIn an interview with TV Line, James went in depth about why he changed his name in the first place, where Roday actually came from, and why he’s changing it now.\n\nHe recalled that when he started to audition for acting roles while Read more\n\nLeonardo DiCaprio & Girlfriend Camila Morrone Drop Off a Guitar Leonardo DiCaprio and Camila Morrone are running some errands together.\n\nThe couple was spotted dropping off a guitar together on Tuesday (July 14) in Tarzana, Calif.\n\nPHOTOS: Check out the latest pics of Leonardo DiCaprio\n\nLeo was seen waiting in the car as Camila carried the guitar into Norman’s Rare Guitars wearing a protective face mask amid the pandemic.\n\nHe was also seen wearing a mask over his face while going for a walk over Fourth of July weekend in Malibu, Calif.\n\nLast month, Leo hel Read more\n\nChord Overstreet, Melissa Benoist & Jacob Artist Remember Naya Rivera In Touching Tributes Three more of Naya Rivera‘s Glee co-stars have spoken out with tributes after she died in a drowning accident last week.\n\nChord Overstreet spoke highly of his time with Naya on his Instagram page, alongside a stunning image of the late actress.\n\n“I still remember the day I met you,” he writes. “You walked straight up to me, grabbed me by the face and drug me around until I met every single person on set, introducing me as ‘new booty’. You were one of the first Read more\n\nShawn Mendes' Foundation Co-Launches Global Citizen Academy, Providing $250,000 in Need-Based Scholarships Shawn Mendes foundation, The Shawn Mendes Foundation, is doing something wonderful.\n\nThe 21-year-old aims to “inspire and empower fans and today’s youth to bring positive change in the world and advocate for causes they care about” by partnering with Global Citizen for the Global Citizen Academy.\n\nPHOTOS: Check out the latest pics of Shawn Mendes\n\nThe academy is a “first-of-its kind leadership experience for high school graduates from around the world to learn powerful and Read more\n\nIggy Azalea Reveals the Name of Her Baby Boy! Iggy Azalea is revealing her baby son’s name!\n\nThe 30-year-old “Fancy” entertainer made the announcement on her social media on Tuesday (July 14).\n\nPHOTOS: Check out the latest pics of Iggy Azalea\n\nAnd his name is…Onyx!\n\n“Baby boyyyyyyy 🥺,” she captioned an adorable voice audio on her Instagram and a graphic revealing his name: “Amethyst & Onyx.” (If you didn’t know, Iggy‘s real name is Amethyst Amelia Kelly.)\n\n“Baby boy, Read more\n\nTekashi 6ix9ine Will Be Absent from Social Media Again For This Reason Tekashi 69′s social media is going dark because of this… – TMZ\n\nShawn Mendes is doing something big! – Just Jared Jr\n\nAww! The world’s oldest golden retriever! – Lainey Gossip\n\nThis is a historic cover for Vanity Fair. – DListed\n\nLisa Vanderpump is hitting back at Sarah Paulson. – TooFab\n\nThese Glee stars are paying tribute after the tragic news about Naya Rivera. – Towleroad\n\nGet to know the star of the upcoming Babysitter’s Club at Netflix Read more\n\nNaya Rivera's Official Cause of Death Is Revealed Naya Rivera‘s cause of death has been confirmed as drowning.\n\nIn a press release from the Ventura County Medical Examiner’s Office, it states the official cause is from drowning.\n\n“The circumstances and visual characteristics all indicated that the body was that of Naya Rivera and the identity has been confirmed by dental comparison,” it reads. “The body has been x-rayed and a full autopsy has been performed. The autopsy findings are consistent with a drowning and th Read more\n\nMeghan Markle Makes Passionate Speech About Young Women Changing The World For Virtual Conference Meghan Markle wears a brilliant blue top during her speech for GirlUp’s Women in Leadership virtual conference.\n\nThe Duchess of Sussex‘s appearance closed out the virtual event with a speech urging young women to keep changing the world.\n\n“I want to share something with you,” Meghan shared. “It’s that those in the halls and corridors and places of power — from lawmakers and world leaders to executives — all of those people, they depend on you more t Read more\n\nBrad Pitt Was Almost Cast As The Lead For This Iconic Movie, But Turned It Down Can you imagine anyone else as Russell Hammond than Billy Crudup in Almost Famous? Turns out that it was almost Brad Pitt who starred in the famous role instead!\n\nDirector Cameron Crowe spoke about the casting change in a new interview, and his original casting choices for the roles as well including Meryl Streep as Elaine Miller, and Natalie Portman in the role of Penny Lane.\n\n“Brad Pitt was on my mind because I had a really good meeting with him around the time of Say Anything, and he was Read more", "images": ["https://img.newslocker.com/2020/07/15/212220845_725.jpg", "http://www.newslocker.com/images/share-linkedin.png", "https://img.newslocker.com/2020/07/15/212220841_725.jpg", "https://img.newslocker.com/2020/07/15/212224087_725.jpg", "https://img.newslocker.com/2020/07/15/212211680_350.jpg", "https://img.newslocker.com/2020/07/15/212211685_350.jpg", "http://akns-images.eonline.com/eol_images/Entire_Site/2017320/rs_600x600-170420130021-Josh-Henderson-The-Arrangement-108-1.jpg?downsize=450:*&crop=450:350;left,top", "https://img.newslocker.com/2020/07/15/212221839_725.jpg", "http://www.newslocker.com/images/rss.png", "https://img.newslocker.com/2020/07/15/212220837_725.jpg", "http://www.newslocker.com/images/newslocker-cube.png", "https://img.newslocker.com/2020/07/15/212224089_725.jpg", "https://static.addtoany.com/buttons/share_save_120_16.gif", "https://img.newslocker.com/2020/07/15/212224088_725.jpg", "https://img.newslocker.com/2020/07/15/212220840_725.jpg", "https://img.newslocker.com/2020/07/15/212220836_725.jpg", "http://www.newslocker.com/images/newslocker-logo.png", "http://www.newslocker.com/images/share-facebook.png", "https://img.newslocker.com/2020/07/15/212220835_725.jpg", "https://img.newslocker.com/2020/07/15/212211681_350.jpg", "https://img.newslocker.com/2020/07/15/212220847_725.jpg", "https://img.newslocker.com/2020/07/15/212220831_725.jpg", "https://img.newslocker.com/2020/07/15/212220842_725.jpg", "https://img.newslocker.com/2020/07/15/212211683_350.jpg", "https://img.newslocker.com/2020/07/15/212211682_350.jpg", "https://img.newslocker.com/2020/07/15/212220832_725.jpg", "https://img.newslocker.com/2020/07/15/212220843_725.jpg", "https://img.newslocker.com/2020/07/15/212220846_725.jpg", "https://img.newslocker.com/2020/07/15/212211684_350.jpg", "https://img.newslocker.com/2020/07/15/212220844_725.jpg", "https://img.newslocker.com/2020/07/15/212221841_725.jpg", "https://img.newslocker.com/2020/07/15/212220834_725.jpg", "https://img.newslocker.com/2020/07/15/212220833_725.jpg", "http://www.newslocker.com/images/share-twitter.png", "https://img.newslocker.com/2020/07/15/212220839_725.jpg"], "top_img": "http://akns-images.eonline.com/eol_images/Entire_Site/2017320/rs_600x600-170420130021-Josh-Henderson-The-Arrangement-108-1.jpg?downsize=450:*&crop=450:350;left,top", "keywords": [], "authors": [], "canonical_link": "https://www.newslocker.com/en-us/news/celebrity/yikes-kyle-is-furious-after-he-loses-his-movie-to-jeremy-renner-on-the-arrangement-im-gonna-lose-my-s-t/", "title": "Yikes! Kyle Is Furious After He Loses His Movie to Jeremy Renner on The Arrangement: \"I'm Gonna Lose My S--t\"", "meta_data": {"description": "I have some news you're not gonna love...Kyle (Josh Henderson) receives some upsetting news from Deann (Lexa Doig) on tomorrow's episode of The Arrangement. In this...", "og": {"title": "Yikes! Kyle Is Furious After He Loses His Movie to Jeremy Renner on The Arrangement: I'm Gonna Lose My S--t - Celebrity news - NewsLocker", "description": "I have some news you're not gonna love...Kyle (Josh Henderson) receives some upsetting news from Deann (Lexa Doig) on tomorrow's episode of The Arrangement. In this...", "type": "website", "url": "https://www.newslocker.com/en-us/news/celebrity/yikes-kyle-is-furious-after-he-loses-his-movie-to-jeremy-renner-on-the-arrangement-im-gonna-lose-my-s-t/", "image": "http://akns-images.eonline.com/eol_images/Entire_Site/2017320/rs_600x600-170420130021-Josh-Henderson-The-Arrangement-108-1.jpg?downsize=450:*&crop=450:350;left,top", "site_name": "Newslocker"}, "fb": {"admins": 1335791813}, "robots": "index", "google-site-verification": "wAInSoPxz3OEgOXCHtETx-x7ukmlX40FRoiPZpO7ww4", "msvalidate.01": "2F0DB39856FAA0E47C70E9E1FF8653AA"}, "movies": [], "publish_date": 1492869600.0, "source": "http://www.newslocker.com", "summary": ""}