{"url": "https://www.nbc.com/world-of-dance", "text": "NBC's hit dance competition series \"World of Dance\" is back for its fourth season and once again led by a judging panel of extraordinary dance superstars - Jennifer Lopez (who also serves as an executive producer), Derek Hough and NE-YO. Scott Evans returns as host.\n\nThe series, from Universal Television Alternative Studio and Nuyorican Productions, gives dancers the platform to showcase their talents for the opportunity to receive a life-altering grand prize of $1 million and the title of best dancer in the world.\n\nIn partnership with preeminent global dance brand World of Dance, the series brings the world's elite dancers together to compete in epic performances of artistry, precision and athleticism. Solo dancers will compete against duos and crews in an unlimited range of dance, including hip-hop, contemporary, ballet, break-dancing, ballroom and more.\n\nThe contestants are handpicked from qualifying events around the nation and thousands of worldwide online submissions. Competitors are divided into two age divisions to start: Juniors (17 years and under) and Uppers (18 years and older). The competition consists of five rounds: the Qualifiers, the Callbacks, the Duels, the Semi-Finals and the World Final. In the first three rounds, dancers compete within their division, but in the Semi-Finals and the World Final, acts will compete against each other for the $1 million grand prize.\n\nNew for Season 4, only the acts that have both undeniable raw talent and determination will rise above the rest and earn their spot to perform on the \"World of Dance\" stage. To begin the season, contestants now arrive at a warehouse under the impression that they're performing their final audition for a panel of producers. In a surprise twist, hopeful acts will walk onto the dance floor to realize that the Qualifiers have already begun and our \"World of Dance\" judges are there to determine if they have what it takes to make it to the next round. The judges will each give a yes vote, a no vote or a Callback vote. If placed in the Callbacks, acts will have one last chance to perform and earn their spot in the next round.\n\nNew this season for the Duels round, the judges will now choose which acts go head to head, creating epic dance battles and leading to some of the most intense performances the series has ever seen. Acts won't know their opponent until they hit the dance floor, so the stakes have never been higher. Last season's popular Redemption round returns, but this year a special guest judge will decide which acts up for elimination will go head to head to earn the final slot in the Semi-Finals and get their chance to perform on the iconic \"World of Dance\" stage.\n\nFrench duo \"Les Twins\" were crowned the first-ever winners of \"World of Dance\" in the first season, junior team hip-hop group \"The Lab\" took the crown for Season 2 and upper team \"The Kings\" won Season 3. All three groups took home the $1 million grand prize.\n\nWorld of Dance is among the most trusted and fastest-growing dance and music entertainment brands, combining a successful digital platform of more than 8 million subscribers with the world's largest international urban dance competition. What began in 2008 as a single event is now a continent-spanning tour de force of human spirit and sick dance moves. The World of Dance Tour attracts YouTube stars, industry icons and tens of thousands of fans to events in more than 25 countries spanning the US, Europe, South America and Asia. The inspiring performance videos captured from these events drive 30 million monthly views online, making World of Dance the largest dance entertainment channel on YouTube. No language barriers. No animosity. Just pure, awe-inspiring movement.\n\nJennifer Lopez, Elaine Goldsmith-Thomas and Benny Medina executive produce for Nuyorican Productions. Executive producers also include Matilda Zoltowski, Tina Nicotera Bachmann, Alex Rudzinski, David Gonzalez, Matthew Everitt and Al Hassas. The series is produced by Universal Television Alternative Studio in association with Nuyorican Productions and World of Dance.", "images": ["https://img.nbc.com/sites/nbcunbc/files/images/2020/5/11/WOD_S4-Logo-1920x1080_v2.jpg"], "top_img": "https://img.nbc.com/sites/nbcunbc/files/images/2020/5/11/WOD_S4-Logo-1920x1080_v2.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.nbc.com/world-of-dance", "title": "World of Dance", "meta_data": {"description": "World of Dance - Watch episodes on NBC.com and the NBC App. Jennifer Lopez, Derek Hough and NE-YO judge the hit dance competition.", "og": {"type": "tv_show", "title": "World of Dance - NBC.com", "description": "World of Dance - Watch episodes on NBC.com and the NBC App. Jennifer Lopez, Derek Hough and NE-YO judge the hit dance competition.", "image": {"identifier": "https://img.nbc.com/sites/nbcunbc/files/images/2020/5/11/WOD_S4-Logo-1920x1080_v2.jpg", "type": "image/jpg", "width": 1920, "height": 1080}, "site_name": "NBC", "url": "https://www.nbc.com/world-of-dance"}, "al": {"android": {"package": "com.nbcuni.nbc", "url": "nbctve://shows/world-of-dance", "app_name": "NBC"}, "ios": {"app_store_id": 442839435, "app_name": "NBC", "url": "nbctve://shows/world-of-dance"}, "ipad": {"app_store_id": 442839435, "app_name": "NBC", "url": "nbctve://shows/world-of-dance"}, "iphone": {"app_store_id": 442839435, "app_name": "NBC"}, "web": {"url": "https://www.nbc.com/world-of-dance", "should_fallback": "true"}}, "twitter": {"title": "World of Dance - NBC.com", "card": "app", "description": "World of Dance - Watch episodes on NBC.com and the NBC App. Jennifer Lopez, Derek Hough and NE-YO judge the hit dance competition.", "image": "https://img.nbc.com/sites/nbcunbc/files/images/2020/5/11/WOD_S4-Logo-1920x1080_v2.jpg", "app": {"name": {"iphone": "NBC", "ipad": "NBC", "googleplay": "NBC"}, "id": {"iphone": 442839435, "ipad": 442839435, "googleplay": "com.nbcuni.nbc"}, "url": {"iphone": "nbctve://shows/world-of-dance", "ipad": "nbctve://shows/world-of-dance", "googleplay": "nbctve://shows/world-of-dance"}, "country": "US"}, "site": {"identifier": "@nbc", "id": 26585095}, "url": "https://www.nbc.com/world-of-dance"}, "viewport": "width=device-width, initial-scale=1", "apple-media-service-subscription": "expires=9999, type=free", "fb": {"app_id": 653521154659171}}, "movies": [], "publish_date": null, "source": "https://www.nbc.com", "summary": ""}