{"url": "www.businessinsider.com/prince-harry-net-worth-2018-4", "text": "Prince Harry's net worth is at least $25 million, which is made up of inheritance from Princess Diana and an annual allowance from Prince Charles.\n\nAfter the royal wedding, Meghan Markle and Prince Harry will merge their finances and forego a prenuptial agreement\n\nTogether, Meghan Markle and Prince Harry will have a net worth of at least $30 million.\n\nAdvertisement\n\nThat's a sizable contribution to bring into any marriage, but when she marries Prince Harry, their combined net worth will be more than five times that. Prince Harry's net worth is at least $25 million (£18 million) and as much as $40 million (£28.7 million), according to estimates from Wealth-X.\n\nAdvertisement\n\nHere's where all that money comes from.\n\nAlong with Prince William and Kate Middleton, Harry receives an annual seven-figure allowance from his father and heir to the throne, Prince Charles, which is used to cover expenses like travel and wardrobe. Between April 2016 and March 2017, the Duke and Duchess of Cambridge and Harry split nearly $5 million (£3.5 million) in allowance from their father, according to an annual review released by Clarence House.\n\nAdvertisement\n\nPrince Charles derives that money, in part, from a private estate called the Duchy of Cornwall, which has funded the royal family's public and private lives for nearly 700 years. The estate provided a total of $28.8 million (£20.7 million), including Harry and William's allowance, to Prince Charles and his wife Camilla between between 2016 and 2017.\n\nSince age 21, Harry and William have also been receiving a $450,000 a year investment profit from Princess Diana's estate, which they pay taxes on to the UK government. They received a sizeable inheritance from their late mother estimated to be around $10 million each, which each prince gained access to on his 30th birthday. Plus, during his 10 years in the British Royal Air Force, Harry earned an annual income of $50,000.\n\nDespite a massive fortune, Markle and Harry reportedly will not sign a prenuptial agreement before their wedding, reported Business Insider's Shana Lebowtiz.\n\nAdvertisement\n\nA prenup is a smart choice for most couples who have sizable assets they want to protect in the event of a divorce, but for Harry - and William, who chose to forgo a prenup with Middleton - it doesn't make much sense. The princes likely don't have much property of their own, as the most valuable national treasures like the Crown Jewels or the Tower of London are part of the royal collection held by the Queen\n\nStill, the merging of Harry and Markle's finances could \"cause tax headaches\" and create some \"mundane hurdles\" for the royal family, as The Washington Post first reported in November.\n\nMarkle is a citizen of the US and is purportedly living in the UK on a family visa, according to the BBC. If she eventually becomes a dual US-UK citizen, Markle will have to continue filing her taxes each year with the IRS. If she has more than $300,000 in assets at any point during the year, she will have to file a specific form that details foreign assets, which could include foreign trusts, subjecting the royal family \"to outside scrutiny,\" according to the Post. But ultimately there are a lot of factors that come into play.\n\nAdvertisement\n\n\"The key for Meghan and her advisors would be to figure out what type of income she will be getting,\" Avani Ramnani, director of financial planning and wealth management at Francis Financial , told Business Insider. \"Will this income be from the investments of a trust, or 'wages' for any work that she does, or any other type of income? Sometimes, getting one form of income is more advantageous than another.\"\n\nKensington Palace will cover the cost of the wedding - aside from Markle's dress - which is expected to cost the royal family upwards of $45 million (£32 million), most of which is allotted for security.\n\nAdvertisement\n\nThat won't be a huge cost burden for Queen Elizabeth, who is of course the wealthiest member of the royal family with an estimated net worth of $530 million as of 2016, according to Forbes", "images": ["http://b.scorecardresearch.com/p?c1=2&c2=9900186&cv=2.0&cj=1", "http://www.businessinsider.com/thumb/msid-60085318,width-65,height-47/default-thumb.jpg", "https://static-ssl.businessinsider.com/image/5ae0a6b019ee8627008b461e-1065/royal family.jpg", "https://static-ssl.businessinsider.com/image/5adf80d219ee8649008b486f-887/gettyimages-948753890.jpg", "http://www.businessinsider.com/photo/50740876/downarrow.jpg", "https://static-ssl.businessinsider.com/image/5ae0a9a719ee8626008b461c-1250/meghan markle prince harry.jpg", "https://www.businessinsider.in/photo/63917429/together-meghan-markle-and-prince-harry-will-be-worth-about-30-million-and-none-of-that-money-belongs-to-the-crown.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=13194393&cv=2.0&cj=1", "http://www.businessinsider.com/thumb/msid-60085318,width-100,height-70/default-thumb.jpg"], "top_img": "https://www.businessinsider.in/photo/63917429/together-meghan-markle-and-prince-harry-will-be-worth-about-30-million-and-none-of-that-money-belongs-to-the-crown.jpg", "keywords": [], "authors": [], "canonical_link": "http://www.businessinsider.com/prince-harry-net-worth-2018-4", "title": "Together, Meghan Markle and Prince Harry will be worth about $30 million - and none of that money belongs to the crown", "meta_data": {"description": "Chris Jackson - WPA Pool/Getty ImagesPrince Harry's net worth is 8-figures.Prince Harry's net worth is at least $25 million, which is made up of inheritance", "keywords": "yourmoney,politics,careers", "twitter": {"card": "summary_large_image", "site": "@BiIndia", "url": "https://www.businessinsider.in/together-meghan-markle-and-prince-harry-will-be-worth-about-30-million-and-none-of-that-money-belongs-to-the-crown/articleshow/63917429.cms", "title": "Together, Meghan Markle and Prince Harry will be worth about $30 million - and none of that money belongs to the crown", "description": "Chris Jackson - WPA Pool/Getty ImagesPrince Harry's net worth is 8-figures.Prince Harry's net worth is at least $25 million, which is made up of inheritance", "image": "https://www.businessinsider.in/photo/63917429/together-meghan-markle-and-prince-harry-will-be-worth-about-30-million-and-none-of-that-money-belongs-to-the-crown.jpg"}, "news_keywords": "yourmoney,politics,careers", "og": {"site_name": "Business Insider", "type": "article", "title": "Together, Meghan Markle and Prince Harry will be worth about $30 million - and none of that money belongs to the crown", "url": "https://www.businessinsider.in/together-meghan-markle-and-prince-harry-will-be-worth-about-30-million-and-none-of-that-money-belongs-to-the-crown/articleshow/63917429.cms", "image": "https://www.businessinsider.in/photo/63917429/together-meghan-markle-and-prince-harry-will-be-worth-about-30-million-and-none-of-that-money-belongs-to-the-crown.jpg"}, "fb": {"app_id": 645465345465774, "admins": 556964827}, "website": "https://www.businessinsider.in", "robots": "NOODP", "google-site-verification": "NpZv5Qfl0TuFiebbwMualP_h2a3QtmQGFjE9hhw9um8", "HandheldFriendly": "True", "MobileOptimized": 320, "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0, maximum-scale=1.0, user-scalable=no"}, "movies": [], "publish_date": null, "source": "http://www.businessinsider.com", "summary": ""}